[{"name": "Junior Python Developer", "url": "https://hh.ru/vacancy/110711272", "requirement": "Basic knowledge of Python or 1 year in a role focused on Python backend development (perfectly with Django framework). ", "responsibility": "Build and maintain back-end for Improvado's marketing analytics SaaS platform (including architectural improvements regarding scalability, reliability and performance). ", "salary": 0}, {"name": "Junior Python Developer", "url": "https://hh.ru/vacancy/110412718", "requirement": "Базовые знания Python. Опыт написания REST приложений на любом Python фреймворке (Flask, FastAPI, Django и др.). Понимание основ SQL и...", "responsibility": null, "salary": 65000}, {"name": "Junior Python developer", "url": "https://hh.ru/vacancy/108800548", "requirement": "Soft skills — это первое, на что мы будем обращать внимание, поэтому нам важно видеть в тебе нацеленность на результат, желание...", "responsibility": "Когда-то Циан был просто таблицей в Excel, в которой хранились квартиры, выставленные на продажу. Сейчас это самый большой маркетплейс...", "salary": 0}, {"name": "Python-разработчик", "url": "https://hh.ru/vacancy/111157153", "requirement": "Опыт работы с Python не менее 1 года + опыт разработки бэкенд-приложений. Уверенное знание библиотек для работы с видео...", "responsibility": "Стартап в сфере генерации видео с использованием AI-моделей. Ищу <highlighttext>Python</highlighttext> <highlighttext>разработчика</highlighttext> для создания бэкенда, который будет интегрирован с AI...", "salary": 50000}, {"name": "Python-разработчик", "url": "https://hh.ru/vacancy/109217414", "requirement": "Опыт коммерческой разработки на Python от 2 лет. Глубокое знание фреймворков Django или FastAPI. Опыт работы с системами очередей и...", "responsibility": "Разработка интеграций и микросервисов в передовом проекте электронной торговли. Создание распределенные, масштабируемые и отказоустойчивые e-commerce системы. Реализация новых продуктовых...", "salary": 0}, {"name": "Python-разработчик (Junior - Middle)", "url": "https://hh.ru/vacancy/110423905", "requirement": "Рython3+. Django 2+, опыт работы от 1 года. Django REST Framework. MySQL. MariaDB. Умение работать с git. ", "responsibility": "Доработка и разработка нового функционала. Написание документации по доработанному функционалу. Разработка пользовательских сервисов. Рефакторинг и оптимизация под растущую нагрузку. ", "salary": 70000}, {"name": "Python разработчик", "url": "https://hh.ru/vacancy/110966239", "requirement": "Опыт коммерческой разработки на Python от 2-х лет. Знание одного из фреймворков: Flask, FastApi, Litestar. Понимание принципов работы реляционных...", "responsibility": "Разработка программного кода. Подготовка тестовых наборов данных в соответствии с выбранной методикой. Рефакторинг и оптимизация кода. Работа с системой контроля...", "salary": 0}, {"name": "Программист Python", "url": "https://hh.ru/vacancy/110916753", "requirement": "Уверенные знания Python и основных библиотек. — Понимание принципов ООП и структур данных. — Опыт работы с базами данных (например, PostgreSQL, MySQL...", "responsibility": "Разработка и поддержка веб-приложений и внутренних инструментов на Python. — Участие в проектировании архитектуры и реализации новых функций. — ", "salary": 200000}, {"name": "Python-developer", "url": "https://hh.ru/vacancy/110820028", "requirement": "Уверенное владение Python. Парсинг данных. Умение распознавать и применять основные шаблоны проектирования. Опыт интеграции со сторонними системами по API. ", "responsibility": "Разработка высоконагруженных backend-сервисов. Написание сетевых многопоточных приложений. Разработка высоконагруженных сервисов. Работа с Сlickhouse. Написание парсеров. Работа с менеджерами очередей.", "salary": 220000}, {"name": "Python developer", "url": "https://hh.ru/vacancy/111041609", "requirement": "Опыт работы с одним или более фреймворком: Django, Flask, Aiohttp. Базовые знания реляционных баз данных и SQL. Понимание REST, HTTP...", "responsibility": null, "salary": 0}, {"name": "Python-разработчик (Junior)", "url": "https://hh.ru/vacancy/110038797", "requirement": "Базовые знания Python. Знание основ работы с FastAPI. Знание основ работы с PostgreSQL (MongoDB будет плюсом). Понимание принципов REST. ", "responsibility": "Участие в разработке и поддержке веб-приложений на Python. Помощь в интеграции сторонних сервисов и API. Поддержка существующего кода и...", "salary": 180000}, {"name": "Junior Python Engineer", "url": "https://hh.ru/vacancy/110646488", "requirement": "1+ year of professional work experience as a <highlighttext>Python</highlighttext> <highlighttext>developer</highlighttext>. Understanding and using test driven development. Experience working with...", "responsibility": "Working on product implementations and interacting directly with client. Back-end development using general-purpose programming language - Python. ", "salary": 0}, {"name": "Middle Python разработчик", "url": "https://hh.ru/vacancy/111224443", "requirement": "Опыт работы с Python (от года месяцев). Опыт работы с RESTful API и умение извлекать и обрабатывать данные. ", "responsibility": "Разработка и поддержка ботов для автоматизации HR-процессов. Интеграция с внутренними и внешними API для сбора и обработки данных о...", "salary": 0}, {"name": "Python разработчик", "url": "https://hh.ru/vacancy/110869448", "requirement": "Flask.  threading для многозадачности.  PyArmor или аналогичные инструменты для защиты кода.", "responsibility": "Описание текущего состояния. Программа уже реализована, включает следующие компоненты:  Автоматизация действий с помощью Selenium (undetected_chrome_driver) для накрутки ПФ на Яндекс.Картах...", "salary": 50000}, {"name": "Стажер Python-разработчик", "url": "https://hh.ru/vacancy/109364540", "requirement": "Базовые знания Python и понимание основ ООП. Желателен опыт работы с библиотеками для работы с PDF и инструментами для распознавания...", "responsibility": "Ищем начинающего <highlighttext>Python</highlighttext>-<highlighttext>разработчика</highlighttext> для работы над проектом по оцифровке PDF-документов. Задача — доработка и создание обработчиков для различных типов...", "salary": 80000}, {"name": "Backend python разработчик", "url": "https://hh.ru/vacancy/108943141", "requirement": "Хорошее знание Python и популярных фреймворков (Django, Flask). Опыт работы с системами контроля версий (Git). Опыт работы с базами данных...", "responsibility": "Разработка и поддержка backend-компонентов на Python. Интеграция и разработка API, взаимодействие с различными внешними системами. Работа с базами данных...", "salary": 0}, {"name": "Junior Backend разработчик (Python)", "url": "https://hh.ru/vacancy/109095320", "requirement": "Основа технологии — серверная платформа (Linux / PostgreSQL / Redis / RoR / Go microservices), взаимодействующая с веб-приложениями (Angular) и мобильными приложениями (на Flutter). ", "responsibility": "Взаимодействие: jira, git, discord. Принимать участие в проектировании и разработке нашей системы – софта для автоматизации управления полевым персоналом. ", "salary": 90000}, {"name": "Python-разработчик", "url": "https://hh.ru/vacancy/109466467", "requirement": "Опыт от 1,5 лет коммерческой разработки. Готовность изучать новое и погружаться в большие проекты. Уверенное знание Python, Django или...", "responsibility": null, "salary": 100000}, {"name": "Python developer Junior + / Middle", "url": "https://hh.ru/vacancy/110817030", "requirement": "Опыт разработки на Python от полугода. Знание алгоритмов и структур данных+ умение применить на практике. Понимание REST API. ", "responsibility": "Разработка и поддержка API для взаимодействия клиентской части игры с сервером. Проектирование и оптимизация схем баз данных для эффективного хранения...", "salary": 0}, {"name": "Junior Python Developer", "url": "https://hh.ru/vacancy/110756202", "requirement": "Базовые знания Python версии 3.7 - 3.11. - Базовые знания Django и Django REST framework (умение написать Middleware а также...", "responsibility": "Unit-тесты. - Написание нового и поддержка легаси кода. - Оптимизация ORM-запросов. - Написание unit-тестов.", "salary": 500000}, {"name": "Python developer", "url": "https://hh.ru/vacancy/109473361", "requirement": "Опыт разработки на python 3 от 1.5-го года. Практический опыт разработки в команде от 1-го года с...", "responsibility": "Разрабатывать и поддерживать новые возможности нашей платформы с учётом высокой безопасности данных и нагрузки на сервис. Разрабатывать чат-боты и...", "salary": 0}, {"name": "Python разработчик (Django)", "url": "https://hh.ru/vacancy/110883330", "requirement": "Основное - желание развиваться, стрессоустойчивость, готовность к плотной работе. Знание Python. Знание Django, DRF. Знание SQL. REST API. Наличие завершенных проектов. ", "responsibility": "Разработка новых и поддержка существующих сервисов. Взаимодействие с менеджером, дизайнером, мобильными и frontend разработчиками. Оценка трудоемкости задач.", "salary": 90000}, {"name": "Middle Python Developer", "url": "https://hh.ru/vacancy/111218177", "requirement": "Необходимо знание асинхронного программирования (asyncio). Приветствуется: - понимание, как работают платёжные системы изнутри (опыт интеграции с платежными системами). - знание JavaScript. - ", "responsibility": "Аккредитации IT-компании нет. Проект с которым предстоит работать: Платформа для реализации FinTech - сервисов. Стeк: - Микросервисная архитектура. - Для исходящих HTTP...", "salary": 250000}, {"name": "Python-разработчик (Middle)", "url": "https://hh.ru/vacancy/111227661", "requirement": "Опыт промышленной разработки на Python от года. Опыт работы с реляционными базами данных. Надо понимать не только как сделать запросы...", "responsibility": "Разрабатывать ядро и приложения биллинга. Много правил, сложная логика, работа с деньгами. Участвовать в проектировании фич. Это непросто. ", "salary": 170000}, {"name": "Python-разработчик (Цифра Роботикс)", "url": "https://hh.ru/vacancy/110975389", "requirement": "Отличное знание Python. Свободное владение linux (bash, sed, grep и другие утилиты). Понимание работы сетей и протоколов: TCP/UDP, HTTP...", "responsibility": "Разработка программного обеспечения серверной части автоматизированной системы грузоперевозок. Написание юнит тестов. Оптимизация/Баг фикс. Code Review. Написание документации к разрабатываемым...", "salary": 0}, {"name": "Middle Python разработчик", "url": "https://hh.ru/vacancy/111217245", "requirement": "Опыт работы <highlighttext>Python</highlighttext>-<highlighttext>разработчиком</highlighttext> или специалистом по математическому моделированию. Опыт работы по разработке микросервисных решений на базе Python (FastAPI, Django...", "responsibility": "Участие в проектировании и реализации архитектурных решений. Реализацией модулей взаимодействия между сервисами, приложениями и серверами. Анализ предметной области моделирования и...", "salary": 0}, {"name": "Python developer (FastAPI)", "url": "https://hh.ru/vacancy/110869678", "requirement": "Python 3.11. FastAPI. SQLAlchemy. PostgreSQL. Kafka. Kubernetes. KeyDB. GitLab CI/CD. EFK. Умение писать тестируемый поддерживаемый код. ", "responsibility": "Разрабатывать новые сервисы. Участвовать в проектировании архитектуры системы. Проводить code review, рефакторить код, писать тесты. Искать узкие места и улучшать...", "salary": 0}, {"name": "Python-разработчик", "url": "https://hh.ru/vacancy/110821250", "requirement": "Знания Python 3. Хорошие знания Selenium/Appium (работа более 1 года с этим стеком). Опыт работы с автоматизацией тестирования. ", "responsibility": "Написание скриптов для автоматизации работы браузера.", "salary": 140000}, {"name": "Python-разработчик", "url": "https://hh.ru/vacancy/110307647", "requirement": "Уверенное знание Python 3 и опыт работы с Django Rest Framework (DRF) и FastAPI от 2 лет. - Понимание принципов REST...", "responsibility": "Разработка и поддержка REST API с использованием Django Rest Framework (DRF) и FastAPI. - Оптимизация производительности приложений и обеспечение высокой скорости...", "salary": 0}, {"name": "Middle Python разработчик", "url": "https://hh.ru/vacancy/111085075", "requirement": "Опыт разработки на Python от 2.5 лет. Опыт работы с Fast Api. Опыт работы с микросервисами. Опыт написания автотестов. ", "responsibility": "Писать чистый и эффективный код на Python. Анализировать технического задания и определение функционала бота. Интегрировать различные части нашей системы с...", "salary": 0}, {"name": "Python-разработчик", "url": "https://hh.ru/vacancy/109770940", "requirement": "Опыт разработки на Python от 2 лет. Опыт работы с фреймворками Django и FastAPI. Знание принципов чистой архитектуры и умение...", "responsibility": "Разработка и поддержка веб-приложений на Python с использованием фреймворков Django и FastAPI. Написание эффективного и поддерживаемого кода с применением...", "salary": 0}, {"name": "Python-разработчик", "url": "https://hh.ru/vacancy/110647674", "requirement": "Наши ожидания относительно знаний, навыков, опыта: Опыт коммерческой разработки на Python. Опыт работы с SQL, Redis, Kafka. Опыт работы с...", "responsibility": "Разработка систем и программных модулей на Python. Тестирование и отладка программных модулей. Поддержка и оптимизация существующего кода. Документирование работы разработанных...", "salary": 140000}, {"name": "Python-разработчик", "url": "https://hh.ru/vacancy/110892082", "requirement": "Глубокое знание Python и опыт в асинхронном программировании. - Уверенное владение инструментами для создания RESTful API с использованием Python. - ", "responsibility": "Разработка и поддержка серверной части веб-приложений с использованием Python, включая создание и оптимизацию асинхронных функций для повышения производительности (asyncio...", "salary": 50000}, {"name": "Python-разработчик (trainee)", "url": "https://hh.ru/vacancy/108812373", "requirement": "Опыт разработки на Python от 1 года. Опыт работы с базами данных (Postgres, MongoDB, Redis). Понимание механизмов интегрирования (Restful, RPC...", "responsibility": "Заниматься разработкой интеграций между системами на языке python: Поддерживать и оптимизировать существующие решения.", "salary": 0}, {"name": "Python Developer", "url": "https://hh.ru/vacancy/111205936", "requirement": "Commercial experience with Python for 1+ years. Good knowledge of Python, PostgreSQL, MongoDB. Willingness to learn Docker, Kubernetes, FastAPI. ", "responsibility": "Automating pipelines for building an expert crowd. Building a new pipelines engine. Developing methods to automate support processes. ", "salary": 0}, {"name": "Python разработчик", "url": "https://hh.ru/vacancy/111207454", "requirement": "Опыт с асинхронными Python веб-фреймворками: FastAPI, asyncio, django 3.0+ и тп. Опыт дизайна схемы данных для SQL...", "responsibility": "Написание интеграционных тестов: pytest, unittest и тп. Разработка планов развития хард скилов для бекенд команды. Стек проекта: Дизайн и разработка...", "salary": 0}, {"name": "Python-разработчик", "url": "https://hh.ru/vacancy/109752796", "requirement": "Знание Python. Понимание работы TG ботов.", "responsibility": "Поддержка существующих проектов. Разработка ТГ ботов и микросервисов.", "salary": 50000}, {"name": "Python разработчик", "url": "https://hh.ru/vacancy/110985215", "requirement": "Опыт разработки на Python от 3-х лет, опыт с Django обязателен. Понимание веб-стека, принципов REST и построения реляционных...", "responsibility": "Активно участвовать во всех этапах разработки в составе команды: от сбора и анализа требований до написания кода и выкатки в...", "salary": 220000}, {"name": "Python-разработчик (Junior)", "url": "https://hh.ru/vacancy/109592349", "requirement": "Горишь желанием развиваться в сфере разработки, постоянно учишься новому и стремишься к новым знаниям. Увлечен миром программирования и Python - твой...", "responsibility": "Разрабатывать backend-часть веб-приложений на Python: Ты будешь создавать логику приложения, разрабатывать API и интегрировать его с базами данных. ", "salary": 60000}, {"name": "Junior Python разработчик", "url": "https://hh.ru/vacancy/108410638", "requirement": "Знание Python 3.х. Опыт работы с БД PostgreSQL (Написание процедур, функций, триггеров и вью). Умение работать с системой контроля...", "responsibility": "Разработка приложений и скриптов для автоматизации работы с БД. Разработка симулятор и имитаторов внешних систем для автоматизации процессов тестирования ПО. ", "salary": 65000}, {"name": "Младший Python-разработчик (Django, DRF)", "url": "https://hh.ru/vacancy/109870881", "requirement": "Коммерческий опыт разработки — от 1 года. Коммерческий опыт с Django, DRF. Будет плюсом — навык работы с FastAPI. Понимание процессов непрерывной...", "responsibility": "Разработка новых фичей и поддержка внутренних сервисов. Покрытие тестами своего кода. Проведение код-ревью своих коллег. Участие в проектировании архитектуры.", "salary": 100000}, {"name": "Программист Python / Разработчик Python", "url": "https://hh.ru/vacancy/111072465", "requirement": "Уверенные знания Python и опыт работы с объектно-ориентированным программированием (ООП). Опыт работы с библиотеками компьютерного зрения (CV), в частности...", "responsibility": "Разработка и внедрение алгоритмов распознавания блюд с использованием технологий компьютерного зрения. Создание подпрограммы для интеграции с кассовым местом самообслуживания. ", "salary": 0}, {"name": "Python-разработчик (Junior)", "url": "https://hh.ru/vacancy/109420687", "requirement": "Уверенные знания Python. Опыт работы с FastAPI / Flask. Знание основ SQL. Опыт работы с Linux. Понимание основ работы с сетями. ", "responsibility": "Разработкой API. Разработкой и реализацией Unit-тестов. Написанием технической документации.", "salary": 75000}, {"name": "Python-разработчик", "url": "https://hh.ru/vacancy/110669708", "requirement": "Опыт разработки на Python/Django от 3-х лет. Опыт работы с PostgreSQL/Redis. Опыт коммерческой разработки REST API. ", "responsibility": "Разработка новых функций сервиса. Развитие архитектуры проекта. Code Review.", "salary": 0}, {"name": "Python программист (удаленно)", "url": "https://hh.ru/vacancy/110099099", "requirement": "Experience in Python Production development. Experience in large-scale systems development. Fluent Russian (meeting with Russian dev team). Written english. ", "responsibility": "Build and maintain back-end. Write tests using Pytest and other libraries. Write clean, maintainable, and well-documented code. ", "salary": 320000}, {"name": "Python-разработчик", "url": "https://hh.ru/vacancy/110742765", "requirement": "Опыт промышленной разработки на Python от 3-х лет. Участие в разработке сложных сервисов с интеграциями с нуля. ", "responsibility": "Участвовать в разработке внутренней платформы AI. Развивать экосистему внутренних сервисов Лаборатории ИИ. Реализовывать взаимодействие с внешним миром и внутренними решениями...", "salary": 0}, {"name": "Python разработчик", "url": "https://hh.ru/vacancy/110629661", "requirement": "Используемые технологии: - Flask. - Sql.", "responsibility": "Чем делать: Реализовывать фичи, покрывать их тестами. Участвовать в кросс-кодревью коллег. Багфиксы. Участвовать в проработке и декомпозиции задач.", "salary": 250000}, {"name": "Python Developer", "url": "https://hh.ru/vacancy/109857872", "requirement": "Языки программирования: Python (уверенное владение). Kafka: Опыт работы с распределёнными системами обмена сообщениями. FastAPI: Опыт создания веб-сервисов на Python...", "responsibility": "Поддержка и развитие существующих сервисов. Настройка и тюнинг функционала в зависимости от требований. Разработка новых функциональных возможностей. Внедрение генеративных моделей...", "salary": 0}, {"name": "Python-разработчик (Junior-Middle)", "url": "https://hh.ru/vacancy/110036254", "requirement": "Опыт работы с Python от 1 года. Глубокое знание библиотеки Pandas для обработки и анализа данных. Понимание принципов SOLID и...", "responsibility": "Разработка и поддержка программного обеспечения для сбора, обработки и анализа данных с электронных маркетплейсов. Работа с большими объемами данных, использование...", "salary": 70000}, {"name": "Python-разработчик", "url": "https://hh.ru/vacancy/110707181", "requirement": "Опыт работы с графическими библиотеками (Flet, Kivi, PyQt). Опыт работы с Git. Опыт работы с USB/COM/Ethernet стеками в...", "responsibility": "Разработка мультиплатформенных приложений (Windows/Linux/MacOS). Документирование кода. Написание автотестов.", "salary": 120000}, {"name": "Программист Python (Django, FastApi)", "url": "https://hh.ru/vacancy/109571225", "requirement": "Уверенное знание языка Python3. Опыт работы с Linux, GIT. Знания реляционных баз данных и SQL. Опыт работы с фреймворком...", "responsibility": "Создавать Web-сервисы и микросервисы. Писать код на Python. Проектировать и реализовывать API для веб, мобильных и приложений. ", "salary": 0}, {"name": "Python-разработчик", "url": "https://hh.ru/vacancy/110742764", "requirement": "Опыт промышленной разработки на Python от 3-х лет. Участие в разработке сложных сервисов с интеграциями с нуля. ", "responsibility": "Участвовать в разработке внутренней платформы AI. Развивать экосистему внутренних сервисов Лаборатории ИИ. Реализовывать взаимодействие с внешним миром и внутренними решениями...", "salary": 0}, {"name": "Python Developer", "url": "https://hh.ru/vacancy/110117743", "requirement": "Python - flask/aiohttp/django, requests, SQLAlchemy, asyncio. Базовые навыки работы в cli, bash/zsh - SQL - написание сложных запросов (оконные функции...", "responsibility": "Разработка нового функционала для СПР (системы принятия решений). Разработка скриптов для обработки кредитных заявок (Java, Python, SQL). Интеграция новых источников...", "salary": 0}, {"name": "Middle Python Developer", "url": "https://hh.ru/vacancy/111068903", "requirement": "Опыт разработки коммерческих проектов на Python актуальных версий от 3х лет с использованием популярных фреймворков (мы используем Django и...", "responsibility": "Использование Docker для локальной работы. — Работать на крупных проектах с долгосрочной разработкой.", "salary": 200000}, {"name": "Python developer (офис/гибрид)", "url": "https://hh.ru/vacancy/111193655", "requirement": "Опыт промышленной разработки на Python от 3 лет. Опыт работы со Flask/Django, мы используем Flask. Отличное знание SQL. ", "responsibility": "Участие в разработке системы анализа процессов: подсистема работы с данными и их преобразовании. Разработка бэкенда и архитектуры системы в целом. ", "salary": 0}, {"name": "Python backend developer", "url": "https://hh.ru/vacancy/108351017", "requirement": "Опыт разработки backend от 3 лет. - Глубокое знание Python и асинхронного программирования (asyncio, aiohttp/FastAPI). - Умение работать с Docker и...", "responsibility": "Разработка новых серверных приложений: системы мониторинга, управления и внутренних/внешних порталов. - Создание прототипов и вспомогательных программ для тестирования функционала. - ", "salary": 0}, {"name": "Python-разработчик", "url": "https://hh.ru/vacancy/109554107", "requirement": "Глубокое знание Python и опыт в асинхронном программировании. - Уверенное владение инструментами для создания RESTful API с использованием Python. - ", "responsibility": "Разработка и поддержка серверной части веб-приложений с использованием Python, включая создание и оптимизацию асинхронных функций для повышения производительности (asyncio...", "salary": 50000}, {"name": "Python-разработчик", "url": "https://hh.ru/vacancy/111051608", "requirement": "Опыт Backend разработки от 3-х лет. Знания фреймворков. Знание SQL. Хорошее знание Docker. Опыт работы с NoSQL-решениями. ", "responsibility": "Разработка новых фичей системы распознавания. Доработка существующего функционала продукта на основе коробочного решения. Написание понятного, прозрачного кода. Использование в работе...", "salary": 250000}, {"name": "Middle+/Senior Python Developer", "url": "https://hh.ru/vacancy/111069559", "requirement": "Практический коммерческий опыт разработки на Python от 4 лет. - Опыт и знание Django, DRF. - Опыт работы с брокером очередей Celery. - ", "responsibility": "Работа с легаси и разработка нового кода. - Проведение код ревью. - Контроль реализации командами разработки кода, на соответствие принятым стандартам и...", "salary": 400000}, {"name": "Программист Python (внутренние проекты) / Python Developer (internal projects)", "url": "https://hh.ru/vacancy/110607304", "requirement": "Опыт разработки на Python от 1 года, знание asyncio. Опыт работы с базами данных (Postgres/MongoDB), очередями сообщений (RabbitMQ), веб...", "responsibility": "Разработка новых и поддержка существующих проектов на Python 3, связанных с вирусным анализом.", "salary": 0}, {"name": "Python-разработчик", "url": "https://hh.ru/vacancy/110446702", "requirement": "Хорошее знание фреймворков FastAPI. Хорошее знание SQL. Понимание принципов ООП (SOLID, DRY, KISS). Уверенный уровень владения Git и командной строки. ", "responsibility": "Разработка программного обеспечения с использованием языка программирования Python. Поддержка и улучшение существующего программного обеспечения. Написание и запуск тестов для проверки...", "salary": 200000}, {"name": "Python-разработчик", "url": "https://hh.ru/vacancy/109079998", "requirement": "Имеешь опыт разработки web приложений. — Занимаешься разработкой на Python 3.10 от 3х лет. — Имеешь опыт работы с фреймворком...", "responsibility": "Разрабатывать web приложения. — Проектировать, разрабатывать и реализовывать API для взаимодействия между различными системами. — Делать интеграции с сервисами — разрабатывать решения для...", "salary": 0}, {"name": "Jun+/Middle Python Developer", "url": "https://hh.ru/vacancy/110634015", "requirement": "Опыт работы с Python от 2+ лет. Знание и опыт работы с Flask\\Quart или FastAPI, а также Celery...", "responsibility": "Участие в оценке, планировании и разработке архитектуры новых проектов. Создание и поддержка высоконагруженных и геораспределенных сервисов, включая обеспечение отказоустойчивости, оптимизацию...", "salary": 0}, {"name": "Middle Python Developer [Bridge]", "url": "https://hh.ru/vacancy/111203273", "requirement": "Опыт уверенной разработки на python (3.9 и выше), опыт с asyncio, aiohttp от года и более. Понимание принципов и...", "responsibility": "Разрабатывать и выстраивать архитектуру, определять технические и программные требования к ПО. Проводить оценку и согласовывать сроки выполнения поставленных задач. ", "salary": 0}, {"name": "Python Developer в Краткосрочную аренду", "url": "https://hh.ru/vacancy/110153452", "requirement": "Имеете опыт разработки на Python 3.X. Понимаете механику языка Python и сопутствующих инструментов (pytest, mypy, poetry, flake8). ", "responsibility": "Реализовывать высоконагруженные и производительные сервисы на Python. Участвовать в проектировании архитектуры, выработке решений по отказоустойчивости и производительности. Интегрироваться с партнерами...", "salary": 0}, {"name": "Python разработчик", "url": "https://hh.ru/vacancy/110135402", "requirement": "Коммерческий опыт разработки на Python и использования Django / FastAPI от 3-х лет. Опыт работы с микросервисной архитектурой. ", "responsibility": "Участие в разработке проектов. Разработка backend (REST API ) для сервисов, как в рамках новых проектов, так и для уже существующих. ", "salary": 350000}, {"name": "Python-разработчик", "url": "https://hh.ru/vacancy/110742766", "requirement": "Опыт промышленной разработки на Python от 3-х лет. Участие в разработке сложных сервисов с интеграциями с нуля. ", "responsibility": "Участвовать в разработке внутренней платформы AI. Развивать экосистему внутренних сервисов Лаборатории ИИ. Реализовывать взаимодействие с внешним миром и внутренними решениями...", "salary": 0}, {"name": "Python-разработчик", "url": "https://hh.ru/vacancy/110352216", "requirement": "Python 3, библиотеки aiohttp/flask/django, sqlalchemy. JS/Typescript - Vue, Angular, React (на выбор). Postgresql/Mysql;CSS - Bootstrap, Foundation, Materialize...", "responsibility": "Разработка и поддержка собственных web-сервисов компании, внутренние технологические решения. Анализ требований и выявление потребностей конечных пользователей. Проработка архитектуры проектов...", "salary": 0}, {"name": "Python разработчик (Корпоративные риск-технологии)", "url": "https://hh.ru/vacancy/110923410", "requirement": "Высшее профильное образование (Бизнес информатика, финансы и кредит, банковское дело). Опыт работы в интеграционных проектах или проектах разработки информационных систем...", "responsibility": "Проектировать новые архитектурные решения, интеграции, концепции. Анализировать функциональные требования Заказчика (МиА, ТРКБ, Моделирование, ККР). Разрабатывать спецификации и постановки на разработку. ", "salary": 0}, {"name": "Python разработчик (Корпоративные риск-технологии)", "url": "https://hh.ru/vacancy/110923411", "requirement": "Высшее профильное образование (Бизнес информатика, финансы и кредит, банковское дело). Опыт работы в интеграционных проектах или проектах разработки информационных систем...", "responsibility": "Проектировать новые архитектурные решения, интеграции, концепции. Анализировать функциональные требования Заказчика (МиА, ТРКБ, Моделирование, ККР). Разрабатывать спецификации и постановки на разработку. ", "salary": 0}, {"name": "Python разработчик", "url": "https://hh.ru/vacancy/110412671", "requirement": "Коммерческий опыт разработки на Python – от 1 года. Хорошее знание Aiohttp. Понимание базовых принципов работы API и опыт взаимодействия с...", "responsibility": "Анализ API-сторонних сервисов и доработка собственных. Реализация stateless микросервисов. Разработка внутренних библиотек. Оптимизация узких мест в основной архитектуре продукта.", "salary": 0}, {"name": "Python Back-end Разработчик (веб-сервисы) / Python Back-end Developer (web services)", "url": "https://hh.ru/vacancy/110607224", "requirement": "Уверенное владение Python 3.x (2.x). Опыт профессиональной командной разработки проектов на Python от 1 года. Опыт работы с...", "responsibility": "Разработка back-end части веб-сервиса.", "salary": 0}, {"name": "Python-разработчик", "url": "https://hh.ru/vacancy/110870243", "requirement": "Знание ROS/ROS2 хотя бы базовые приветствуются. Понимание основ электроники. Знание Phyton в совершенстве. Знание С/С++ (приветствуются). ", "responsibility": "Программирование коллаборативных роботов. Программирование микроконтроллеров, моторов, драйверов. Написание прошивок. Работа с нейросетями и языковыми моделями. Работа с тех. зрением.", "salary": 200000}, {"name": "Middle+/Senior Python Developer", "url": "https://hh.ru/vacancy/111069560", "requirement": "Практический коммерческий опыт разработки на Python от 4 лет. - Опыт и знание Django, DRF. - Опыт работы с брокером очередей Celery. - ", "responsibility": "Работа с легаси и разработка нового кода. - Проведение код ревью. - Контроль реализации командами разработки кода, на соответствие принятым стандартам и...", "salary": 400000}, {"name": "Python разработчик (роботизация)", "url": "https://hh.ru/vacancy/109062278", "requirement": "Высшее образование, желательно в области ИТ. Уверенное знание Python и его основных веб-фреймворков (Flask/ Django/ FastAPI). Навыки работы с...", "responsibility": "Разработка скриптов/микросервисов для автоматизации внутренних бизнес-процессов компании. Взаимодействие с заказчиком и аналитиком на разных этапах разработки и тестирования. ", "salary": 0}, {"name": "Python программист. Django (удаленно)", "url": "https://hh.ru/vacancy/111021276", "requirement": "Experience in Python Production development. Experience in large-scale systems development. Fluent Russian (meeting with Russian dev team). Written english. ", "responsibility": "Build and maintain back-end. Write tests using Pytest and other libraries. Write clean, maintainable, and well-documented code. ", "salary": 350000}, {"name": "Python – разработчик", "url": "https://hh.ru/vacancy/110113778", "requirement": "От 2+ лет коммерческого опыта в релевантном стеке. Опыт проектирования сервисов. Опыт работы с aiohttp и asyncio. ", "responsibility": "Проектирование и разработка новых фич и интеграций. Небольшой процент поддержки и оптимизации кода. Ревью кода других разработчиков команды. ", "salary": 230000}, {"name": "Backend Python-разработчик", "url": "https://hh.ru/vacancy/111021746", "requirement": "Релевантный нашему стеку опыт работы от 3 лет, общий опыт backend от 5 лет. Понимание основных принципов ООП. ", "responsibility": "Первый год предстоит быть единственным backend-разработчиком проекта. Реализация нового функционала. Качественный анализ ТЗ до начала работ, декомпозиция и оценка...", "salary": 250000}, {"name": "Junior Python Developer", "url": "https://hh.ru/vacancy/107013325", "requirement": "Знание языка Python с опытом работы над собственными проектами. Опыт работы с системой контроля версий GIT. Опыт работы с базами...", "responsibility": null, "salary": 50000}, {"name": "Python-разработчик", "url": "https://hh.ru/vacancy/109446569", "requirement": "Технологии и инструменты:", "responsibility": "Ядро проекта - Django, DRF, Celery. Сервисы, сайд-проекты - Django, FastAPI, Go. Разработка, code review, рефакторинг кода. Сопровождение и документирование написанного...", "salary": 0}, {"name": "Middle/Senior Python developer", "url": "https://hh.ru/vacancy/105911362", "requirement": "Знания и навыки: Уверенное владение Python (версии 3+). Опыт разработки клиент-серверных веб-приложений. Уверенное знание SQL; Git; Linux. ", "responsibility": "Командная web-разработка. Участие в проектировании архитектуры приложений и моделей данных. Интеграция с внешними и внутренними API. Поддержка реализованного функционала. ", "salary": 0}, {"name": "Middle Python-разработчик", "url": "https://hh.ru/vacancy/110893697", "requirement": "Открытость руководства, готовность к диалогу, поощрение инициативности от сотрудников. Имеете коммерческий опыт в веб-разработке с использованием Django не менее...", "responsibility": "Сопровождение и модернизация существующего legacy монолита. Разработка тестов для новых и существующих участков кода для обеспечения качества и надежности системы. ", "salary": 0}, {"name": "Python-разработчик", "url": "https://hh.ru/vacancy/111213770", "requirement": "Профильное высшее образование (по специальности математика или информатика). Не менее 3 лет опыта разработки на Python. Знание принципов работы веб...", "responsibility": "Разработка и поддержка бэкенд решений на языке Python с использованием ИИ (веб-сервисов, Socket, REST API, систем авторизации). ", "salary": 0}, {"name": "Python разработчик (в офис гор.Пермь)", "url": "https://hh.ru/vacancy/109544745", "requirement": "Хорошее знание python (в т.ч. async). Умение работать с реляционными БД (postgresql). Умение работать с redis. Базовые знания по...", "responsibility": null, "salary": 80000}, {"name": "Python-разработчик", "url": "https://hh.ru/vacancy/109862054", "requirement": "Коммерческий опыт работы на python от 2х лет. Опыт разработки на FastApi. Умение работать с docker. Понимание принципов автоматизированного...", "responsibility": "Разработка API. Разработка архитектурных решений действующего проекта. Оптимизация / Баг фикс. Code Review.", "salary": 250000}, {"name": "Python разработчик (DDI)", "url": "https://hh.ru/vacancy/111053879", "requirement": "Опыт проектирования и реализации крупных enterprise-систем. Умение выбирать архитектурные шаблоны, паттерны проектирования. Опыт разработки на Python 3+ лет. ", "responsibility": "Разработка архитектуры нового продукта. Разработка сервиса, ежедневно используемого в проде инженерами и архитекторами для решения задач развития и поддержания IT...", "salary": 300000}, {"name": "Python developer", "url": "https://hh.ru/vacancy/110949372", "requirement": "Хорошие знания языка Python (семантика присваивания, особенности многопоточности и GIL, анонимные функции, ООП, common practices, генераторы, итераторы, менеджеры контекста ...). ", "responsibility": "Разработка новых и поддержка существующих парсеров для данных в различных форматах (xml, json, xlsx, html и др.), коннекторов к базам...", "salary": 0}, {"name": "Python Developer (middle/senior)", "url": "https://hh.ru/vacancy/108620672", "requirement": "Опыт коммерческой разработки на на Python от 2-х лет (Python > 3.8, ООП и паттерны проектирования). Знание основных фреймворков...", "responsibility": "Разрабатываем и поддерживаем внутренние сервисы и инструменты компании по циклу DevOps. Создаем с нуля новые продукты для других команд компании. ", "salary": 0}, {"name": "Python разработчик", "url": "https://hh.ru/vacancy/111074939", "requirement": "Знание Python и/или Golang. В случае опыта работы только на одном ЯП – должна быть готовность освоить второй язык. — ", "responsibility": "АС БАРС ЦУНДО предназначена для организации мониторинга за специализированными транспортными средствами (СТС) на маршрутах инкассации в целях обеспечения и повышения...", "salary": 0}, {"name": "Python-разработчик", "url": "https://hh.ru/vacancy/110786479", "requirement": "Отличные навыки программирования на Python 3.4+. Знание SQL (Postgre SQL). Опыт работы с SQL Alchemy. Опыт работы с...", "responsibility": "Проектировать бизнес логику рекомендательной системы. Разрабатывать системы отчетности и BI.", "salary": 0}, {"name": "Python-разработчик / Middle+", "url": "https://hh.ru/vacancy/111191821", "requirement": "Знание Python 3, опыт работы с Python от 3х лет. Опыт работы с Django и/или Flask, и/или...", "responsibility": "Разработка backend приложений и покрытие их unit-тестами. Проектирование структуры БД, написание и оптимизация запросов. Реализация интеграций с внешними сервисами...", "salary": 0}, {"name": "Разработчик Python / DRF", "url": "https://hh.ru/vacancy/110512745", "requirement": "Опыт разработки на Python, Django, DRF, React. Знание языка SQL, опыт работы с PostgreSQL или MySQL. Работа в Linux-среде...", "responsibility": "Командная разработка инновационных программно-аппаратных комплексов, в основном на Python / Django Rest Framework. Тестирование, code review, документирование, разработка отчетов и...", "salary": 0}, {"name": "Middle Python (django) разработчик", "url": "https://hh.ru/vacancy/111065168", "requirement": "Опыт Backend разработки от 3-х лет. Знания фреймворка Django. Знание SQL. Опыт работы с Celery. Хорошее знание docker. ", "responsibility": "Разработка новых фичей маркетплейса на Django. Доработка существующего функционала продукта на основе коробочного решения. Применение принципов SOLID/DRY/KISS, где...", "salary": 300000}, {"name": "Middle Python Developer", "url": "https://hh.ru/vacancy/110750810", "requirement": "If you have solid experience in Python, a keen eye for detail we'd love to hear from you! ", "responsibility": "ATOMICUS Software Development Company looking for a talented <highlighttext>Python</highlighttext> <highlighttext>Developer</highlighttext> to work on applications tailored to scientific research. ", "salary": 0}, {"name": "Python-разработчик", "url": "https://hh.ru/vacancy/109283144", "requirement": "Опыт на аналогичной должности от 1 года. Знание фреймворков Fastapi/ Django. Знание и умение применять паттерны проектирования систем. ", "responsibility": "Разработка средства автоматизации бизнес-процессов предприятия. Проектирование и решение задач автоматизации, направленные на повышение безопасности внутреннего контура разработки.", "salary": 0}, {"name": "Python-разработчик", "url": "https://hh.ru/vacancy/110872118", "requirement": "Опыт коммерческой разработки на Python (Django) от 4х лет. Опыт разработки крупных и высоконагруженных проектов. Опыт работы с FastAPI. ", "responsibility": null, "salary": 0}, {"name": "Python разработчик", "url": "https://hh.ru/vacancy/110997508", "requirement": "Опыт написания промышленных приложений на Python (2.7/3.6+) от 3 лет. Хорошее понимание сетевых протоколов и технологий. ", "responsibility": "Разработка и поддержка бэкенда платформы real-time обработки SMS трафика. Работа с такими сетевыми протоколами как SMPP, HTTP, RCS. ", "salary": 0}, {"name": "Middle Python Developer", "url": "https://hh.ru/vacancy/109060020", "requirement": "Опыт программирования на Python 2.7/3.10+ на уровне Senior. Близкий стек: Flask, FastAPI, Celery, Kafka, MySQL, Redis...", "responsibility": "Обеспечиваем бесперебойную работу текущего и делаем новый биллинг для нескольких продуктов в области хостинга и облаков. Развиваем и поддерживаем инфраструктурные...", "salary": 200000}, {"name": "Middle Python Developer", "url": "https://hh.ru/vacancy/105742065", "requirement": "Опыт разработки коммерческих приложений не менее 3 лет. Уверенные знания и опыт работы с: Python, включая разработку на Flask или...", "responsibility": "Разработка и поддержка веб-приложений на Python с использованием Flask или FastAPI. Работа с ORM (SQLAlchemy) для взаимодействия с базами...", "salary": 0}, {"name": "Python-developer (Middle)", "url": "https://hh.ru/vacancy/110983001", "requirement": "с опытом работы на современном стеке от 3-х лет. - с твёрдым знанием принципов ООП и SOLID. - с глубоким знанием...", "responsibility": "разработка и поддержка серверных приложений с использованием современных инструментов и фреймворков. -создание микросервисов и REST API. -проектирование, разработка и оптимизация...", "salary": 0}, {"name": "Python-разработчик (команда антифрода)", "url": "https://hh.ru/vacancy/111055076", "requirement": "Пишешь код на Python более 3 лет. Имеешь опыт работы с графами. Работаешь с PostgreSQL, MySQL, MongoDB и ClickHouse. ", "responsibility": "Разрабатывать и поддерживать антифродовые системы на Python. Оптимизировать алгоритмы обнаружения мошенничества. Взаимодействовать с другими разработчиками и аналитиками для улучшения системы. ", "salary": 0}, {"name": "Junior / Pre-middle Python Developer", "url": "https://hh.ru/vacancy/108977479", "requirement": "Знание английского языка на уровне pre-intermediate и выше. Хорошее знакомство с процессами и методологиями гибкой разработки (Scrum). ", "responsibility": "Работа в команде с выстроенными процессами по дизайну, тестированию и разработке. Разработка b2b продукта с живой ежедневной обратной...", "salary": 60000}, {"name": "Middle Python backend developer (FastAPI)", "url": "https://hh.ru/vacancy/109124550", "requirement": "Необходимые навыки: Уверенно владеть Python 3, понимать отличия от Python 2. Иметь опыт работы с FastAPI от 2 лет (с...", "responsibility": null, "salary": 180000}, {"name": "Python-разработчик", "url": "https://hh.ru/vacancy/109647283", "requirement": "Опыт коммерческой разработки на Python от 3 лет. Глубокие знания фреймворков, Flask, FastAPI и баз данных MySQL, PostGRESQL, NoSQL (будет...", "responsibility": "Разработка программного кода на Python. Интеграция корпоративных и внешних IT систем. Разработка архитектуры решений. Code review программного кода. ", "salary": 0}, {"name": "Python Developer (Strong Middle)", "url": "https://hh.ru/vacancy/111103378", "requirement": "Опыт работы <highlighttext>Python</highlighttext>-<highlighttext>разработчиком</highlighttext> от 3 лет. Твёрдое понимание концепций и лучших практик разработки бэкенда. Отличные знания Django и REST...", "responsibility": "Разработка и поддержка высококачественных веб-приложений на Python с использованием Django. Внедрение новых фич и оптимизация существующего кода. ", "salary": 0}, {"name": "Python-разработчик", "url": "https://hh.ru/vacancy/110645606", "requirement": "Наши ожидания относительно знаний, навыков, опыта: Опыт коммерческой разработки на Python. Опыт работы с SQL, Redis, Kafka. Опыт работы с...", "responsibility": "Разработка систем и программных модулей на Python. Тестирование и отладка программных модулей. Поддержка и оптимизация существующего кода. Документирование работы разработанных...", "salary": 140000}, {"name": "Python Developer", "url": "https://hh.ru/vacancy/110621069", "requirement": "Требуется отличное знание Python (в том числе библиотеки Pandas), SQL. - Знание фреймворка FastAPI. - Умение работать с git в команде. - ", "responsibility": "Разработка и развертывание эндпойнтов для аналитических приложений. - Поддержка и развитие уже существующих микросервисов.", "salary": 0}, {"name": "Middle Python разработчик", "url": "https://hh.ru/vacancy/110445056", "requirement": "GitLab. Опыт работы на позиции middle разработчик Python от 3 лет. Глубокое понимание структур данных, алгоритмов и объектно-ориентированного программирования...", "responsibility": null, "salary": 150000}, {"name": "Python-разработчик", "url": "https://hh.ru/vacancy/110844587", "requirement": "Опыт работы на позиции Backend-разработчика на Python от 3х лет. Отличные знания Python и Django. Понимание принципов асинхронного...", "responsibility": "Непосредственное участие в разработка backend’a на основе Django. Разработка / оптимизация модели базы данных, оптимизация запросов и существующей ORM. ", "salary": 0}, {"name": "Python разработчик (офис)", "url": "https://hh.ru/vacancy/111058621", "requirement": "Языки программирования: Python 3.9+, JS, SQL. Flask, SQLAlchemy, Bootstrap, JQuery. Платформа: Linux, Docker, PostgreSQL. Нужен “свежий” опыт разработки...", "responsibility": "Бэкенд разработка веб-приложения. Автоматизация бизнес-процессов на Python. Разработка системы электронного документооборота и автоматизации процессов для клиентов компании.", "salary": 90000}, {"name": "Python-разработчик (строительный домен, микросервисная архитектура)", "url": "https://hh.ru/vacancy/110697483", "requirement": "Опыт коммерческой Backend разработки на Python от 3х лет. Опыт работы с базами данных (PostgreSQL), уверенное владение SQL. ", "responsibility": "Разработка клиентских сервисов на Python. Разработка новых методов клиентского API. Заниматься переработкой существующих сервисов: рефакторинг, оптимизация, переработка архитектуры, повышение отказоустойчивости. ", "salary": 0}, {"name": "Python-разработчик/Тестировщик", "url": "https://hh.ru/vacancy/108817576", "requirement": "Уверенное знание и настройка операционных систем Linux. Понимание работы сетевого оборудования. Настройка firewall для защиты сетей. Настройка веб-сервера Nginx. ", "responsibility": "Подготовка и настройка оборудования для тестирования и работы. Тестирование проектов и продуктов. Ведение отчетности по проведенным тестам. Загрузка ПО на...", "salary": 100000}, {"name": "Python-разработчик (e-com, маркетплейсы, парсинг данных)", "url": "https://hh.ru/vacancy/109165142", "requirement": "Имеете релевантный задачам опыт работы. Владеете соответствующим технологическим стэком - Python, Selenium, Node.js, PHP. Умеете самостоятельно организовывать свой рабочий процесс в...", "responsibility": "Разработка инструментов и модулей системы для сбора, обработки и хранения данных о товарах. Разрабатывать инструментарий для получение данных о товарах...", "salary": 0}, {"name": "Python Developer", "url": "https://hh.ru/vacancy/110444988", "requirement": "Знание особенностей реализации различных алгоритмов и структур данных. Опыт работы по специальности от 3 лет. Опыт работы в команде. ", "responsibility": "Реализация серверной части веб-приложений, связанных с обработкой и отображением больших данных. Анализ и оптимизация производительности. Участие в разработке архитектуры...", "salary": 0}, {"name": "Middle Python разработчик", "url": "https://hh.ru/vacancy/110956175", "requirement": "Разработка и поддержка веб-приложений на Python с использованием Django и FastAPI (опыт от 3 лет). Глубокое знание принципов ООП...", "responsibility": "Интеграция брокеров сообщений (Kafka, RabbitMQ) для обеспечения обмена данными и высокой производительности систем. -Разработка асинхронных процессов и фоновых задач с...", "salary": 100000}, {"name": "Python Developer (to Cyprus)", "url": "https://hh.ru/vacancy/109026421", "requirement": "Be able to work with API of various embedded systems. 3+ years of <highlighttext>Python</highlighttext> <highlighttext>development</highlighttext> experience. Knowledge working with...", "responsibility": "Review of existing automation tools and their integration with other systems. Implement various automation blocks in Python tying together as...", "salary": 0}, {"name": "Middle Python Developer", "url": "https://hh.ru/vacancy/111240762", "requirement": "Опыт работы с Python от 2 лет, уверенное владение фреймворками для машинного обучения (например, TensorFlow, PyTorch, scikit-learn). ", "responsibility": "Разработка и поддержка проектов на Python с акцентом на AI и ML технологии. Создание и тестирование функционала для решения задач...", "salary": 200000}, {"name": "Python-разработчик", "url": "https://hh.ru/vacancy/110998588", "requirement": "Российская компания-разработчик систем хранения данных (СХД) и систем виртуализации в поиске Программиста Python с опытом коммерческой разработки более 3...", "responsibility": "Предстоят задачи по разработке программных модулей для управления и автоматизации различных процессов операционной системы, веб-сервисов, интерфейсов командной строки (CLI...", "salary": 0}, {"name": "Python-разработчик", "url": "https://hh.ru/vacancy/110126502", "requirement": "Отличные навыки программирования на Python 3.4+. Знание SQL (Postgre SQL). Опыт работы с SQL Alchemy. Понимание принципов работы...", "responsibility": "Проектировать бизнес логику и CRM для платных дорог и парковок. Разрабатывать системы отчетности и BI.", "salary": 200000}, {"name": "Python-разработчик/ Python Developer", "url": "https://hh.ru/vacancy/110958431", "requirement": "Отличное знание Python 3, опыт использования от трех лет. Опыт разработки тест кейсов. Опыт использования Docker. Опыт тестирования API и...", "responsibility": "Разработка и анализ результатов тестов. Разработка новых и поддержка существующих Backend приложений на Python. Проектирование структуры БД, написание и оптимизация...", "salary": 150000}, {"name": "Middle / Middle+ Python разработчик", "url": "https://hh.ru/vacancy/109053666", "requirement": "Опыт промышленной на Python 3 от 2 лет. Уверенное владение базовыми архитектурными паттернами. Знание библиотек: SQLAlchemy. Умение составлять сложные SQL...", "responsibility": "Создание и поддержка unit и integration тестов с использованием pytest. Обязанности: Разработка и поддержка новых программных решений для b2...", "salary": 0}, {"name": "Backend Developer Python", "url": "https://hh.ru/vacancy/110771631", "requirement": "Опыт работы с Python от 2-х лет. Опыт работы с фреймворками Flask, Fastapi, React.js. Знание PostgreSQL. Опыт работы с...", "responsibility": "Разработка проектов с нуля. - Доработка существующих проектов. - Анализ, контроль и улучшение качества кода.", "salary": 0}, {"name": "Middle Python Developer", "url": "https://hh.ru/vacancy/110288102", "requirement": "Уверенное знание языка программирования Python 3.11+. Уверенная работа с FastAPI. Хорошее знание СУБД PostgreSQL. Опыт создания и сопровождения...", "responsibility": "Развитие существующих и разработка новых приложений в рамках продуктов компании. Оценка производительности. Поиск узких мест. Оптимизация кода. Написание технических спецификаций. ", "salary": 260000}, {"name": "Middle python developer (TI)", "url": "https://hh.ru/vacancy/111224586", "requirement": "Опыт коммерческой разработки от 3 лет. Знание Python и экосистемы (опыт от 2 лет). Опыт разработки веб-сервисов. ", "responsibility": "Разрабатывать безопасные, надежные и масштабируемые сервисы на Python. Участвовать в code review. Писать unit-тесты.", "salary": 0}, {"name": "Senior Python-разработчик", "url": "https://hh.ru/vacancy/109778589", "requirement": "Опыт коммерческой разработки на Python от 2 лет. Глубокое знание фреймворков Django или FastAPI. Опыт работы с системами очередей и...", "responsibility": "Разработка интеграций и микросервисов в передовом проекте электронной торговли. Создание распределенные, масштабируемые и отказоустойчивые e-commerce системы. Реализация новых продуктовых...", "salary": 0}, {"name": "Java разработчик (CRM)", "url": "https://hh.ru/vacancy/110626904", "requirement": "Опыт работы с Java не менее 2 лет. Опыт работы с Groovy (или Python) более 3 лет. Опыт работы с...", "responsibility": "Развитие кастомного функционала системы. Оценка задач + участие в планировании спринта. Поддержка ПРОМ стенда как 3 уровень поддержки (исправление дефектов...", "salary": 0}, {"name": "Middle Python-разработчик", "url": "https://hh.ru/vacancy/107791606", "requirement": "Опыт разработки бэкенд приложений на Python 3.x от 3 лет. Уверенное владение базовыми архитектурными паттернами. Знание библиотек: pandas, NumPy...", "responsibility": "Разрабатывать и поддерживать приложение для поиска персональных данных в SQL (Oracle, MSSQL, PostgreSQL, Sybase) и noSQL (HDFS, Greenplum) БД. ", "salary": 0}, {"name": "Python разработчик (Middle+ / Senior)", "url": "https://hh.ru/vacancy/111222007", "requirement": "Опыт создания приложений и разработки API на Python, используя веб-фреймворки (Django либо FastAPI / Aiohttp или другой асинхронный фреймворк). ", "responsibility": "Х5 Технологии — это отдельная бизнес-единица Х5 Group, которая отвечает за создание комплексных цифровых решений для бизнес-единиц...", "salary": 0}, {"name": "Python разработчик", "url": "https://hh.ru/vacancy/109778971", "requirement": "1) 1.5+ год опыта работы в качестве бэкенд-разработчика (Python). 2) Опыт в разработке чат-ботов на aiogram...", "responsibility": "1) Разработка различных чат-ботов как для внутренних нужд компаний, так и для внешних. 2) Разработка веб-приложений в телеграмме. ", "salary": 150000}, {"name": "Senior Python Developer", "url": "https://hh.ru/vacancy/111102826", "requirement": "Опыт работы <highlighttext>Python</highlighttext> <highlighttext>разработчиком</highlighttext> от 3х лет. - Опыт работы с фреймворком. - FastAPI - обязательно. - Знание Docker. - Знание ООП и паттернов...", "responsibility": "Разработка, тестирование и поддержка программного обеспечения на Python. - Участие во всех этапах разработки. - Оптимизация и улучшение существующего кода и архитектуры. - ", "salary": 5000}, {"name": "Python Developer / Разработчик Python", "url": "https://hh.ru/vacancy/109625704", "requirement": "Опыт коммерческой разработки на Python от 3-х лет. Опыт работы с базами данных, такими как PostgreSQL, Redis. ", "responsibility": "Написание кода. Анализ и обработка данных. Участие во внедрении программы. Проведение код-ревью. Техническое интервью (платформа). Проектирование (архитектура). ", "salary": 0}, {"name": "Middle AI developer/Python", "url": "https://hh.ru/vacancy/110429236", "requirement": "Опыт коммерческой разработки на Python от 3-х лет. Уверенное владение асинхронным программированием на Python (asyncio), опыт создания сервисов, асинхронно...", "responsibility": "Backend-разработка на Python 3 и поддержка масштабируемых компонентов системы. Написание unit-тестов (pytest). Оптимизация, рефакторинг. Взаимодействие с командой разработки...", "salary": 0}, {"name": "Python Developer", "url": "https://hh.ru/vacancy/110808945", "requirement": null, "responsibility": "Инфраструктурная и сетевая автоматизация. Взаимодействие с источниками данных, описывающие реальный мир (физические сервера, коммутаторы и проч.). Написание/работа с системами...", "salary": 200000}, {"name": "Python разработчик (Корпоративные риск-технологии)", "url": "https://hh.ru/vacancy/110923412", "requirement": "Высшее профильное образование (Бизнес информатика, финансы и кредит, банковское дело). Опыт работы в интеграционных проектах или проектах разработки информационных систем...", "responsibility": "Проектировать новые архитектурные решения, интеграции, концепции. Анализировать функциональные требования Заказчика (МиА, ТРКБ, Моделирование, ККР). Разрабатывать спецификации и постановки на разработку. ", "salary": 0}, {"name": "Python разработчик", "url": "https://hh.ru/vacancy/110961842", "requirement": "Языки: Python (знание C#, C++ будет плюсом). Опыт работы с РСУБД: Postgresql\\Oracle. Знание и опыт использования стека ELK и...", "responsibility": "Реализовывать и улучшать функционал нового продукта. Интегрировать продукт со существующими ИТ-решениями. Плотно тестировать создаваемые решения в своей зоне ответственности. ", "salary": 0}, {"name": "Python developer", "url": "https://hh.ru/vacancy/110131159", "requirement": "2+ years of hands-on experience with Python and TypeScript/JavaScript. English B2+. Proficient in Python for...", "responsibility": "Enhance and expand functionality of an existing Chrome extension. Support and develop a Python API project deployed on Vercel. ", "salary": 0}, {"name": "Программист (Python-разработчик в аккредитованную ИТ-компанию)", "url": "https://hh.ru/vacancy/108858526", "requirement": "Знание Python (Django). Понимание клиент-серверной архитектуры. Понимание принципов работы баз данных и SQL. Понимание микросервисной архитектуры. Знание системы управления...", "responsibility": "Разработка и сопровождение информационных систем Администрации города Вологды. Обработка данных на Python. Создание веб-сервисов на Django. Тестирование ПО. ", "salary": 60000}, {"name": "Python developer", "url": "https://hh.ru/vacancy/110792358", "requirement": "Бизнес-руководство, нацеленное на результат. Имеете опыт разработки на Python 3.X. Понимаете механику языка Python и сопутствующих инструментов (pytest...", "responsibility": "Команда и процессы: Полная ответственность за продукт: разработку, инфраструктуру, тестирование и релиз. Понимающее IT-руководство, например, у нас есть квота...", "salary": 0}, {"name": "Python Developer", "url": "https://hh.ru/vacancy/110615959", "requirement": "Опыт коммерческой разработки на Python - не менее 3 лет. Уверенное владение Linux. Знание телекоммуникационных сетевых протоколов, понимание gRPC. ", "responsibility": "Разработка автоматизированных средств управления объектной моделью программного обеспечения стека протоколов LTE, GSM (программного продукта). Разработка автоматизированных средств конфигурирования режимов работы...", "salary": 200000}, {"name": "Python Developer", "url": "https://hh.ru/vacancy/108953837", "requirement": "Знание принципов ООП. Опыт разработки на Python. Знакомство с Django Rest Framework. Знание принципов работы c СУБД. Желание работать в...", "responsibility": "Участвовать в проектах по разработке крупных автоматизированных систем. Разрабатывать новые и развивать существующие продукты компании. Анализировать написанный код. ", "salary": 0}, {"name": "Trainee Python developer (AI-ML team)", "url": "https://hh.ru/vacancy/110036494", "requirement": "Bachelor’s Degree in Computer Science or equivalent experience. Good programming skills. Some Experience with Python Frameworks and Modules. ", "responsibility": "Quickly prototype new ideas/technologies to create proof of concept and demos. Develop robust and testable applications in Python.", "salary": 0}, {"name": "Python Developer", "url": "https://hh.ru/vacancy/109967521", "requirement": "Опыт разработки Backend на Python от 3х лет. Опыт работы с любым веб-фреймворком на Python (Flask, Django, Falcon...", "responsibility": "Разработка backend на Python. Проработка ETL. Взаимодействие с командами Data Science, DevOps и Frontend. Проектирование приложения и базы данных. ", "salary": 0}, {"name": "Python-разработчик", "url": "https://hh.ru/vacancy/110436580", "requirement": "Опыт разработки на Python от 3 лет. - Docker Compose. - Gitlab CI. - Опыт написания юнит-тестов. - Опыт работы с большими данными. ", "responsibility": "Разработка новой функциональности для бизнес-задач. Поддержка, развитие, оптимизации текущей функциональности. Участие в разработке общепроектных инструментов и пакетов. - OpenStack.", "salary": 200000}, {"name": "Junior Python разработчик (удаленно)", "url": "https://hh.ru/vacancy/107956470", "requirement": "Язык программирования: Python 3.10+. Знание RestApi. Опыт написание API. Опыт работы над коммерческим или опен-сорс проектом. ", "responsibility": "Поддерживать существующий код. Разрабатывать новый функционал. Реализация API. Поиск ошибок, разбор проблемных кейсов.", "salary": 100000}, {"name": "Python-разработчик", "url": "https://hh.ru/vacancy/110612681", "requirement": "Опыт коммерческой разработки на Python от года. Опыт работы с Linux, Bash, SSH. Опыт работы с SQL и NoSQL базами...", "responsibility": "Разработка с использованием Python 3.7(3.11) Flask. Разработка модулей для управления системами хранения данных и виртуализации. ", "salary": 250000}, {"name": "Middle Python Developer", "url": "https://hh.ru/vacancy/107938531", "requirement": "Опыт разработки на Python от 3-х лет в коммерческих проектах. Опыт работы с PostgreSQL, MS SQL (селекты, триггеры, индексы...", "responsibility": "Разработка социально значимых проектов с нуля в команде. Разработка веб-приложения для новых продуктов компании. Поддержка и развитие существующих проектов...", "salary": 0}, {"name": "Python разработчик (разработчик логики)", "url": "https://hh.ru/vacancy/110331727", "requirement": "Уверенное знание Python. Опыт работы с Backend фреймворками Flask/Django. Опыт работы с Docker, HTTP запросами, Git. Опыт работы с...", "responsibility": "Построение логики диалогов с клиентами (conversation flow) по скриптам - входящие и исходящие звонки, коммуникация в мессенджерах, sms и т.п. ", "salary": 0}, {"name": "Middle/Senior Python Developer", "url": "https://hh.ru/vacancy/110983861", "requirement": "Уверенное владение Django и понимание MV*. Понимание ORM и использование его с учетом преимуществ и недостатков. Опыт работы с реляционными...", "responsibility": "Разработка приложения на базе Django. Взаимодействие с командой аналитики по реализации требований проекта. Сопровождение жизненного цикла приложения. Написание технической документации. ", "salary": 0}, {"name": "Python developer / Python разработчик", "url": "https://hh.ru/vacancy/110425944", "requirement": "Опытом разработки на Python3. Глубокими знаниями и практическим опытом работы с Asyncio. Уверенными знаниями Linux. Умением работать в команде...", "responsibility": "Разработка и поддержка приложений на Python3 с использованием Asyncio. Оптимизация существующего кода и улучшение производительности приложений. Взаимодействие с командой...", "salary": 0}, {"name": "Junior+ Python разработчик", "url": "https://hh.ru/vacancy/110397098", "requirement": "Уверенные знания Python (FastAPI). Опыт работы с: Асинхронностью. PostgreSQL. Умение работать с Docker, понимание что такое контейнеры. Опыт с GitLab. ", "responsibility": "Разработка и поддержка новых функциональных модулей системы. Интеграция с внешними API сторонних систем. Оптимизация работы микросервисов и базы данных. ", "salary": 120000}, {"name": "Python разработчик (В отдел аналитики)", "url": "https://hh.ru/vacancy/110049079", "requirement": "Знание Python. Понимание ООП. Знание CI/CD. Умение работать с чужим кодом. Работа с СУБД (MySql, PostgreSql, SqLite, Redis, RocksDB). ", "responsibility": "Разработка библиотек. Разработка микросервисов. Разработка приложений для анализа и сбора данных. Поддерживать и улучшать имеющиеся системы, писать новые.", "salary": 120000}, {"name": "Python-разработчик (middle), гибрид в Санкт-Петербурге", "url": "https://hh.ru/vacancy/110635717", "requirement": "Уверенное владение Python. Опыт работы с парсингом данных, уверенные знания Selenium WebDriver. Умение распознавать и применять основные шаблоны проектирования. ", "responsibility": "Поддержкой и развитием серверной части, отвечающей за парсинг. Разработка высоконагруженных backend сервисов. Написания сетевых многопоточных приложений. Разработка высоконагруженных сервисов. ", "salary": 220000}, {"name": "Python-разработчик (Django / проект аудит)", "url": "https://hh.ru/vacancy/110674484", "requirement": "Самостоятельность. - Хорошие знания Python3 (3.10+). - Хорошие знания веб-фреймворков (FastAPI, Django, DRF). - Опыт проектирования API. - ", "responsibility": "Для участия в проекте Аудит платформы, предназначенной для осуществления бизнес-задач финансовой организации. Платформа состоит из нескольких компонентов, один из...", "salary": 0}, {"name": "Python разработчик", "url": "https://hh.ru/vacancy/110102168", "requirement": "Опыт профессиональной разработки на Python3 от 2-х лет. Опыт построения распределенных систем. Понимание принципов построения и развертывания высоконагруженных...", "responsibility": "Разработка сервисов использующих алгоритмы искусственного интеллекта для решения медицинских задач. Тестирование и поддержка разработанных сервисов.", "salary": 0}, {"name": "Backend Middle Developer / Python разработчик", "url": "https://hh.ru/vacancy/107762738", "requirement": "От 2 лет коммерческого опыта в Python. - ООП, Django, PostgreSQL, Celery, RabbitMQ, Redis. - Понимание принципов асинхронного программирования (asyncio, aiohttp). - ", "responsibility": null, "salary": 150000}, {"name": "Python Developer", "url": "https://hh.ru/vacancy/104349973", "requirement": "Опыт написания на Python от 3-х лет (примеры работ будут плюсом). Понимание принципов реляционных СУБД. Опыт работы с Key...", "responsibility": null, "salary": 270000}, {"name": "Python-разработчик", "url": "https://hh.ru/vacancy/110429622", "requirement": "Опыт коммерческой разработки от 3-х лет (на питоне). Уверенные навыки программирования на server-side. Успешный опыт оптимизации web-сервисов...", "responsibility": "Отвечать за работу серверной части веб-приложения \"SUBTOTAL.RU\" (личный кабинет пользователя), создавать и поддерживать всю инфраструктуру и логику, которая обрабатывает...", "salary": 180000}, {"name": "Python Developer", "url": "https://hh.ru/vacancy/108461049", "requirement": "Опыт коммерческой разработки на Python от 3 лет. Знание фреймворка FastAPI. Навык работы с Git. Понимание принципов написания API.", "responsibility": "Поддержка внутренней CRM: исправление ошибок и написание нового функционала. Разрабатывать новые модули и подсистемы приложения. Поддерживать существующий код. ", "salary": 0}, {"name": "Python-разработчик (Junior)", "url": "https://hh.ru/vacancy/110874883", "requirement": "Опыт работы в роли <highlighttext>python</highlighttext> <highlighttext>разработчика</highlighttext> от года. Опыт работы с библиотеками pandas, Pydantic, SQLAlchemy. Понимание PEP8. ", "responsibility": "Разработка ETL процессов на Python (Apache Airflow). Участие в разработке сервисов для работы с большими данными. Работа с инструментами разработки...", "salary": 0}, {"name": "Python developer middle+", "url": "https://hh.ru/vacancy/109750255", "requirement": "Опыт работы в роли <highlighttext>Python</highlighttext> <highlighttext>Developer</highlighttext> от 3-х лет. Законченное высшее техническое\\инженерное образование. Опыт работы с реляционными СУБД...", "responsibility": "Разработка российского ПО класса mission critical (сервиса управления бизнес-процессами (BPM) для лидеров финансового сектора на языке Python 3.9...", "salary": 0}, {"name": "Python-разработчик (Senior)", "url": "https://hh.ru/vacancy/110820346", "requirement": "Уверенное знание и навыки разработки на Python на уровне Senior (от 6 лет), включая опыт работы с асинхронным программированием и...", "responsibility": "+ и другие. Разработка высоконагруженного приложения с использованием Python с нуля. Масштабирование и оптимизация приложения для обеспечения максимальной производительности. ", "salary": 350000}, {"name": "Python developer / Разработчик Python", "url": "https://hh.ru/vacancy/110110499", "requirement": "Уверенные знания Python3 (3.8+) на разработке веб-проектов - конкретный опыт реализации в реальном мире (с реальными пользователями). ", "responsibility": "Поддержка и развитие web-платформы, по оцифровке документов с sla. Наш стек Python3, MySQL, MongoDB, RabbitMQ, Redis, связка монолита...", "salary": 0}, {"name": "Python-разработчик", "url": "https://hh.ru/vacancy/110147647", "requirement": "Глубокое знание Python и опыт разработки на нем от 5 лет. Уверенное понимание многопоточности и асинхронного программирования. Опыт работы с...", "responsibility": "Разработка и поддержка высоконагруженных многопоточных приложений на Python. Работа с мультисерверными системами и обеспечение их отказоустойчивости. Интеграция и работа с...", "salary": 200000}, {"name": "Middle python developer", "url": "https://hh.ru/vacancy/109831816", "requirement": "Опыт работы в коммерческой разработке от 1 года ( Python, Django), уверенная работа с DRF. Опыт разработки API. Python 3. ", "responsibility": "Разработка backend для мобильных приложений в сфере e-commerce. Full-stack разработка web приложения для администрирования онлайн-магазина заказчика. ", "salary": 100000}, {"name": "Python-разработчик", "url": "https://hh.ru/vacancy/109045918", "requirement": "Опыт написания парсеров, ботов (любых систем автоматизированного реагирования на изменения в базе данных - выгрузки/загрузки, разбора данных, парсинга). ", "responsibility": "Backend: PHP 7 на движке MediaWiki и Laravel, фреймворк автоматизации платформы Mediawiki Pywikibot. PHP Composer, Docker, Docker Compose Kubernetes, Kafka. ", "salary": 0}, {"name": "Python-разработчик (Офис / Гибрид)", "url": "https://hh.ru/vacancy/109932445", "requirement": "Амбициозный долгосрочный (3+ лет) проект «Отраслевые решения». - имеешь опыт коммерческой разработки на python. - знаешь классические алгоритмы, структуры данных, паттерны...", "responsibility": "Отраслевые решения – это бесплатные инструменты для малого-микро бизнеса, дающие возможность пользоваться финансовой аналитикой и нефинансовыми партнерскими сервисами. ", "salary": 160000}, {"name": "Python разработчик, middle", "url": "https://hh.ru/vacancy/110429361", "requirement": "Опыт работы разработчиком на языках Python (от одного года). Знакомство с Golang (желательно). Опыт работы с Docker и системами контейнеризации. ", "responsibility": "Разработка, проектирование и поддержка систем на языках Python. Интеграция с другими системами и компонентами, включая написание и отладка кода. ", "salary": 200000}, {"name": "Middle Python Developer", "url": "https://hh.ru/vacancy/108969522", "requirement": "FastAPI, SQLAlchemy, Pydantic (v1/v2). Scrapy. Docker, Airflow, Celery, Redis. Postgres. Опыт работы с Python от 2х...", "responsibility": "Разработка и поддержка веб-приложений на Python. Разработка и поддержка автоматизации бизнес и технических процессов. Проектирование архитектуры баз данных и...", "salary": 200000}, {"name": "Middle Python developer / Разработчик Python (Django)", "url": "https://hh.ru/vacancy/110439718", "requirement": "Умение работать в команде. Желание писать простой (понятный) код. Опыт разработки 3+ лет и хорошее владение стеком разработки (Python...", "responsibility": "Разрабатывать Python-сервисы. Проводить рефакторинг кода. Подготавливать сервисы к мероприятиям федерального масштаба, осуществлять их поддержку. Делать ревью кода. ", "salary": 0}, {"name": "Python Backend Developer (Flask/Django)", "url": "https://hh.ru/vacancy/109564997", "requirement": "Опыт работы с Python, Flask или Django. Знание и опыт работы с реляционными базами данных, предпочтительно PostgreSQL. Опыт работы с...", "responsibility": "Присоединиться к разработке новых проектов (никакого легаси) - сервис для рассылки уведомлений игрокам, собственная система тех поддержки и внутрипортальная валюта. ", "salary": 0}, {"name": "Middle Python разработчик", "url": "https://hh.ru/vacancy/111033233", "requirement": "Опыт написания качественного промышленного кода на Python. Опыт написания web-приложений с использованием фреймворков: FastAPI/AIOHTTP или подобных. ", "responsibility": "Работать над развитием, масштабируемостью и надежностью системы. Разрабатывать новые интеграции с внешними системами. Предлагать и реализовывать новые идеи в разработке. ", "salary": 0}, {"name": "Python developer (ML)", "url": "https://hh.ru/vacancy/110611934", "requirement": "Опыт коммерческой разработки на python от 3 лет. Понимание asyncio, threading, multiprocessing механизмов в Python. Уверенно работаешь с Linux и...", "responsibility": "Мониторинг ML метрик и умение быстро разбираться в причинах их изменения. Поддержка текущего функционала нескольких сервисов распознавания документов. ", "salary": 0}, {"name": "Python developer (Low- code сервисы)", "url": "https://hh.ru/vacancy/108968648", "requirement": "Средне специальное/высшее техническое образование. Опыт работы с Python, JavaScript. Теоретическое понимание ООП, базовых паттернов проектирования, принципов работы с базами...", "responsibility": "Создание low-code приложения на основании собственной low-code платформы. Участие в проектировании бизнес- логики low-code приложений. ", "salary": 0}, {"name": "Python developer (AI направление)", "url": "https://hh.ru/vacancy/109133069", "requirement": "Отличное знание Python, включая глубокое понимание его экосистемы. Опыт работы с Python-фреймворками для веб-разработки, в частности FastAPI. ", "responsibility": null, "salary": 0}, {"name": "Junior Аккаунт менеджер / Менеджер по работе с клиентами", "url": "https://hh.ru/vacancy/109549626", "requirement": "Любящего общение. Как сказали выше, мы общаемся с партнёрами в лёгком формате. Где-то можно пошутить, где-то проявить участие...", "responsibility": "Креативного. Есть большое поле для экспериментов: с форматами, текстами. — Основной алгоритм: получаешь заявку → размещаешь её на канале → отбираешь партнёрских кандидатов...", "salary": 0}, {"name": "Senior Python developer", "url": "https://hh.ru/vacancy/110864754", "requirement": "Уверенное знание Python (от 5 лет). Опыт работы с реляционными базами данных. Опыт разработки REST API. Опыт работы с fastapi. ", "responsibility": "Backend-разработка новых сервисов. Декомпозиция задач на разработку новой функциональности. Оптимизация кода, запросов и БД; REST API для frontend-приложений...", "salary": 0}, {"name": "Python-разработчик(алгоритмы работы с графикой ,back-end)", "url": "https://hh.ru/vacancy/110598344", "requirement": "Опыт разработки алгоритмов и математического моделирования. Знание Python на высоком уровне ,опыт работы с библиотеками для математических вычислений (NumPy,Scipy...", "responsibility": "Разработка алгоритмов для расстановки мебели в жилых помещениях. Анализ вводных данных, разработка методов оптимизации расположения мебели с учетом ,эргономики, дизайна...", "salary": 200000}, {"name": "Python-developer / разработчик", "url": "https://hh.ru/vacancy/108232221", "requirement": "Наставлять менее опытных коллег. ТРЕБОВАНИЯ. Опыт промышленной разработки на Python от 3 лет. Отлично знаете Python 3. Есть опыт многопоточного...", "responsibility": "Писать код и проводить код-ревью. Писать тесты на свой код.", "salary": 0}, {"name": "Python программист Middle/Senior", "url": "https://hh.ru/vacancy/110633202", "requirement": "Опыт работы с Django от 3 лет. Наличие продолжительного опыта работы в работающем продукте с нагрузкой от 10 000 уников...", "responsibility": "Продолжение разработки архитектуры проекта, обеспечение её гибкости и масштабируемости. Разработка и внедрение нового функционала в соответствии с требованиями продукта. ", "salary": 0}, {"name": "Python-разработчик (работа в офисе)", "url": "https://hh.ru/vacancy/109532811", "requirement": "Опыт работы с Flask от 2 лет. Опыт работы с реляционными СУБД (PostgreSQL). Опыт работы со средствами CI/CD. ", "responsibility": "Написание программного кода и использование среду программирования компании для проверки работоспособности ПО на python. Переработка и оптимизация готового программного кода. ", "salary": 0}, {"name": "Python-разработчик", "url": "https://hh.ru/vacancy/110870671", "requirement": "Есть опыт работы с Python 3.8, asyncio (async/await), веб-фреймоворками (aiohttp/fastAPI/flask/Django), ORM (peewee, SQLAlchemy, Django...", "responsibility": "Делаем много проектов на asyncio, aiohttp, fastapi. Есть возможность работать с kubernetes, consul, vault. Реже используем django и flask. ", "salary": 470000}, {"name": "Python-разработчик", "url": "https://hh.ru/vacancy/110976824", "requirement": "Опыт разработки бэкенд приложений на Python 3.x от 6 лет. Уверенное владение базовыми архитектурными паттернами. Понимание асинхронной парадигмы программирования. ", "responsibility": "Проекты для одного из крупнейших банков РФ: десктопное приложение, интеграционное приложение, Автогенерация документации (jinja, atlassian). Твои задачи: Участвовать в развитии...", "salary": 0}, {"name": "Ведущий Python Разработчик", "url": "https://hh.ru/vacancy/108951727", "requirement": "Опыт разработки от3 лет на Python (flask/django, multiprocessing, pandas, numpy). Основы разработки Http сервера (низкая нагрузка). ", "responsibility": "Разработка, запуск, поддержка бэкенда/приложений для обработки запросов к моделям ML. Разработка, оптимизация алгоритмов предварительной подготовки данных для ML (поддержка...", "salary": 0}, {"name": "UX/UI дизайнер", "url": "https://hh.ru/vacancy/110323029", "requirement": "Опыт разработки дизайна мобильных приложений Android, iOS. Опыт разработки дизайна больших сервисов и порталов. Уверенное владение Figma: умение пользоваться компонентами...", "responsibility": "Предстоит работать над интерфейсами интересного продукта с ежемесячной аудиторией более 500 тысяч человек и других продуктов компании. Создание и анализ...", "salary": 126000}, {"name": "Middle+/Senior Python Developer", "url": "https://hh.ru/vacancy/111069565", "requirement": "Практический коммерческий опыт разработки на Python от 4 лет. - Опыт и знание Django, DRF. - Опыт работы с брокером очередей Celery. - ", "responsibility": "Работа с легаси и разработка нового кода. - Проведение код ревью. - Контроль реализации командами разработки кода, на соответствие принятым стандартам и...", "salary": 400000}, {"name": "Python developer", "url": "https://hh.ru/vacancy/111206463", "requirement": "Must-haves: - Commercial experience with Python for 1+ years. - Good knowledge of Python, PostgreSQL, MongoDB. - Willingness to learn Docker...", "responsibility": "The customer is the trusted data partner for all stages of AI development from training to evaluation. The company combines...", "salary": 0}, {"name": "Middle+/Senior Python Developer", "url": "https://hh.ru/vacancy/107492353", "requirement": "Знание и опыт работы с Python и его экосистемой. Опыт написания тестов и понимание для чего они нужны. ", "responsibility": "Поддержка/отладка/оптимизация легаси и поддержка/отладка/оптимизация/разработка нового кода. Написание тестов для собственного и чужого кода. ", "salary": 0}, {"name": "Python-разработчик", "url": "https://hh.ru/vacancy/108992596", "requirement": "Опыт разработки бэкенд приложений на Python 3.x от 3 лет. Уверенное владение базовыми архитектурными паттернами. Знание библиотек: pandas, NumPy...", "responsibility": "Проект: Разрабатываем приложение для поиска персональных данных с целью обеспечения безопасности и защиты конфиденциальной информации. Оптимизация кода, устранение текущих проблем. ", "salary": 0}, {"name": "Python разработчик (Back-end)", "url": "https://hh.ru/vacancy/107365707", "requirement": "Понимание и практическая реализация многопоточного и асинхронного программирования. Опыта работы с реляционными СУБД (PostgreSQL, Mysql). Умение работать с очередями: Celery...", "responsibility": null, "salary": 100000}, {"name": "Python developer", "url": "https://hh.ru/vacancy/110607714", "requirement": "Высшее техническое/математическое образование. Опыт разработки backend (Python) приложений от 3-х лет. Опыт разработки интеграционных решений на основе REST...", "responsibility": "Работа с системой контроля версий на базе GIT. Разработка Backend сервисов и компонент портального решения. Анализ требований и выработка технических...", "salary": 0}, {"name": "Python-разработчик", "url": "https://hh.ru/vacancy/108474669", "requirement": "Опыт разработки на Python от 3х лет. Глубокое понимание принципов микросервисной архитектуры. Опыт работы с веб-фреймворками для создания...", "responsibility": "Разработка и поддержка микросервисных приложений на Python с использованием веб-фреймворка FastAPI. Реализация и поддержка REST API для взаимодействия с...", "salary": 0}, {"name": "Middle Python Developer", "url": "https://hh.ru/vacancy/110752129", "requirement": "Experience: Minimum of 3-5 years of professional experience in <highlighttext>Python</highlighttext> <highlighttext>development</highlighttext>. - Portfolio: Proven track record of successful projects and...", "responsibility": "Software Development: Design, develop, and maintain high-quality Python applications. - Code Review: Conduct thorough code reviews to ensure code quality...", "salary": 15000000}, {"name": "Python-разработчик Junior", "url": "https://hh.ru/vacancy/111223259", "requirement": "Владеешь Python. Знаешь JavaScript , PostgreSQL , jQuery , SQL , HTML5 , CSS3 , Php8 , Laravel , Docker (преимущественно). Обучаешься на очной форме...", "responsibility": "Проведением интервью с пользователями/разработчиками/заказчиками. Оформлением проектной документации (функциональные требования/тех. задания и тп). Описанием процессов, разработкой нормативной документации. ", "salary": 0}, {"name": "Python Разработчик (QGIS)", "url": "https://hh.ru/vacancy/108982183", "requirement": "Опыт программирования от 1 года Python (уверенное знание структур данных, алгоритмов, концепций языка). Отличное знание ГИС инструментов (QGIS). ", "responsibility": "Разработка, поддержка, развитие инструментов и плагинов для программной среды QGIS (QGIS Python API, PyQt5, Qt Creator) для формирования документов...", "salary": 0}, {"name": "Python-разработчик", "url": "https://hh.ru/vacancy/105837770", "requirement": "Открытость руководства, готовность к диалогу, поощрение инициативности от сотрудников. Уверенно программируете на Python 2.7, 3.6+. ", "responsibility": "Разработка новых модулей и расширение существующего функционала систем по требованиям заказчика. Работа с системой контроля версий и системой управления проектом...", "salary": 0}, {"name": "Middle Python Developer", "url": "https://hh.ru/vacancy/106138278", "requirement": "Коммерческий опыт разработки от 2х лет. Отличное знание Python и его инфраструктуры. Знание pandas, polars или аналоги, и основных...", "responsibility": "Написание и развитие ETL, ELT пайплайнов для обработки малых и больших объёмов данных. Оптимизация производительности существующих Python-модулей, взаимодействующих с...", "salary": 0}, {"name": "Backend Python Developer (Middle)", "url": "https://hh.ru/vacancy/109297534", "requirement": "Опыт разработки на языке python от 3х лет. Знание классических алгоритмов, структур данных, паттернов, понимание принципов ООП, SOLID. ", "responsibility": "Разработка высоконагруженных микросервисов в рамках архитектуры голосовых ботов. Взаимодействовать с ML инженерами команды и внедрять модели в backend сервисы. ", "salary": 0}, {"name": "Senior Python developer (outstaff)", "url": "https://hh.ru/vacancy/111197405", "requirement": "Коммерческий опыт работы на Python в продуктовых командах от 3-х лет. Понимание механики языка Python 3.10+ и...", "responsibility": "Разработка нового и доработка существующего функционала: ядра системы видеоаналитики, веб-приложения (API), системы сбора и создания данных телеметрии. ", "salary": 200000}, {"name": "Python-разработчик (e-com, маркетплейсы, парсинг данных)", "url": "https://hh.ru/vacancy/109165143", "requirement": "Имеете релевантный задачам опыт работы. Владеете соответствующим технологическим стэком - Python, Selenium, Node.js, PHP. Умеете самостоятельно организовывать свой рабочий процесс в...", "responsibility": "Разработка инструментов и модулей системы для сбора, обработки и хранения данных о товарах. Разрабатывать инструментарий для получение данных о товарах...", "salary": 0}, {"name": "Python developer", "url": "https://hh.ru/vacancy/110159932", "requirement": "Proficiency in Python programming at a professional level. Experience using Git for version control of code. Understanding of relational and...", "responsibility": "Develop new functionalities, including integrating with third-party APIs and contributing to solutions for data storage and processing in third...", "salary": 0}, {"name": "SQL/PostgreSQL/Python-разработчик", "url": "https://hh.ru/vacancy/106439400", "requirement": "Хорошее знание возможностей SQL/PostgreSQL (Тренироваться можешь на sql-ex.ru (Обучающий этап). Обнови знания об оконных функциях на professorweb.ru (Работа с...", "responsibility": "Ежедневно в Сбер поступают миллионы обращений от клиентов и наша задача предоставить им максимально комфортный сервис. Для этого нам необходимо...", "salary": 0}, {"name": "Python-разработчик (middle+)", "url": "https://hh.ru/vacancy/109427360", "requirement": "Уверенное знание Python (опыт от 3 лет). Опыт работы с Telegram API, WhatsApp API, интеграциями ChatGPT и других ИИ-решений. ", "responsibility": "Разработка чат-ботов и юзер-ботов с интеграцией ИИ (например, ChatGPT) для мессенджеров Telegram, WhatsApp и веб-чатов. ", "salary": 350000}, {"name": "Middle Python Developer", "url": "https://hh.ru/vacancy/109462299", "requirement": "Обладаешь опытом работы в роли <highlighttext>Python</highlighttext> <highlighttext>Developer</highlighttext> не менее 3-х лет. Обладаешь опытом работы с системами на микросервисной архитектуре. ", "responsibility": "Разработка программного обеспечения (backend) для финтех, сопровождение и доработка текущих проектов.", "salary": 0}, {"name": "Python разработчик", "url": "https://hh.ru/vacancy/109479814", "requirement": "Опыт веб-разработки на Python от 3 лет. Уверенное знание одного из фреймворков: FastAPI, Django. Хорошее знание SQL. ", "responsibility": "Разработка ПО. Эпизодически DevOps задачи (настройка nginx, CI/CD, настройка ОС серверов, конфигурация облачных сервисов). Участие в проектировании продукта. ", "salary": 0}, {"name": "Python-разработчик (Middle)", "url": "https://hh.ru/vacancy/109199821", "requirement": "Аналитический склад ума. Отличное знание библиотек Python для работы с данными более 2х лет (pandas, numpy, matplotlib и т...", "responsibility": "Python/SQL автоматизация работы с данными бэк-офиса. Разработка скриптов для автоматизации выгрузки, загрузки, обработки и визуализации данных. ", "salary": 0}, {"name": "Middle+/Senior Python Developer (GRI)", "url": "https://hh.ru/vacancy/110750040", "requirement": "Опыт коммерческой разработки Python – от 3х лет обязательно. Опыт с Django – от 2х лет обязательно. Углубленное понимание Postgre...", "responsibility": "Разработка и рефакторинг кода. Сопровождение и документирование написанного кода. Оптимизация сервисов под высокие нагрузки. Ecom разработка. API для приложения продавцов...", "salary": 0}, {"name": "Ведущий Python-разработчик", "url": "https://hh.ru/vacancy/109236174", "requirement": "Уверенное владение Python, знание Django, Flask и/или Fast API. Знание языка запросов SQL, умение проектировать структуру БД. ", "responsibility": "Разработка backend-составляющей веб-приложений. Мелкие правки во frontend-составляющей (React).", "salary": 400000}, {"name": "Senior Python разработчик в отдел научно-технической разработки", "url": "https://hh.ru/vacancy/111074581", "requirement": "Опыт работы Backend разработчиком от 3 лет. Знание Python и его фреймворка (например, Django или Flask). Опыт работы с реляционными...", "responsibility": "Разработка и поддержка серверной части приложений на Python. Проектирование, разработка и оптимизация баз данных, подходящих как для масштабируемых систем, так...", "salary": 0}, {"name": "Python разработчик", "url": "https://hh.ru/vacancy/109812806", "requirement": "высшее образование (техническое, математическое). - знание Python 3. - навыки разработки качественного кода с применением паттернов ООП. - базовое знание теории алгоритмов и...", "responsibility": "Мы делаем устройства, которые улучшают складские процессы в Озоне и ищем в свою команду <highlighttext>Python</highlighttext> <highlighttext>разработчика</highlighttext> на проект \"Разработка автоматических...", "salary": 0}, {"name": "Python-разработчик", "url": "https://hh.ru/vacancy/110099977", "requirement": "Разрабатывали бэкенд, проектировали и разрабатывали микросервисы, выбирали базы данных, масштабировались под нагрузкой. Имеете опыт коммерческой разработки от 4-х лет. ", "responsibility": "Проектировать, разрабатывать и развивать распределённые отказоустойчивые бэкенд-системы: дорабатывать существующие микросервисы и создавать новые. Писать читаемый поддерживаемый код и помогать...", "salary": 400000}, {"name": "Python разработчик для работы с CRM Odoo", "url": "https://hh.ru/vacancy/110262850", "requirement": "Опыт разработки на Python от 5 лет. Опыт работы с различными СУБД — MySQL, PostgreSQL, MsSQL. Опыт работы в Docker, CI...", "responsibility": "Про продукт. Команда finance product разрабатывает внутренние инструменты для работы с финансовыми, HR и другими служебными данными внутри Emex.", "salary": 0}, {"name": "Software Developer Python", "url": "https://hh.ru/vacancy/110050939", "requirement": "Уверенное владение Python 3 (FastAPI/ Django), знание слабых и сильных сторон. Коммерческий опыт разработки веб-продуктов​​​ в команде​​​​ от 2...", "responsibility": "Разработка архитектуры новых проектов и технологических решений. Поддержка, развитие и оптимизация существующего кода бекендов различных сервисов действующих проектов. ", "salary": 270000}, {"name": "Python developer Middle (Python разработчик)", "url": "https://hh.ru/vacancy/110368902", "requirement": "Опыт коммерческой разработки на Python. Знание как минимум одного Python фреймворка (Django, Flask, Fast API и тд.). Знание алгоритмов и...", "responsibility": "Разработка и поддержка RPA решений для автоматизации бизнес-процессов. Оптимизация алгоритмов и использование структур данных. Применение ООП при проектировании модульных...", "salary": 0}, {"name": "Python developer", "url": "https://hh.ru/vacancy/109483143", "requirement": "Наличие высшего образования. Знание основных подходов к программированию ООП/SOlID. Знание FastAPI/Pydantic/SqlAlchemy/Pandas/Numpy/Scipy. Знание Pytest. ", "responsibility": "Проектирование и реализация новой функциональности. Обеспечение поддержки 3-го уровня (поиск и решение проблем). Покрытие кода тестами. Участие, в совместном...", "salary": 0}, {"name": "Python-разработчик", "url": "https://hh.ru/vacancy/111248832", "requirement": "Опыт в роли <highlighttext>Python</highlighttext>-<highlighttext>разработчика</highlighttext> от 3х лет. Опыт работы с фреймворками FastAPI и Flask. Опыт работы с реляционными...", "responsibility": "Разработка основного проекта компании - ядра, с которым взаимодействуют все клиентские сервисы (такие как собственная фронтенд-платформа, партнерские сайты, мобильные приложения). ", "salary": 0}, {"name": "Python-разработчик (Python-программист)(01050-1)", "url": "https://hh.ru/vacancy/104725042", "requirement": "Высшее образование специалитет / магистратура (готовы рассмотреть в том числе соискателя-студента магистратуры, специалитета). Знание системы и основных инструментов Git. ", "responsibility": "Интерес к архитектуре приложений и построению распределенных сервисных систем. Работа по гибким методологиям разработки ПО с использованием программных продуктов Atlassian...", "salary": 100000}, {"name": "Python-разработчик (Middle, Middle+)", "url": "https://hh.ru/vacancy/108278400", "requirement": "Знание на продвинутом уровне Python. Понимание принципов ООП. Контроль версий. RestAPI. SQL (PostgreSQL). Понимание JS (приветствуется опыт работы с frontend...", "responsibility": "Разработка Backend приложений на Django/DRF. Поддержание работы существующих проектов.", "salary": 180000}, {"name": "Python разработчик", "url": "https://hh.ru/vacancy/108368451", "requirement": "Опыт коммерческой разработки на Python 3 от 3-х лет. Опыт разработки REST API (мы используем FastAPI). Понимать что такое...", "responsibility": "Разработка внутренних продуктов компании. Покрытие кода unit тестами. Участие в код ревью.", "salary": 0}, {"name": "Python developer (Senior/Team Lead)", "url": "https://hh.ru/vacancy/109469522", "requirement": "Непрерывный опыт разработки на Python (3.8 и выше) от 5 лет. Опыт работы с Qt/PyQt. Умение и готовность...", "responsibility": "Разработка backend распределенной высоконагруженной системы (PostgreSQL, ActiveMQ, Redis, Python3.9+ и сторонние сервисы).", "salary": 0}, {"name": "Python разработчик", "url": "https://hh.ru/vacancy/109479765", "requirement": "Опыт веб-разработки на Python от 3 лет. Уверенное знание одного из фреймворков: FastAPI, Django. Хорошее знание SQL. ", "responsibility": "Разработка ПО. Эпизодически DevOps задачи (настройка nginx, CI/CD, настройка ОС серверов, конфигурация облачных сервисов). Участие в проектировании продукта. ", "salary": 0}, {"name": "Middle Backend Python разработчик", "url": "https://hh.ru/vacancy/109166732", "requirement": "Вы имели опыт работы с Rust. Вы имели опыт с работой виртуальными машинами. Вы работали с API libvirt. ", "responsibility": "Написание автотестов. Написание нового функционала. Написание качественного и типизированного кода. Написание документации. Проведение код-ревью. Написание новых сервисов.", "salary": 150000}, {"name": "Python-разработчик", "url": "https://hh.ru/vacancy/108042385", "requirement": "Опыт коммерческой разработки на Python от 2х лет. Django, FastAPI, ORM. Общие понимания работы с Linux, Docker, nginx, git. ", "responsibility": "Разработка backend-а сервиса. Участие в формировании roadmap развития.", "salary": 0}, {"name": "Python Backend Developer (AI)", "url": "https://hh.ru/vacancy/110978214", "requirement": "Знание Python на уровне middle+ / senior. Знание SQL. Опыт работы с фреймворком Flask. Опыт работы с облачной архитектурой: AWS/Azure...", "responsibility": "Продукты: веб - платформа для генерации изображений 18+ и платформа для общения с AI-персонажами. Основная задача: улучшить качество adult...", "salary": 250000}, {"name": "Python разработчик", "url": "https://hh.ru/vacancy/108939785", "requirement": "Знание Python и/или Golang. В случае опыта работы только на одном ЯП – должна быть готовность освоить второй язык. — ", "responsibility": "АС БАРС ЦУНДО предназначена для организации мониторинга за специализированными транспортными средствами (СТС) на маршрутах инкассации в целях обеспечения и повышения...", "salary": 0}, {"name": "Python разработчик (Middle)", "url": "https://hh.ru/vacancy/98625238", "requirement": "Аналитический склад ума. Отличное знание библиотек Python для работы с данными более 2х лет (pandas, numpy, matplotlib и т...", "responsibility": "Python/SQL автоматизация работы с данными бэк-офиса. Разработка скриптов для автоматизации выгрузки, загрузки, обработки и визуализации данных. ", "salary": 0}, {"name": "Python-разработчик (middle+)", "url": "https://hh.ru/vacancy/110602874", "requirement": "Глубокие знания Python и опыт работы с фреймворками FastApi, SQLAlchemy. Понимание принципов ООП и архитектурных паттернов. Опыт работы с реляционными...", "responsibility": "Разработка и поддержка веб-сервисов и решений на Python. Участие в проектировании и создании архитектуры приложений. Проведение код-ревью и...", "salary": 0}, {"name": "Middle Python Developer", "url": "https://hh.ru/vacancy/107476064", "requirement": "Общий опыт работы как разработчик Python не менее 3 лет. Опыт работы с ETL, конвейерами обработки данных (Apache Airflow, Prefect...", "responsibility": "Создавать очередные версии продуктов в рамках общих планов и поставленных задач. Создавать пилотные продукты для проведения оценок. Участвовать в технических...", "salary": 0}, {"name": "Python-разработчик", "url": "https://hh.ru/vacancy/109484354", "requirement": "Опыт коммерческой разработки на Python от 5 лет. Владение хотя бы 2-3 фреймворками: AioHttp, Sanic, FastApi, Starlette, Django, Flask...", "responsibility": "Выполнять задачи по разработке программных решений в веб и мобильных приложениях на основании ТЗ, полученных от функциональных консультантов, в соответствии...", "salary": 0}, {"name": "Middle Fullstack Developer", "url": "https://hh.ru/vacancy/111039379", "requirement": "2+ years of hands-on experience in <highlighttext>Python</highlighttext> <highlighttext>development</highlighttext>. Education: Technical or mathematical education required. Experience with SQL and...", "responsibility": "Mad Devs is a full-stack team specializing in developing and administering large-scale IT products across various industries, many...", "salary": 0}, {"name": "Python Web3 разработчик", "url": "https://hh.ru/vacancy/109460810", "requirement": "Задачи требуют глубокого понимания не только языка программирования, но еще принципов ООП, взаимодействия в блокчейне, и принципов работы криптовалюты. - ", "responsibility": "EVM взаимодействие со смарт-контарктами.", "salary": 250000}, {"name": "Python-developer", "url": "https://hh.ru/vacancy/110382689", "requirement": "Мы не работаем под заказ, мы создаем тиражные продукты. Используемый стек технологий: C++, Python, PostgreSQL, Javascript, NodeJS, Redis, ElasticSearch, Clickhouse. ", "responsibility": "Разработка высоконагруженного финансового приложения. - Реализация сервиса доставки. - Развитие и сопровождение высоконагруженного приложения фиксации активности пользователей.", "salary": 175000}, {"name": "Middle Python Developer", "url": "https://hh.ru/vacancy/106846693", "requirement": "Опыт коммерческой разработки - от 1 года. Знание и опыт работы с Django + REST Framework, Django ORM. Опыт работы с...", "responsibility": "Проектирование и реализация новых фичей. Код ревью. Рефакторинг функционала. Исследование багов и их исправление.", "salary": 0}, {"name": "Senior Python developer", "url": "https://hh.ru/vacancy/108197869", "requirement": "Хорошие знания принципов ООП, алгоритмов, структур данных и паттернов. Опыт коммерческой разработки на Python от 2 лет. Опыт разработки REST...", "responsibility": null, "salary": 0}, {"name": "Python разработчик (FastAPI)", "url": "https://hh.ru/vacancy/106054241", "requirement": "Знание Python (понимание ООП) и понимание работы языка на низком уровне. Опыт работы с асинхронным кодом, опыт проектирования архитектуры ПО. ", "responsibility": "Строить отчеты об объектах мониторинга и параметрах сбора. Предоставляет возможность пользователям настраивать мониторинги исходя из своих потребностей и в соответствии...", "salary": 0}, {"name": "Python developer (Виртуальный ассистент Салют)", "url": "https://hh.ru/vacancy/110307476", "requirement": "Опыт работы в <highlighttext>Python</highlighttext> <highlighttext>разработчиком</highlighttext> - от 2х лет. Владение Python3 на уверенном уровне. Понимание принципов микросервисной архитектуры. ", "responsibility": "Анализом бизнес и системных требований, генерацией идей, проработкой технических решений, интеграционных взаимодействий. Участием в разработке продуктов и концепций (мозговые штурмы...", "salary": 0}, {"name": "Python developer Junior + / Middle", "url": "https://hh.ru/vacancy/109783483", "requirement": "Опыт разработки на Python от полугода. Знание алгоритмов и структур данных+ умение применить на практике. Понимание REST API. ", "responsibility": "Разработка и поддержка API для взаимодействия клиентской части игры с сервером. Проектирование и оптимизация схем баз данных для эффективного хранения...", "salary": 0}, {"name": "Python-разработчик (работа в офисе)", "url": "https://hh.ru/vacancy/110650928", "requirement": "Опыт разработки на Python от 1 года. Знание Django. Опыт работы с PostgreSQL. Навыки работы с Git. Знание Docker.", "responsibility": "Запись на собеседование осуществляется по телефону, который указан в объявлении.", "salary": 0}, {"name": "Программист Python/Машинное обучение", "url": "https://hh.ru/vacancy/109571126", "requirement": "Владение основными компонентами библиотеки OpenCV , знание ее структур данных, базовых функций. Уверенное знание языка Python3. Опыт работы с Linux...", "responsibility": "Разрабатывать и поддерживать проекты в сферах компьютерного зрения, машинного обучения. Разработка API для взаимодействия с мобильными телефонам. Погрузиться в принцип...", "salary": 0}, {"name": "Middle / Middle+ Python разработчик", "url": "https://hh.ru/vacancy/109053157", "requirement": "Опыт промышленной на Python 3 от 2 лет. Уверенное владение базовыми архитектурными паттернами. Знание библиотек: SQLAlchemy. Умение составлять сложные SQL...", "responsibility": "Создание и поддержка unit и integration тестов с использованием pytest. Обязанности: Разработка и поддержка новых программных решений для b2...", "salary": 0}, {"name": "Python разработчик", "url": "https://hh.ru/vacancy/109524150", "requirement": "Отличное знание Python 3 и опыт промышленной разработки на Python от трех лет. Опыт многопоточного и асинхронного программирования. ", "responsibility": "Проектирование компонентов систем. Организация процесса разработки. Написание и ревью кода. Написание тестов на свой код. Наставление менее опытных коллег.", "salary": 0}, {"name": "Python разработчик", "url": "https://hh.ru/vacancy/109524070", "requirement": "Отличное знание Python 3 и опыт промышленной разработки на Python от трех лет. Опыт многопоточного и асинхронного программирования. ", "responsibility": "Проектирование компонентов систем. Организация процесса разработки. Написание и ревью кода. Написание тестов на свой код. Наставление менее опытных коллег.", "salary": 0}, {"name": "Middle/Senior Python developer", "url": "https://hh.ru/vacancy/110110245", "requirement": "Широкий опыт разработки на Python (3.x), в том числе для веб-резработки (Django). Опыт использования Celery, Redis, RedisStream, asyncio...", "responsibility": "Обработка, хранение и отображение результатов детектирования объектов в видеопотоке. Поддержка в продукте новых атрибутов объектов отслеживания. Реализация алгоритмов агрегации данных...", "salary": 0}, {"name": "Senior Python Developer", "url": "https://hh.ru/vacancy/110815435", "requirement": "5+ years of experience in Python (with expertise in asyncio, FastAPI). 2+ years of experience with MongoDB, Redis...", "responsibility": "Product Architecture: Design a scalable and secure product architecture. Evaluate and implement technologies to enhance performance and streamline operations. ", "salary": 0}, {"name": "Python разработчик", "url": "https://hh.ru/vacancy/109524096", "requirement": "Отличное знание Python 3 и опыт промышленной разработки на Python от трех лет. Опыт многопоточного и асинхронного программирования. ", "responsibility": "Проектирование компонентов систем. Организация процесса разработки. Написание и ревью кода. Написание тестов на свой код. Наставление менее опытных коллег.", "salary": 0}, {"name": "Backend-разработчик / Python developer", "url": "https://hh.ru/vacancy/110129185", "requirement": "Знание Python 3. Опыт разработки REST API. Понимание асинхронного программирования. Опыт написания запросов на языке SQL. Опыт работы с репликацией...", "responsibility": "Разрабатывать и поддерживать высоконагруженные и производительные API на Python для встраиваемых систем (бинарный протокол поверх HTTP), фронтенда и мобильного приложения...", "salary": 200000}, {"name": "Python разработчик", "url": "https://hh.ru/vacancy/110866925", "requirement": "Уверенные 5+ лет в питоне. Умение оценить сложность произвольной части кода, а не только знание таковых для разных методов...", "responsibility": "Разрабатывать приложение с HTTP API (FastAPI). Вести разработку в рамках одного из небольших сервисов в составе большого продукта. ", "salary": 0}, {"name": "Python разработчик", "url": "https://hh.ru/vacancy/109524032", "requirement": "Отличное знание Python 3 и опыт промышленной разработки на Python от трех лет. Опыт многопоточного и асинхронного программирования. ", "responsibility": "Проектирование компонентов систем. Организация процесса разработки. Написание и ревью кода. Написание тестов на свой код. Наставление менее опытных коллег.", "salary": 0}, {"name": "Python-разработчик в DuckMaster (Telegram app)", "url": "https://hh.ru/vacancy/108936228", "requirement": "Проект динамичный, быстрый цикл релиза функционала, поэтому важно знание используемых технологий на проекте. Требования: Опыт коммерческой backend разработки от 3...", "responsibility": null, "salary": 400000}, {"name": "SQL- разработчик", "url": "https://hh.ru/vacancy/110653654", "requirement": "Опыт работы в роли <highlighttext>Python</highlighttext> <highlighttext>Developer</highlighttext> от 4-х лет. Опыт работы с Docker, GitLab CI, OpenShift либо Kubernetes, nginx. ", "responsibility": "Исправлять ошибки в коде. Разрабатывать запросы к БД. Писать тестовые сценарии для проверке разработанного кода.", "salary": 120000}, {"name": "Python Developer", "url": "https://hh.ru/vacancy/106523905", "requirement": "Опыт разработки на Python, с использованием технологий: FastAPI, Pydantic, Asyncio, async motor, Jinja2. Понимание принципов работы с базой данных...", "responsibility": "Поддержка и развитие существующего проекта, написанного на Python. Проект представляет собой платформу, которая через API с помощью JWT получает данные...", "salary": 0}, {"name": "Backend-разработчик (Python/Go)", "url": "https://hh.ru/vacancy/109842986", "requirement": "Высшее техническое образование. От 2-х лет в качестве <highlighttext>Python</highlighttext>-<highlighttext>разработчика</highlighttext>. Наличие опыта разработки на Go будет плюсом. ", "responsibility": "Разработка микросервисной архитектуры Backend приложения. Реализация бизнес-логики с использованием различных фреймворков и библиотек. Разработка собственных модулей, в том числе...", "salary": 0}, {"name": "Senior python developer", "url": "https://hh.ru/vacancy/111219339", "requirement": "Имеешь опыт построения микросервисной архитектуры для работы с большими объёмами данных. Понимаешь преимущества асинхронного кода и когда его стоит использовать. ", "responsibility": "Проектировать масштабируемую архитектуры, создавать отказоустойчивые и производительные решения. Работать как с существующей кодовой базой, так и разрабатывать новые API и...", "salary": 0}, {"name": "Middle Python Developer", "url": "https://hh.ru/vacancy/110336864", "requirement": "Опыт разработки 3-х лет в коммерческих проектах с применением веб-сервисов. Отличное знание языка Python. Понимание того как делаются...", "responsibility": "Разработка веб-сервисов: мобильное API, API для web-приложения (админка), разработка интеграционных и служебных сервисов. Реализация сервисов с использованием потоковой...", "salary": 0}, {"name": "Python developer", "url": "https://hh.ru/vacancy/109426793", "requirement": "Опыт работы с Linux и Bash. Уверенное владение инструментами разработки на Python, такими как виртуальные окружения, установщики пакетов и системы...", "responsibility": "Построение Backend Web-сервисов для работы с моделями машинного обучения и размещения нейронных сетей на серверах. Разработка и обучение нейронных...", "salary": 0}, {"name": "Python-разработчик Middle+/Senior", "url": "https://hh.ru/vacancy/110292576", "requirement": "Уверенные знания Python3 и опыт разработки от 4-5 лет. Умение проектировать и развивать архитектуру сервисов. Опыт работы с...", "responsibility": "Разрабатывать высокопроизводительные сервисы на Python. Оптимизировать и улучшать существующие сервисы, обеспечивая их отказоустойчивость и перерабатывая архитектуру.", "salary": 200000}, {"name": "Python-разработчик систем сбора", "url": "https://hh.ru/vacancy/72687495", "requirement": "Уверенное знание Python3. Опыт разработки систем сбора. Опыт многопоточной и асинхронной разработки (threading, asyncio), знание примитивов синхронизации, умение масштабировать...", "responsibility": "Написание чистого, понятного кода. Реализация систем сбора. Анализ и исправление ошибок. Сопровождение запуска и эксплуатации сборщиков в продакшене.", "salary": 150000}, {"name": "Python developer (Hardware)", "url": "https://hh.ru/vacancy/108816839", "requirement": "Опыт коммерческой разработки на Python. Опыт работы с Python3.9+. Опыт использования pytest. Знание Jenkins. Знание Allure TestOps. ", "responsibility": "Разработкой программных имитаторов железа. Разработкой ПО для автоматизации производства и испытаний железа. Разработкой фреймворка для тестирования железа: исправлением багов, внедрением...", "salary": 0}, {"name": "Middle+/Senior Python Developer", "url": "https://hh.ru/vacancy/111069562", "requirement": "Практический коммерческий опыт разработки на Python от 4 лет. - Опыт и знание Django, DRF. - Опыт работы с брокером очередей Celery. - ", "responsibility": "Работа с легаси и разработка нового кода. - Проведение код ревью. - Контроль реализации командами разработки кода, на соответствие принятым стандартам и...", "salary": 400000}, {"name": "Программист Python Middle+", "url": "https://hh.ru/vacancy/109753518", "requirement": "Высшее техническое образование. Опыт работы в роли <highlighttext>Python</highlighttext>-<highlighttext>разработчика</highlighttext> от 3-x лет. Понимание механизмов multithreading и multiprocessing и умение...", "responsibility": "Работа в команде - разработка нового функционала и сопровождение для крупной многоконтейнерной системы по сбору и анализу больших данных. ", "salary": 0}, {"name": "Python разработчик fullstack", "url": "https://hh.ru/vacancy/108960659", "requirement": "Обязательно) Опыт коммерческой разработки на Python не менее 1 года. Backend (80% от общего объема задач): Python 3.10, Django...", "responsibility": "Fullstack разработка веб-приложений для сбора, агрегации и обработки (анализа) данных по различным каналам данных (основные - API REST/другие). ", "salary": 200000}, {"name": "Senior Python-разработчик", "url": "https://hh.ru/vacancy/111226627", "requirement": "Опыт разработки Backend приложений (Python 3.>) от 5 лет Senior. Уверенное владение базовыми архитектурными паттернами. Понимание асинхронной парадигмы программирования. ", "responsibility": null, "salary": 0}, {"name": "Python-разработчик", "url": "https://hh.ru/vacancy/110797451", "requirement": "Знание продуктов Atlassian, понимание архитектуры продуктов Atlassian. Понимание структуры базы данных Jira. Опыт работы с реляционными базами данных (MS SQL...", "responsibility": "Участие в разработке, code review, улучшение и оптимизация текущего кода. Анализ задач, проработка решения совместно с аналитиком. Участие в разработке...", "salary": 0}, {"name": "Python-разработчик", "url": "https://hh.ru/vacancy/110378408", "requirement": "Опыт разработки на Python. Опыт работы с реляционными базами данных (MySQL, PostgreSQL). Умение писать сложные SQL-запросы. Опыт работы с...", "responsibility": "Участие в разработке, запуск и дальнейшее сопровождение контрольно-пропускной системы. Интеграции информационных систем. Модернизация существующей логистической системы. Участие в реализации...", "salary": 0}, {"name": "Middle+/Senior Python Developer", "url": "https://hh.ru/vacancy/111069564", "requirement": "Практический коммерческий опыт разработки на Python от 4 лет. - Опыт и знание Django, DRF. - Опыт работы с брокером очередей Celery. - ", "responsibility": "Работа с легаси и разработка нового кода. - Проведение код ревью. - Контроль реализации командами разработки кода, на соответствие принятым стандартам и...", "salary": 400000}, {"name": "Python разработчик", "url": "https://hh.ru/vacancy/110867865", "requirement": "Отличное знание Python 3 и опыт промышленной разработки на Python от трех лет. Опыт многопоточного и асинхронного программирования. ", "responsibility": "Проектирование компонентов систем. Организация процесса разработки. Написание и ревью кода. Написание тестов на свой код. Наставление менее опытных коллег.", "salary": 0}, {"name": "Python-разработчик (middle/ senior)", "url": "https://hh.ru/vacancy/109465651", "requirement": "Опыт разработки на Python 3.8 - 3.12 от 3 лет. Опыт работы с Web-фреймворками: FastAPI, Sanic, BlackSheep, Flask. ", "responsibility": "Разработка новых, поддержка, развитие и рефакторинг существующих приложений (сервисов, микросервисов). Проектирование отказоустойчивых и высокопроизводительных приложений (сервисов, микросервисов). Проектирование и написание...", "salary": 0}, {"name": "Senior Python-разработчик", "url": "https://hh.ru/vacancy/107687359", "requirement": "Высшее образование. GitLab, Jira, Confluence. Язык программирования Python. Python, микросервисной архитектуры. Инструмента Apache Airflow. СУБД - PostgreSQL. Клиент-серверной архитектуры систем. ", "responsibility": "Описать архитектуру решения, исходя из бизнес-требований заказчика. Организовать детальную проработку схемы решения системными аналитиками. Выполнение функций курирования архитектуры решения. ", "salary": 0}, {"name": "Python developer (Senior)", "url": "https://hh.ru/vacancy/109079829", "requirement": "Опыт коммерческой разработки на Python/Django не менее 5 лет. Отличное знание фреймворка django версии не ниже 3 (ORM, формы...", "responsibility": "Разработка веб-приложений для доступа пользователей к алгоритмам автоматизации. Поддержка текущей кодовой базы и внедрение нового функционала для существующих приложений. ", "salary": 0}, {"name": "Python разработчик", "url": "https://hh.ru/vacancy/109161371", "requirement": "опыт коммерческой разработки на Python 3.6+. - знание и опыт с aiohttp / fastapi / flask. - уверенные навыки работы с git. ", "responsibility": "НТЦ «Вулкан» - российская аккредитованная IT-компания. Наши проекты связаны с оказанием сервисных ИТ/ИБ-услуг, разработкой прикладного ПО, созданием VR...", "salary": 0}, {"name": "Senior Python developer", "url": "https://hh.ru/vacancy/109732250", "requirement": "Отличное знание Python, опыт работы с микросервсными фрейворками. Опыт работы от 4 лет; опыт разработки на Python от 3 года. ", "responsibility": "Отвечать за инфраструтурные решения, которые будут использовать в продуктовых ai-командах, в том числе разрабатывать библиотеки и шаблоны сервисов. ", "salary": 9000}, {"name": "Python Developer (SberНадежность)", "url": "https://hh.ru/vacancy/110657582", "requirement": "Коммерческий опыт разработки до успешного внедрения микросверисов и ETL на Python 3+ (Flask, FastApi, AioHTTP и др.). ", "responsibility": "Разрабатывать архитектуру решения с учетом стандартов Банка по надежности и кибербезопасности. Писать код приложения. Знакомство с CI/CD на уровне...", "salary": 0}, {"name": "Разработчик Python", "url": "https://hh.ru/vacancy/109561938", "requirement": "Знание python 3.x, понимание отличий версий до 3.6, после 3.6. Опыт работы с реляционными БД, в частности...", "responsibility": "Написание чистого и понятного кода. Покрытие своего кода тестами. Участие в проработке архитектуры проекта. Участие в улучшении и оптимизации процессов. ", "salary": 0}, {"name": "Middle Python Developer", "url": "https://hh.ru/vacancy/110312686", "requirement": "Опыт разработки 3-х лет в коммерческих проектах с применением веб-сервисов. Отличное знание языка Python. Понимание того как делаются...", "responsibility": "Разработка веб-сервисов: мобильное API, API для web-приложения (админка), разработка интеграционных и служебных сервисов. Реализация сервисов с использованием потоковой...", "salary": 0}, {"name": "Python-разработчик", "url": "https://hh.ru/vacancy/94185521", "requirement": "Знаешь Python 3 и имеешь опыт промышленной разработки на Python от трех лет. Есть опыт многопоточного и асинхронного программирования. ", "responsibility": "Проектировать компоненты систем. Организовывать процесс разработки. Писать и ревьюить код. Наставлять менее опытных коллег.", "salary": 0}, {"name": "Python-разработчик", "url": "https://hh.ru/vacancy/110336035", "requirement": "Опыт работы с python, django, redis, kafka, celery, pytest. Уверенный опыт работы с СУБД: postgres. Контейнеризация: docker. Базовое понимание работы...", "responsibility": "Разработка и поддержка информационной веб-системы. Изучение продукта, логики, архитектуры. Оптимизация и улучшение системы. Интеграция с внешними API и сервисами.", "salary": 0}, {"name": "Backend Python developer", "url": "https://hh.ru/vacancy/109525403", "requirement": "Опыт коммерческой разработки веб-сервисов и API не менее 5-и лет. Уверенное знание Python 3.x с любым микро...", "responsibility": "Разработка и поддержка информационно-развлекательной системы на базе Python. Участие в проектировании новых фичей и написание качественного кода. ", "salary": 0}, {"name": "Middle/Senior Python Developer (fintech-продукт)", "url": "https://hh.ru/vacancy/110127125", "requirement": "Опыт с Python от 3-5 лет (основные концепции и низкоуровневые реализации). Опыт разработки REST API / Websocket. Опыт асинхронной разработки. ", "responsibility": "Работа над одним проектом. Этапы отбора:", "salary": 5000}, {"name": "SQL- разработчик", "url": "https://hh.ru/vacancy/110653647", "requirement": "Опыт работы в роли <highlighttext>Python</highlighttext> <highlighttext>Developer</highlighttext> от 4-х лет. Опыт работы с Docker, GitLab CI, OpenShift либо Kubernetes, nginx. ", "responsibility": "Исправлять ошибки в коде. Разрабатывать запросы к БД. Писать тестовые сценарии для проверке разработанного кода.", "salary": 120000}, {"name": "Python разработчик", "url": "https://hh.ru/vacancy/109480593", "requirement": "Опыт веб-разработки на Python от 3 лет. Уверенное знание одного из фреймворков: FastAPI, Django. Хорошее знание SQL. ", "responsibility": "Разработка ПО. Эпизодически DevOps задачи (настройка nginx, CI/CD, настройка ОС серверов, конфигурация облачных сервисов). Участие в проектировании продукта. ", "salary": 0}, {"name": "Python разработчик в команду облака", "url": "https://hh.ru/vacancy/85767534", "requirement": "Уверенное знание Python. Понимание основ работы сети и Linux: TCP/IP, HTTP, DNS, файловая система.", "responsibility": "Разрабатывать на Python сервисы облачной платформы. Работать с гипервизором / сетями / системами хранения данных. Проектировать программные интерфейсы (API). Разрабатывать архитектуру высоконагруженных...", "salary": 0}, {"name": "Ведущий Python разработчик", "url": "https://hh.ru/vacancy/110389221", "requirement": "Опыт работы от 2-х лет в разработке на Python. Знание стандартных библиотек Python и опыт работы с фреймворками, такими...", "responsibility": "Разработка функционала с использованием Python версии 3.9 и выше. Интеграция платежных шлюзов и оптимизация процесса обработки платежей. ", "salary": 300000}, {"name": "Python разработчик (Middle)", "url": "https://hh.ru/vacancy/98625239", "requirement": "Аналитический склад ума. Отличное знание библиотек Python для работы с данными более 2х лет (pandas, numpy, matplotlib и т...", "responsibility": "Python/SQL автоматизация работы с данными бэк-офиса. Разработка скриптов для автоматизации выгрузки, загрузки, обработки и визуализации данных. ", "salary": 0}, {"name": "Senior Python Dev", "url": "https://hh.ru/vacancy/107475532", "requirement": "Опыт работы <highlighttext>Python</highlighttext> <highlighttext>разработчиком</highlighttext> от 4х лет. Опыт работы с фреймворком - FastAPI. Знание Docker. Знание ООП и паттернов проектирования. ", "responsibility": "Разработка, тестирование и поддержка программного обеспечения на Python. Участие во всех этапах разработки. Оптимизация и улучшение существующего кода и архитектуры. ", "salary": 300000}, {"name": "Trainee Python Developer", "url": "https://hh.ru/vacancy/107116353", "requirement": "Уверенные знания языка Python и его основных фреймворков для веб разработки (Django/Flask/FastAPI). Понимание принципов ООП, DRY, KISS, SOLID...", "responsibility": null, "salary": 0}, {"name": "Middle Python Developer (Firewall)", "url": "https://hh.ru/vacancy/107516192", "requirement": "Python (3.9): Asyncio, SQLAlchemy, FastAPI. Общие: Git, Linux, PostgreSQL. Опыт работы с асинхронными кодом. Опыт работы с сетями, знание...", "responsibility": "Разработка архитектурных решений. Реализация как маленьких, так и больших проектных фичей. Задачи по работе с техдолгом, рефакторингом, дебаггингом, профилированием, поиском...", "salary": 0}, {"name": "Python developer", "url": "https://hh.ru/vacancy/108990507", "requirement": "Опыт коммерческой разработки на Python от 3 лет. Понимание ООП, паттернов проектирования и алгоритмов. Умение работать с асинхронным кодом. ", "responsibility": "Участие в проектировании, разработке и поддержке высоконагруженных сервисов/микросервисов. Code review в команде. Разработка юнит-тестов и тестирование собственного кода...", "salary": 0}, {"name": "Middle Python Developer: Backend / Server side", "url": "https://hh.ru/vacancy/109888858", "requirement": "4+ года опыта с Python(включая asyncio). Опыт работы с FastAPI/Flask или аналогичными фрэймворками. Опыт работы с реляционными...", "responsibility": "Разработка и поддержка инфраструктурных сервисов и систем. Совместная работа с другими командами над архитектурой сервисов и систем. Написание переиспользуемого, тестируемого...", "salary": 4000}, {"name": "Python developer (Персональный финансовый менеджмент)", "url": "https://hh.ru/vacancy/110257329", "requirement": "Опыт работы <highlighttext>Python</highlighttext> <highlighttext>разработчиком</highlighttext> от 2 лет. Владение Python3 на уверенном уровне. Понимание структур данных. Понимание работы с ресурсами...", "responsibility": "Анализ бизнес и системных требований, генерация идей, проработка технических решений, интеграционных взаимодействий. Участие в разработке продуктов и концепций (мозговые штурмы...", "salary": 0}, {"name": "Senior Python разработчик (SberInfra.Cloud)", "url": "https://hh.ru/vacancy/110862714", "requirement": "Знаете Python и готовы изучать другие языки программирования. Имеете опыт работы с реляционными/колоночными базами данных. Умеете писать надежный код...", "responsibility": "Разрабатывать и поддерживать (L3) сервисы биллинга облака Сбера (одно из самых больших частных облаков в Европе). Писать микросервисную архитектуру...", "salary": 0}, {"name": "Middle+/Senior Python Developer", "url": "https://hh.ru/vacancy/111069561", "requirement": "Практический коммерческий опыт разработки на Python от 4 лет. - Опыт и знание Django, DRF. - Опыт работы с брокером очередей Celery. - ", "responsibility": "Работа с легаси и разработка нового кода. - Проведение код ревью. - Контроль реализации командами разработки кода, на соответствие принятым стандартам и...", "salary": 400000}, {"name": "Ведущий Python разработчик", "url": "https://hh.ru/vacancy/109563852", "requirement": "Опыт разработки на Python более 2 лет: создание сетевых API (протокол не принципиален, *rpc, rest, soap, и т.д.), умение...", "responsibility": "Участие в проектировании и реализации новых функциональных модулей и микросервисов. Разработка с нуля и доработка существующих микросервисов и функционала продукта...", "salary": 0}, {"name": "Python разработчик в SupportGPT", "url": "https://hh.ru/vacancy/110992197", "requirement": "Имеете опыт разработки бекендов на асинхронном Python-е. Понимаете в ML или хотите разобраться. Знаете из опыта как сделать хороший...", "responsibility": "Разработка новых фич. Создание инструментов для ML-команд. Мы делаем не только продукт для внешних заказчиков но и создаем технологическую...", "salary": 0}, {"name": "Python developer (гибрид)", "url": "https://hh.ru/vacancy/109553041", "requirement": "Опыт разработки Backend приложений(Python 3.>) от 2 лет. Опыт работы с фреймворками по направлению Python: asyncio/Flask/fastapi. ", "responsibility": "Разрабатывать и описывать API Kafka. Разрабатывать код «обертки» для смежной команды. Разрабатывать микросервисы для построения продукта. Поддерживать и дорабатывать текущие...", "salary": 0}, {"name": "Python Developer (ОФИС)", "url": "https://hh.ru/vacancy/101741848", "requirement": "Уже имеете опыт работы со Spark и Polars.", "responsibility": "SpectrumData - IT-компания, предоставляющая решения по управлению рисками на основе больших данных. Наши клиенты – лидирующие страховые компании и платформы, банки...", "salary": 250000}, {"name": "Python разработчик", "url": "https://hh.ru/vacancy/109146349", "requirement": "Опыт 5+ лет. Знание Python FastAPI, API, Apache Kafka, Docker. Понимание принципов работы серверов. Навыки написания юнит-тестов и...", "responsibility": "Разработка ядра системы, базовой логики и алгоритмов работы всех компонентов. Обеспечение корректной работы всех функций системы. Организация и работа с...", "salary": 300000}, {"name": "Senior Python разработчик/Архитектор (backend)", "url": "https://hh.ru/vacancy/109544429", "requirement": "Уверенно знаете Python и имеете коммерческий опыт разработки минимум от 3х лет. Понимаете, как работают современные веб-сервисы. ", "responsibility": "Работали с фреймворками Django/FastAPI. Участвовали в разработке архитектурных решений. -Реализация решений любого уровня (участие в полном цикле разработки внутренних...", "salary": 0}, {"name": "Python developer (Middle\\Senior)", "url": "https://hh.ru/vacancy/109069018", "requirement": "Опыт в разработке коммерческих продуктов на Python от 4 лет. Опыт разработки сервисов с 0. Хорошее знание хотя бы одним...", "responsibility": "Реализация бэкенд логики и архитектуры сервисов. Интеграции со сторонними продуктами и инфраструктурой заказчика. Участие в планировании реализации проектов, проработка технических...", "salary": 0}, {"name": "Senior\\middle+ Python developer", "url": "https://hh.ru/vacancy/109085394", "requirement": "Для этого необходимо иметь опыт: - От 2 лет коммерческого опыта на Python. - Опыт работы с FastAPI (обязательно) . - Понимание алгоритмов и...", "responsibility": "Основные задачи находятся в банковской и страховой области и связаны с расчетом финансовых и рисковых показателей, например, прогноз актуарных потоков...", "salary": 0}, {"name": "Python разработчик", "url": "https://hh.ru/vacancy/109525630", "requirement": "Отличное знание Python 3 и опыт промышленной разработки на Python от трех лет. Опыт многопоточного и асинхронного программирования. ", "responsibility": "Проектирование компонентов систем. Организация процесса разработки. Написание и ревью кода. Написание тестов на свой код. Наставление менее опытных коллег.", "salary": 0}, {"name": "Python Developer", "url": "https://hh.ru/vacancy/107620766", "requirement": "Высшее техническое образование. Опыт работы разработчиком от 5 лет. Отличное знание Python и PostgreSQL. Умение писать запросы не только через...", "responsibility": "Проектирование и разработка сервисов. Контроль качества кода, проведение code-review. Оценка задач и участие в планировании работ. Участие в разработке...", "salary": 0}, {"name": "Python-разработчик BackEnd", "url": "https://hh.ru/vacancy/109151449", "requirement": "Опыт разработки серверных приложений на языке Python3.8, Python3.11. Опыт работы с ORM SQL Alchemy, опыт работы...", "responsibility": "Компания Ларикс – дочернее подразделении компании Айбим — разработчик программного обеспечения и поставщик IT технологий для автоматизации процессов строительства.", "salary": 200000}, {"name": "Python разработчик", "url": "https://hh.ru/vacancy/109573615", "requirement": "Опыт коммерческой разработки на Python. Навыки работы с реляционными и нереляционными базами данных. Опыт работы с pytest. Знание классических алгоритмов. ", "responsibility": "Участвовать в разработке и планировании архитектурных решений. Создавать и поддерживать программные компоненты и микросервисы. Вносить вклад в организацию и оценку...", "salary": 400000}, {"name": "Python-разработчик (Middle-Senior) по работе с данными", "url": "https://hh.ru/vacancy/110198132", "requirement": "Опыт parsing/web-scraping (selenium, requests, bs4) от 2х лет. Опыт работы с базами данных PostgreSQL/MySQL. ", "responsibility": "Разработка и оптимизация пайплайна для сбора, обработки данных из различных источников. Программирование нестандартных парсеров, администрирование и поддержка уже написанных. ", "salary": 0}, {"name": "Python разработчик", "url": "https://hh.ru/vacancy/111060492", "requirement": "Знание хотя языка программирования Python на хорошем уровне: опыт в области продуктовой разработки от 3 лет, есть примеры проектов или...", "responsibility": "Написание backend кода. Разработка новых микросервисов. Развитие инструментов Качества данных и Каталог данных. Участие в проектах с реальной ценностью для...", "salary": 0}, {"name": "Разработчик Python / Python Developer", "url": "https://hh.ru/vacancy/107464669", "requirement": "Уверенные знания языка программирования Python. Опыт коммерческой разработки клиент-серверных приложений от 3-х лет. Опыт работы с FastAPI, SQLAlchemy...", "responsibility": "Разработкой API, связывающего между собой сервисы. Написанием ETL-процессов. Участием в проектировании системы и разборе новых задач.", "salary": 0}, {"name": "Python Developer", "url": "https://hh.ru/vacancy/108056348", "requirement": "Промышленная разработка Python, Django от двух лет. Глубокие знания и понимание возможностей Python, Django. Уверенные знания Django REST framework, Docker...", "responsibility": "Разработка новой функциональности для бизнес-задач. Поддержка, развитие, оптимизации текущей функциональности. Участие в разработке общепроектных инструментов и пакетов.", "salary": 0}, {"name": "Python разработчик", "url": "https://hh.ru/vacancy/94747236", "requirement": "Отличное знание Python 3 и опыт промышленной разработки на Python от трех лет. Опыт многопоточного и асинхронного программирования. ", "responsibility": "Проектирование компонентов систем. Организация процесса разработки. Написание и ревью кода. Написание тестов на свой код. Наставление менее опытных коллег.", "salary": 0}, {"name": "Python developer (ML-сервисы)", "url": "https://hh.ru/vacancy/106136258", "requirement": "Опыт профессиональной разработки на Python 3 в контексте разработки ML-сервисов. Глубокие знания и опыт работы с PyTorch. ", "responsibility": "Улучшение текущей архитектуры решения в контексте автоматического обучения DL-моделей на данных пользователей. Оптимизация инференса DL-моделей в высоконагруженной среде...", "salary": 0}, {"name": "Python разработчик гиперконвергентной инфраструктуры", "url": "https://hh.ru/vacancy/108141808", "requirement": null, "responsibility": "Разработка нового функционала распределенного вычислительного кластера, в частности связанного с живой миграцией ВМ, балансировкой нагрузки, сервисами высокой доступности, VDI, распределенным...", "salary": 0}, {"name": "Low-code developer", "url": "https://hh.ru/vacancy/108405784", "requirement": "Средне специальное/высшее техническое образование. Опыт работы с Python, JavaScript. Теоретическое понимание ООП, базовых паттернов проектирования, принципов работы с базами...", "responsibility": "Создание low-code приложения на основании собственной low-code платформы. Участие в проектировании бизнес- логики low-code приложений. ", "salary": 0}, {"name": "Middle Python-разработчик", "url": "https://hh.ru/vacancy/110417383", "requirement": "Python: FastAPI / Flask / Django. RESTful API. Postgres / Redis / Oracle. Elastic, kafka. Kubernetes, Docker. Опыт коммерческой разработки от 3х лет. ", "responsibility": "Разработка и поддержка backend приложений. Проектирование и реализация RESTful API для взаимодействия с фронтендом. Работа с базами данных. ", "salary": 0}, {"name": "Python-разработчик", "url": "https://hh.ru/vacancy/107196286", "requirement": "Знание Python 3.8+, asyncio (async/await). Опыт работы с SQL (Oracle/PostgreSQL), ORM (SQLAlchemy). Знание Git. ", "responsibility": "Разработка нового десктоп продукта в команде. Участие в принятии технических решений и планировании процесса разработки. Взаимодействие с разработчиками смежных отделов. ", "salary": 180000}, {"name": "Python разработчик middle", "url": "https://hh.ru/vacancy/109151480", "requirement": "Помогать менее опытным коллегам и организовывать работу. Непрерывно обучаться, совершенствовать свои знания и навыки. Отличное знание Python 3. ", "responsibility": "Проектировать и разрабатывать компоненты систем. Решать нестандартные задачи. Проводить code review. Выпускать релизы. Прорабатывать задачи (валидация тз) с аналитиками. ", "salary": 120000}, {"name": "Middle+/Senior Python Developer", "url": "https://hh.ru/vacancy/111069563", "requirement": "Практический коммерческий опыт разработки на Python от 4 лет. - Опыт и знание Django, DRF. - Опыт работы с брокером очередей Celery. - ", "responsibility": "Работа с легаси и разработка нового кода. - Проведение код ревью. - Контроль реализации командами разработки кода, на соответствие принятым стандартам и...", "salary": 400000}, {"name": "Senior Data аналитик", "url": "https://hh.ru/vacancy/110965222", "requirement": "Есть опыт работы аналитиком данных от 3 лет. Знаешь SQL, умеешь оптимизировать запросы, разбираешься в математической статистике и умеешь применять...", "responsibility": "Участвовать в планировании ключевых показателей и бюджетов на год или квартал. Вместе с лидерами процессов или команд предлагать идеи по...", "salary": 450000}, {"name": "Python-разработчик", "url": "https://hh.ru/vacancy/109238578", "requirement": "Опыт разработки на Python от 3 лет. Знание классических алгоритмов и структур данных. Знание принципов unit-тестирования, опыт написания тестов...", "responsibility": "Разработка компонентов управления сервисами облачного направления. Участие в R&D. Поддержка кодовой базы. Исправление багов и рефакторинг. Участие в разработке...", "salary": 0}, {"name": "Senior Python Developer", "url": "https://hh.ru/vacancy/110994019", "requirement": "Опыт коммерческой разработки на Python от 3-х лет. Владение одним из асинхронных фреймворком: FastAPI, AioHttp. Опыт работы с asyncio...", "responsibility": "Этапы отбора: Анкета. Первичное интервью. Техническое интервью. Оффер.", "salary": 0}, {"name": "Lead Python Developer", "url": "https://hh.ru/vacancy/109565732", "requirement": "От 5 лет коммерческой разработки на Python.", "responsibility": "Проведение собеседований. Участие в выборе архитектурных решений. Участие в распределение нагрузки между разработчиками в команде. Проведение 1-1. Код ревью. ", "salary": 0}, {"name": "Senior Python Developer", "url": "https://hh.ru/vacancy/109644627", "requirement": "Уверенное знание Python (Django/FastAPI). - Понимание работы современных веб-сервисов. - Умение писать эффективный и понятный код, покрытый тестами. - ", "responsibility": "Внедрение решений на любом уровне (участие в полном цикле разработки внутренних продуктов — создание крупных отказоустойчивых систем, проектирование архитектуры, разработка MVP...", "salary": 0}, {"name": "Python разработчик", "url": "https://hh.ru/vacancy/109524133", "requirement": "Отличное знание Python 3 и опыт промышленной разработки на Python от трех лет. Опыт многопоточного и асинхронного программирования. ", "responsibility": "Проектирование компонентов систем. Организация процесса разработки. Написание и ревью кода. Написание тестов на свой код. Наставление менее опытных коллег.", "salary": 0}, {"name": "Middle Python Developer", "url": "https://hh.ru/vacancy/109724506", "requirement": "Высшее техническое образование (в области компьютерных наук, информационных технологий или смежных областях, дополнительные курсы и сертификации в области Python-разработки...", "responsibility": "Разработка, тестирование и поддержка backend-систем на Python. Участие в проектировании архитектуры приложений. Оптимизация производительности существующих систем. Интеграция с внешними...", "salary": 0}, {"name": "Teamlead Python developer", "url": "https://hh.ru/vacancy/105911296", "requirement": "Уверенное владение Python (ver 3+). Опыт разработки веб-приложений на популярных фреймворках. Понимание принципов работы клиент-серверных web-приложений. ", "responsibility": "Командная web-разработка. Технологический стек: python, PostgreSQL, Git. Разработка, code review, рефакторинг кода. Сопровождение и документирование написанного кода. ", "salary": 0}, {"name": "Python-разработчик", "url": "https://hh.ru/vacancy/109239169", "requirement": "Высшее образование. Опыт работы в области информационных технологий не менее 3-х лет. Знание: Oracle PL/SQL, Python, Pandas, NumPY...", "responsibility": "Создание и поддержка комплекса информационных ресурсов и баз данных. Мониторинг и анализ рынка информационных источников. Обработка данных, исследовательский анализ данных...", "salary": 0}, {"name": "Senior Python разработчик", "url": "https://hh.ru/vacancy/110746722", "requirement": "Практический коммерческий опыт разработки на Python от 4 лет. Опыт работы с брокером очередей RabbitMQ. Опыт работы с системами управления...", "responsibility": "Контроль реализации командами разработки исходного кода, на соответствие принятым стандартам и архитектуры системы в целом. Участие в ревью вывода новых...", "salary": 0}, {"name": "Python-разработчик", "url": "https://hh.ru/vacancy/109236913", "requirement": "Опыт проектирования и реализации крупных enterprise-систем. Умение выбирать архитектурные шаблоны, паттерны проектирования. Опыт разработки на Python 3+ лет. ", "responsibility": "Разработка архитектуры нового продукта. Разработка сервиса, ежедневно используемого в проде инженерами и архитекторами для решения задач развития и поддержания IT...", "salary": 0}, {"name": "Python разработчик", "url": "https://hh.ru/vacancy/109232832", "requirement": "Не менее 2 лет опыта в должности разработчика backend на языке Python. Практический опыт и знания фреймворков Django, Django ORM...", "responsibility": "Участвовать в разработке крутого инструмента. Разработка и тестирование нового функционала. Оформление документации по разработанным функциям/фичам. Взаимодействовать с коллегами: как...", "salary": 0}, {"name": "Python Developer (Voice360)", "url": "https://hh.ru/vacancy/110132157", "requirement": "Опыт работы c Python и git от 3-ех лет. Знание фреймворка django (в т.ч. с применением REST API). ", "responsibility": "Разработка back-end на python для веб-портала. Поддержка работоспособности ПРОМ.", "salary": 0}, {"name": "Python Developer", "url": "https://hh.ru/vacancy/110264487", "requirement": "Опыт работы с Python от 2 лет. Опыт работы с фреймворками, такими как Django, FastApi. Опыт работы как с реляционными...", "responsibility": "Разработка высококачественного программного обеспечения на Python. Участие в проектировании архитектуры приложений и выборе технологических решений. Оптимизация и поддержка существующего кода. ", "salary": 350000}, {"name": "Senior Python developer удаленно", "url": "https://hh.ru/vacancy/110797541", "requirement": "Опыт разработки Backend приложений(Python 3.>) от 3 лет. Уверенное владение базовыми архитектурными паттернами. Понимание асинхронной парадигмы программирования. ", "responsibility": "Участие в развитии десктопного приложения AMQPUtil. Проектирование и разработка платформы для оптимизации и ускорения написание интеграционных приложений на шине RHAMQ...", "salary": 0}, {"name": "Python-разработчик", "url": "https://hh.ru/vacancy/107082542", "requirement": "Опыт коммерческой разработки от 1 года. Уверенное программирование на Python или других скриптовых языках с желанием мигрировать на Python. ", "responsibility": "Мы в поиске грамотного <highlighttext>python</highlighttext>-<highlighttext>разработчика</highlighttext>, в отдел Кастомизации приложений. Эта команда входит в трек, изменяющий внутреннюю архитектуру всей системы...", "salary": 250000}, {"name": "Python-разработчик (блок \"Сеть продаж\")", "url": "https://hh.ru/vacancy/109467292", "requirement": "Уметь писать хороший и понятный код. Опыт промышленной разработки на python от 2-ух лет. Хорошее знание алгоритмов, структур данных...", "responsibility": "CoPilot и виртуальный ассистент сотрудника – позволяет быстро найти ответ на неизвестный и сложный вопрос, сейчас работаем над проактивными подсказками сотрудника...", "salary": 0}, {"name": "Python разработчик", "url": "https://hh.ru/vacancy/108428932", "requirement": "33 года опыта IT экспертизы. 20 городов присутствия по России. Более 2200 сотрудников. Более 200 предоставляемых сервисов. Имеете не менее...", "responsibility": "Участвовать в создании крупного российского решения для металлургии(импортозамещение), которое обеспечит потребности бизнеса в управлении производством. Разрабатывать алгоритмы по работе...", "salary": 0}, {"name": "Python developer", "url": "https://hh.ru/vacancy/109472859", "requirement": "Опыт коммерческой разработки от 3-х лет. Уверенное программирование на Python или других скриптовых языках с последующей миграцией на Python. ", "responsibility": "Разработка — 70% времени. Ревью кода — 20% времени. Контроль сроков — 10% времени. Общение с крутыми людьми – 100% времени!", "salary": 140000}, {"name": "Python-разработчик (Middle)", "url": "https://hh.ru/vacancy/108236440", "requirement": "Опыт работы в роли <highlighttext>python</highlighttext> <highlighttext>разработчика</highlighttext> от двух лет. Опыт работы с библиотеками pandas, Pydantic, SQLAlchemy. Понимание PEP8. ", "responsibility": "Разработка ETL процессов на Python (Apache Airflow). Написание тестов. Проведение код-ревью. Обучение младших коллег. Участие в разработке сервисов для...", "salary": 0}, {"name": "Python-разработчик", "url": "https://hh.ru/vacancy/105758050", "requirement": "Отличное знание Python 3 и опыт промышленной разработки на Python от трех лет. Опыт многопоточного и асинхронного программирования. ", "responsibility": "Проектирование компонентов систем. Организация процесса разработки. Написание и ревью кода. Написание тестов на свой код. Наставление менее опытных коллег.", "salary": 0}, {"name": "Python Fullstack Developer (Junior)", "url": "https://hh.ru/vacancy/109532728", "requirement": "Уверенные знания Python 3.12 (в т.ч. таких библиотек, как: Pandas, Matplotlib, SQLAlchemy). Опыт работы с DashPlotly. ", "responsibility": "Разработкой и поддержкой интерактивных отчетов для контроля ключевых показателей бизнеса. Взаимодействием с другими подразделениями компании. Подготовкой инструкций и консультированием конечных...", "salary": 75000}, {"name": "Python developer", "url": "https://hh.ru/vacancy/107356689", "requirement": "Опыт коммерческой разработки на Python от 4 лет. Владение хотя бы одним из фреймворков: AioHttp, Sanic, FastApi, Starlette, Django, Flask...", "responsibility": "Разработка и оптимизация программного кода в проекте. Блокировка Иноагентов. Исправление ошибок в коде. Разработка запросов к БД. Написание тестовых сценариев...", "salary": 0}, {"name": "Python Developer", "url": "https://hh.ru/vacancy/110444989", "requirement": "Знание особенностей реализации различных алгоритмов и структур данных. Опыт работы по специальности от 3 лет. Опыт работы в команде. ", "responsibility": "Реализация серверной части веб-приложений, связанных с обработкой и отображением больших данных. Анализ и оптимизация производительности. Участие в разработке архитектуры...", "salary": 0}, {"name": "Middle Python developer", "url": "https://hh.ru/vacancy/72687504", "requirement": "Уверенное знание Python3 (asyncio, typing, threading). Опыт использования сoncurrent computing, применения примитивов синхронизации. Умения использования парадигмы ООП и шаблонов...", "responsibility": "Написание чистого, понятного кода. Ведение (исправление багов, модернизация, улучшение) разработанного микросервиса.", "salary": 200000}, {"name": "Python-разработчик в Толк, Middle+", "url": "https://hh.ru/vacancy/110420660", "requirement": "Опыт работы с брокерами сообщений (предпочтительно Kafka). Опыт участия в разработке распределенных систем. Знание подходов CI/CD и их реализации...", "responsibility": "Один из наших продуктов — Контур.Толк, это облачное пространство для проведения аудио- и видеоконференций с возможностью записи, планированием встреч, интеграцией с...", "salary": 0}, {"name": "Python-разработчик в Толк, Middle+", "url": "https://hh.ru/vacancy/110420663", "requirement": "Опыт работы с брокерами сообщений (предпочтительно Kafka). Опыт участия в разработке распределенных систем. Знание подходов CI/CD и их реализации...", "responsibility": "Один из наших продуктов — Контур.Толк, это облачное пространство для проведения аудио- и видеоконференций с возможностью записи, планированием встреч, интеграцией с...", "salary": 0}, {"name": "Python-разработчик в команду Биллинговой платформы", "url": "https://hh.ru/vacancy/110132989", "requirement": "Коммерческий опыт разработки на Python >3.7, знание экосистемы, популярных библиотек и фреймворков. Опыт работы с PostgreSQL: умение строить и...", "responsibility": "Разрабатывать модули биллинговой системы (например: модуль учета услуг и их цен, модуль скидок, обработка входящих платежей). Проектировать и развивать функционал...", "salary": 0}, {"name": "SQL- разработчик", "url": "https://hh.ru/vacancy/110653652", "requirement": "Опыт работы в роли <highlighttext>Python</highlighttext> <highlighttext>Developer</highlighttext> от 4-х лет. Опыт работы с Docker, GitLab CI, OpenShift либо Kubernetes, nginx. ", "responsibility": "Исправлять ошибки в коде. Разрабатывать запросы к БД. Писать тестовые сценарии для проверке разработанного кода.", "salary": 120000}, {"name": "Python-разработчик", "url": "https://hh.ru/vacancy/109071579", "requirement": "Уверенное владение Python 3. Понимание асинхронного программирования. Опыт работы с HTTP, Rest API, JSON. Опыт работы с микрофреймворками (преимущественно Flask...", "responsibility": "Участие в разработке роботизированных систем. Ведение технической документации. Плотное взаимодействие со всеми специалистами проекта. Интеграция сторонних систем в проект, посредством...", "salary": 200000}, {"name": "Python разработчик", "url": "https://hh.ru/vacancy/110130589", "requirement": "Опыт коммерческой разработки от 2-х лет. Уверенное программирование на Python или других скриптовых языках с желанием мигрировать на Python. ", "responsibility": "Presto- команда, развивающая ресторанный бизнес. Saby CRM и телефония. Складские документы и госсистемы.", "salary": 250000}, {"name": "Python разработчик на платформу контейнерной оркестрации", "url": "https://hh.ru/vacancy/109290876", "requirement": "3+ лет опыта разработки на Python. Опыт работы с Kubernetes, понимание работы Kubernetes API и механизмов его расширения (CRD...", "responsibility": "Участвовать в разработке платформы контейнерной оркестрации на базе Kubernetes. Участвовать в проектировании и создании API. Проводить code-review. ", "salary": 0}, {"name": "Middle+ Python Developer [Инновации]", "url": "https://hh.ru/vacancy/109128117", "requirement": "Python (FastAPI) от 2х лет. Asyncio, aiohttp. Опыт построения и тестирования парсеров с использованием playwright/scrappy/bs/selenium. ", "responsibility": "Разрабатывать микросервисы для использования в ETL/ELT и ML pipeline'ах. Писать парсеры внешних источников данных и их сервсиной обвязки...", "salary": 0}, {"name": "IT Recruiter/InfoSec Recruiter", "url": "https://hh.ru/vacancy/110199758", "requirement": null, "responsibility": "Своя инфраструктура, автоматизация внутренних процессов организации работы, а так же блоков сопровождения и поддержки. Проводить HR-интервью и сопровождать кандидата...", "salary": 0}, {"name": "Python-разработчик", "url": "https://hh.ru/vacancy/94052398", "requirement": "Уверенно знаешь Python, ООП, шаблоны проектирования. - Имеешь опыт использования реляционных СУБД (MySQL, Postgre SQL, SQL Server, Oracle). - Имеешь практический опыт...", "responsibility": "ISERV в поисках <highlighttext>Python</highlighttext> – <highlighttext>разработчика</highlighttext>. - Разработка серверной части проекта на языке Python. - Доработка, отладка и оптимизация существующих программ. - ", "salary": 0}, {"name": "ML-Python developer", "url": "https://hh.ru/vacancy/109878025", "requirement": "Опыт работы более 2х лет в качестве разработчика Python. Знание и опыт работы с Docker, Git. Внимательность. ", "responsibility": "Заниматься разработкой продуктов и проектов в области машинного зрения.", "salary": 0}, {"name": "Python developer", "url": "https://hh.ru/vacancy/109472415", "requirement": "Опыт коммерческой разработки от 3-х лет. Уверенное программирование на Python или других скриптовых языках с последующей миграцией на Python. ", "responsibility": "Разработка — 70% времени. Ревью кода — 20% времени. Контроль сроков — 10% времени. Общение с крутыми людьми – 100% времени!", "salary": 140000}, {"name": "Python разработчик", "url": "https://hh.ru/vacancy/109966487", "requirement": "Опыт коммерческой разработки на Python от 2-х лет. Отличное знание Python и FastAPI. Опыт работы с Docker и PostgreSQL. ", "responsibility": "Разрабатывать и поддерживать backend-часть приложения на FastAPI. Интегрировать и работать с языковыми моделями GPT. Оптимизировать и поддерживать базу данных...", "salary": 290000}, {"name": "SQL- разработчик", "url": "https://hh.ru/vacancy/110653657", "requirement": "Опыт работы в роли <highlighttext>Python</highlighttext> <highlighttext>Developer</highlighttext> от 4-х лет. Опыт работы с Docker, GitLab CI, OpenShift либо Kubernetes, nginx. ", "responsibility": "Исправлять ошибки в коде. Разрабатывать запросы к БД. Писать тестовые сценарии для проверке разработанного кода.", "salary": 120000}, {"name": "Python разработчик", "url": "https://hh.ru/vacancy/102742641", "requirement": "Опыт работы по направлению не менее 1 года. Высшее образование. Знание языка программирования Python: понимание синтаксиса, стандартной библиотеки и основных...", "responsibility": "Разработка, поддержка и администрирование ботов-помощников для сотрудников. Ведение проекта по внедрению ботов (сбор и анализ данных, работа в команде...", "salary": 0}, {"name": "Tech lead Senior Python developer, релокация в Дубай", "url": "https://hh.ru/vacancy/109077786", "requirement": "Опыт коммерческой разработки от 5 лет. Умение писать и оптимизировать сложные запросы будет большим плюсом. Отличное владение Python, РСУБД (PostgreSQL...", "responsibility": "Участие в разработке архитектуры веб-приложений. Проектирование и разработка архитектуры модулей продукта. Масштабирование архитектуры проекта по мере роста нагрузки и...", "salary": 8000}, {"name": "Fullstack-разработчик (Python-разработчик)", "url": "https://hh.ru/vacancy/110953836", "requirement": "Какие знания и навыки нам важны: Знание одного из языков: backend .NET/Java/Python; frontend JavaScript. Опыт работы с Spring...", "responsibility": "Разрабатывать ПО по заказу отделов Цифровой академии для повышения качества и скорости их работы. Поддерживать и адаптировать ПО под новые...", "salary": 0}, {"name": "Middle Python Developer", "url": "https://hh.ru/vacancy/109468810", "requirement": "Отличное знание Python 3, опыт использования от трех лет. Опыт использования FastAPI и SQLAlchemy >= 2.0. Знание SQL (PostgreSQL), опыт...", "responsibility": "Разработка backend приложений и покрытие их unit-тестами. Документирование кода. Проектирование структуры БД, написание и оптимизация запросов. Реализация интеграций с...", "salary": 180000}, {"name": "Python-разработчик в Толк, Middle+", "url": "https://hh.ru/vacancy/110420659", "requirement": "Опыт работы с брокерами сообщений (предпочтительно Kafka). Опыт участия в разработке распределенных систем. Знание подходов CI/CD и их реализации...", "responsibility": "Один из наших продуктов — Контур.Толк, это облачное пространство для проведения аудио- и видеоконференций с возможностью записи, планированием встреч, интеграцией с...", "salary": 0}, {"name": "Python-разработчик в Толк, Middle+", "url": "https://hh.ru/vacancy/110420666", "requirement": "Опыт работы с брокерами сообщений (предпочтительно Kafka). Опыт участия в разработке распределенных систем. Знание подходов CI/CD и их реализации...", "responsibility": "Один из наших продуктов — Контур.Толк, это облачное пространство для проведения аудио- и видеоконференций с возможностью записи, планированием встреч, интеграцией с...", "salary": 0}, {"name": "Python разработчик во внутреннюю разработку", "url": "https://hh.ru/vacancy/109231513", "requirement": "Широкий технический кругозор и техническое образование. Знание и опыт работы с Python (Fast API), Bash (на уровне прикладного разработчика) от...", "responsibility": "Разработкой новой функциональности в части backend. Разработкой структур данных и хранимых процедур в PostgreSQL. Проведением код-ревью. Интеграциями сторонних сервисов...", "salary": 0}, {"name": "Python developer (middle)", "url": "https://hh.ru/vacancy/107778129", "requirement": "Аналогичный опыт от 2-х лет, рассматриваем кандидатов уровня middle. Стек: Python 3, FastAPI, Docker, Kuber, Mongodb, Postgres. ", "responsibility": "Разработка веб-сервисов. Рефакторинг и оптимизация архитектуры приложений, кода, баз данных. Написание тестов. Участие в анализе требований и планировании архитектуры.", "salary": 0}, {"name": "Python-разработчик/алгоритмист", "url": "https://hh.ru/vacancy/107952335", "requirement": "Высшее инженерное или техническое образование (неоконченное высшее (в том числе студенты 3-6 курсов). Знание операционной системы семейства Linux (предпочтительно...", "responsibility": "Разработка пакета алгоритмических решений для реализации цифровой обработки сигналов, протоколов связи. Разработка математических моделей принципов работы радиоэлектронных средств. ", "salary": 160000}, {"name": "Fullstack-разработчик (Strong junior/Middle)", "url": "https://hh.ru/vacancy/108989403", "requirement": "1) 2+ года разработки. 2) Опыт в веб-разработке. 3) Понимание что такое апи и как с ним взаимодействовать. ", "responsibility": "1) Написание системы прослеживаемости для огромного производства по переработке продукции. 2) Система автоматизации работы с 1С. 1) Написание веб...", "salary": 250000}, {"name": "Python-developer", "url": "https://hh.ru/vacancy/109851491", "requirement": "Не менее 2 лет опыта в должности разработчика backend на языке Python. Практический опыт и знания фреймворков Django, Django ORM...", "responsibility": "Участвовать в разработке крутого инструмента. Разрабатывать и тестировать новый функционал. Оформлять документации по разработанным функциям/фичам. Взаимодействовать с коллегами: как...", "salary": 0}, {"name": "Senior/Lead Python developer", "url": "https://hh.ru/vacancy/108475748", "requirement": "Опыт работы на позиции тимлида или старшего разработчика (Senior <highlighttext>Python</highlighttext> <highlighttext>Developer</highlighttext>) от 2 лет. Глубокие знания Python и опыт разработки...", "responsibility": "Формирование и руководство командой разработки: участие в подборе специалистов, наставничество, поддержка профессионального роста. Организация и координация работы команды для выполнения...", "salary": 0}, {"name": "Python developer (Senior)", "url": "https://hh.ru/vacancy/110810130", "requirement": "Опытного разработчика, который может писать асинхронный код на Python и хочет работать с большим объемом данных. Навыки, которые необходимы для...", "responsibility": "Организация работы в команде. Разработка архитектуры ПО и БД. Создание и сопровождение высоконагруженных многопоточных приложений на Python. Работа с микросервисной...", "salary": 0}, {"name": "Python-разработчик", "url": "https://hh.ru/vacancy/108931575", "requirement": "1+ years of practical experience in building web-backends in Python (or good knowledge of Python3 and 1...", "responsibility": "Для работы с проектом голосовых технологий мы в поиске <highlighttext>Python</highlighttext>-<highlighttext>developer</highlighttext>: In this position you will be engaged in the...", "salary": 0}, {"name": "Python-разработчик", "url": "https://hh.ru/vacancy/109759351", "requirement": "Глубокое знание Python: Отличное владение языком и его стандартными библиотеками. Опыт написания чистого, оптимизированного и поддерживаемого кода. Опыт работы с...", "responsibility": "API и интеграции: Создание и использование RESTful API. Работа в аккредитованной ИТ-компании. Работа в команде, использующей гибкий подход к...", "salary": 0}, {"name": "Python-разработчик", "url": "https://hh.ru/vacancy/109053805", "requirement": "Опыт работы с Django и разработкой API (REST API). —Знание Odoo или опыт работы с ERP-системами. —Опыт работы с...", "responsibility": "Адаптация и разработка API для внутреннего портала на Django. —Интеграция системы с кадровыми системами (добавление и управление пользователями). —", "salary": 0}, {"name": "Middle Python Developer (ECM)", "url": "https://hh.ru/vacancy/109128938", "requirement": "Python 3.9/3.11, PyTest, FastAPI, Django (DRF) , SQLAlchemy, SQL, Pydantic. Docker, ks8, ci/cd gitlab. PostgreSQL, Airflow. ", "responsibility": "Разработка решений для работы продукта. Оптимизация архитектурных решений в коде. Оптимизация и улучшение работы продукта.", "salary": 0}, {"name": "Middle Python разработчик (удаленно)", "url": "https://hh.ru/vacancy/107997171", "requirement": "Более 2-х лет коммерческого опыта разработки веб-сервисов. Знания и опыт работы с FastAPI, MongoDB, Gitlab. Понимание цикла разработки...", "responsibility": "Реализация нового функционала. Работа с инетеграцией различных сервисов. Участвовать в код-ревью, делиться опытом лучших решений. Улучшать производительность и доступность...", "salary": 170000}, {"name": "Python - разработчик", "url": "https://hh.ru/vacancy/109199748", "requirement": "Знаешь Python 3 и имеешь опыт промышленной разработки на Python от трех лет. Есть опыт многопоточного и асинхронного программирования. ", "responsibility": "Проектировать компоненты систем. Организовывать процесс разработки. Писать и ревьюить код. Наставлять менее опытных коллег.", "salary": 0}, {"name": "Python разработчик", "url": "https://hh.ru/vacancy/109201400", "requirement": "Отличное знание Python 3 и опыт промышленной разработки на Python от трех лет. Опыт многопоточного и асинхронного программирования. ", "responsibility": "Проектирование компонентов систем. Организация процесса разработки. Написание и ревью кода. Написание тестов на свой код. Наставление менее опытных коллег.", "salary": 0}, {"name": "Старший разработчик Python, Группа разработки инструментов визуализации данных", "url": "https://hh.ru/vacancy/111232685", "requirement": "Опыт работы с Python и популярными web фреймворками (Django, Flask, FastApi) от 3 лет. Опыт работы с Pytest. ", "responsibility": "Разработка сервисов на Python. Разработка helm. Развитие Observability. Проведение ревью кода. Документирование разрабатываемых решений.", "salary": 0}, {"name": "Middle/Senior Python developer", "url": "https://hh.ru/vacancy/106523557", "requirement": "Разрабатывали на Python от 4-х лет. Работали с используемым нами стеком. Имеете опыт построения микросервисной архитектуры. Хорошо понимаете паттерны...", "responsibility": "Проектирование архитектуры и участие в выборе необходимых технологий. Внедрение лучших практик разработки, оптимизация и развитие существующих процессов. Написание качественного и...", "salary": 0}, {"name": "Senior Python разработчик", "url": "https://hh.ru/vacancy/109538592", "requirement": "Уверенное знание Python и его фреймворков FastAPI. Умение писать эффективный и понятный код, способность аргументировать свои решения и договариваться с...", "responsibility": "Реализовывать высоко нагруженные и производительные сервисы на Python. Разрабатывать и нести ответственность за архитектуру решения. Оценивать задачи и планировать спринты. ", "salary": 0}, {"name": "Python developer (Senior)", "url": "https://hh.ru/vacancy/107791619", "requirement": "Опыт разработки Backend приложений (Python 3.>) от 5 лет. Уверенное владение базовыми архитектурными паттернами. Понимание асинхронной парадигмы программирования. ", "responsibility": "Интеграционные приложения (docker_compose, vault, SQLAlchemy, pydantic, lxml, pytest). Автогенерация документации (jinja, atlassian). Задачи: Участие в развитии десктопного приложения AMQPUtil. ", "salary": 0}, {"name": "SQL- разработчик", "url": "https://hh.ru/vacancy/110653656", "requirement": "Опыт работы в роли <highlighttext>Python</highlighttext> <highlighttext>Developer</highlighttext> от 4-х лет. Опыт работы с Docker, GitLab CI, OpenShift либо Kubernetes, nginx. ", "responsibility": "Исправлять ошибки в коде. Разрабатывать запросы к БД. Писать тестовые сценарии для проверке разработанного кода.", "salary": 120000}, {"name": "Senior Python разработчик (RuPost)", "url": "https://hh.ru/vacancy/111048040", "requirement": "Опыт коммерческой разработки от 5-х лет. Опыт продуктовой разработки от 2-х лет. Хорошее знание Python 3.8+...", "responsibility": "Разработка системы управления распределенными программными компонентами под управлением Linux. Разработка технической документации. Код-ревью и тестирование изменений. Решение архитектурных вопросов.", "salary": 0}, {"name": "Python Developer in OAM/NMS", "url": "https://hh.ru/vacancy/111227960", "requirement": "Уверенное владение Python, pytest. Необходимо быть знакомым с классическими алгоритмами и структурами данных. Умение тестировать собственный код. Опыт написания многопоточных...", "responsibility": "Разработка и оптимизация модуля генерации файлов (JSON, XML, CPP, YANG и др.) на основе существующей информационной модели. Добавление автоматизированных правил...", "salary": 0}, {"name": "Разработчик Python", "url": "https://hh.ru/vacancy/105501108", "requirement": "Навык работы с SQL/NoSQL базами данных (PostgreSQL, MongoDB), а так же написания raw запросов для них. Понимание того, как...", "responsibility": null, "salary": 180000}, {"name": "Backend Developer (Python)", "url": "https://hh.ru/vacancy/109618283", "requirement": "Английский язык. Опыт работы 3+ года. Образование высшее/незаконченное высшее, желательно технический ВУЗ. Опыт работы с технической документацией (чтение...", "responsibility": "Разработка новых решений на базе LLM. Интеграция с другими системами и сервисами компании. Повышение производительности, качества и безопасности сервисов на...", "salary": 0}, {"name": "Python-разработчик", "url": "https://hh.ru/vacancy/105982722", "requirement": "Отличное знание Python 3 и опыт промышленной разработки на Python от трех лет. Опыт многопоточного и асинхронного программирования. ", "responsibility": "Проектирование компонентов систем. Организация процесса разработки. Написание и ревью кода. Написание тестов на свой код. Наставление менее опытных коллег.", "salary": 0}, {"name": "Python разработчик", "url": "https://hh.ru/vacancy/109114171", "requirement": "Отличное знание Python 3 и опыт промышленной разработки на Python от трех лет. Опыт многопоточного и асинхронного программирования. ", "responsibility": "Проектирование компонентов систем. Организация процесса разработки. Написание и ревью кода. Написание тестов на свой код. Наставление менее опытных коллег.", "salary": 0}, {"name": "Python разработчик", "url": "https://hh.ru/vacancy/109524122", "requirement": "Отличное знание Python 3 и опыт промышленной разработки на Python от трех лет. Опыт многопоточного и асинхронного программирования. ", "responsibility": "Проектирование компонентов систем. Организация процесса разработки. Написание и ревью кода. Написание тестов на свой код. Наставление менее опытных коллег.", "salary": 0}, {"name": "SQL- разработчик", "url": "https://hh.ru/vacancy/110653655", "requirement": "Опыт работы в роли <highlighttext>Python</highlighttext> <highlighttext>Developer</highlighttext> от 4-х лет. Опыт работы с Docker, GitLab CI, OpenShift либо Kubernetes, nginx. ", "responsibility": "Исправлять ошибки в коде. Разрабатывать запросы к БД. Писать тестовые сценарии для проверке разработанного кода.", "salary": 120000}, {"name": "Разработчик Python, ETL/Airflow", "url": "https://hh.ru/vacancy/108612886", "requirement": "Опыт работы в роли <highlighttext>Python</highlighttext> <highlighttext>разработчика</highlighttext> от двух лет. Опыт работы с Airflow. Опыт проектирования и разработки ПО, знание принципов...", "responsibility": "Разработка фреймворка ETL оркестрации. Разработка DevOps процессов (пайплайнов). Разработка процессов загрузки данных из систем источников, процессов архивной и инкрементальной загрузок...", "salary": 0}, {"name": "Python разработчик", "url": "https://hh.ru/vacancy/85489891", "requirement": "Отличное знание Python 3 и опыт промышленной разработки на Python от трех лет. Опыт многопоточного и асинхронного программирования. ", "responsibility": "Проектирование компонентов систем. Организация процесса разработки. Написание и ревью кода. Написание тестов на свой код. Наставление менее опытных коллег.", "salary": 0}, {"name": "Middle Python-разработчик (команда разработки поиска)", "url": "https://hh.ru/vacancy/109465956", "requirement": "Уверенное знание Python 3.9 и выше. Владение асинхронной разработкой на Python. Понимание принципов ООП, основных шаблонов проектирования. ", "responsibility": "Выполнение средних по сложности задач. Умение самостоятельно находить решения без помощи тимлида. Умение находить и предлагать оптимальные решения в существующем...", "salary": 0}, {"name": "Python-разработчик", "url": "https://hh.ru/vacancy/108243676", "requirement": "Отличное знание Python 3 и опыт промышленной разработки на Python от трех лет. Опыт многопоточного и асинхронного программирования. ", "responsibility": "Проектирование компонентов систем. Организация процесса разработки. Написание и ревью кода. Написание тестов на свой код. Наставление менее опытных коллег.", "salary": 0}, {"name": "Middle/Middle+ Python developer", "url": "https://hh.ru/vacancy/108949526", "requirement": "Опыт разработки не менее 2-х лет. - Знания Python. - Знания SQL. - Опыт работы с базами данных, особенно с PostgreSQL. - ", "responsibility": "Анализ бизнес требований, составление технического дизайна решени- Проектирование и разработка архитектуры модулей, сервисов и приложений. - Планирование работ и оценка задач. - ", "salary": 300000}, {"name": "Python разработчик", "url": "https://hh.ru/vacancy/109282261", "requirement": "Образование – математика, информатика, информатика в бизнесе и аналогичные. Хороший уровень Python. Хорошее понимание ООП. Хорошие знания математики (теория вероятностей и...", "responsibility": "Принимать участие в проектах по разработке ИТ-решений для страховых компаний. Быть готовым к различным задачам на стыке математики и...", "salary": 0}, {"name": "Python-разработчик", "url": "https://hh.ru/vacancy/102422415", "requirement": "Имеешь опыт коммерческой разработки от 3-х лет. Уверенно занимаешься программированием на Python или других скриптовых языках с желанием мигрировать...", "responsibility": "Разработка нового ПО для IP-телефонии (Python, Django, PostgreSQL). Техническое сопровождение проектов голосовых роботов (Python, Django, MySQL / PostgreSQL). ", "salary": 0}, {"name": "Python разработчик (ТехноХаб)", "url": "https://hh.ru/vacancy/109228252", "requirement": "Опыт коммерческой разработки на Python от 3 лет. Работа с веб-фреймворками. Работа с ORM. Работа с Docker/Podman. ", "responsibility": "Разработка новой функциональности в рамках существующей системы. Исправление дефектов и адаптация существующей функциональности под изменения требований. Участие в разработке архитектуры...", "salary": 0}, {"name": "Python developer (Middle/Senior)", "url": "https://hh.ru/vacancy/108989349", "requirement": "Код на Gitlab, задачи в Jira, общение в Mattermost. Гибкий подход к разработке с 2-х недельными спринтами. ", "responsibility": "Дорабатывать площадку (сервис) Умскул Репетиторы: (исправлять ошибки в коде, разрабатывать новый функционал, участвовать в обсуждении архитектуры проекта). Интеграция и тестирование...", "salary": 0}, {"name": "Strong Middle Python Developer", "url": "https://hh.ru/vacancy/109555347", "requirement": "Experience: Minimum of 3-5 years of professional experience in <highlighttext>Python</highlighttext> <highlighttext>development</highlighttext>. - Portfolio: Proven track record of successful projects and...", "responsibility": "Software Development: Design, develop, and maintain high-quality Python applications. - Code Review: Conduct thorough code reviews to ensure code quality...", "salary": 15000000}, {"name": "Senior Python разработчик (Django)", "url": "https://hh.ru/vacancy/110906896", "requirement": "Опыт в релевантном стеке от 3 лет (Python 3.9, Django, PostgreSQL, Docker, Kubernetes). Знание разных БД и умение писать...", "responsibility": "Переписывать ключевые компоненты сервиса с серверной шаблонизации на API. Отвечать за реализацию новых фич в паре с frontend-разработчиком, принятие...", "salary": 0}, {"name": "Python Developer в Витрина.Core", "url": "https://hh.ru/vacancy/107045601", "requirement": "Имеете опыт разработки на Python 3.X. Понимаете механику языка Python и сопутствующих инструментов (pytest, mypy, poetry, flake8). ", "responsibility": "Реализовывать стабильные и производительные сервисы на Python (80%) и Golang (20%). Участвовать в проектировании архитектуры, выработке решений по отказоустойчивости и...", "salary": 0}, {"name": "Python разработчик (команда Поддержка продаж ЮЛ)", "url": "https://hh.ru/vacancy/110978116", "requirement": "Уверенное знание Python. Фундаментальные знания в области информационных технологий. Понимание принципов Clean Architecture. Python 3.9+. Redis. RabbitMQ. PostgreSQL. ", "responsibility": "Разработка REST API для внутреннего и внешнего использования. Разработка административных интерфейсов (bpm-система). Разработка автоматизированных тестов (BDD). Документирование разработанного кода. ", "salary": 0}, {"name": "Senior Python developer (GigaChain)", "url": "https://hh.ru/vacancy/110336579", "requirement": "Опыт разработки на Python от 5 лет. Опыт работы с большими языковыми моделями (LLM) и их интеграция в бизнес-решения. ", "responsibility": "Разработка python фреймворка GigaChain и решений на его основе, внедрение новых возможностей GigaChat. Участие в создании и развитии LLM GigaChat. ", "salary": 0}, {"name": "Senior Python developer (GigaChain)", "url": "https://hh.ru/vacancy/110336579", "requirement": "Опыт разработки на Python от 5 лет. Опыт работы с большими языковыми моделями (LLM) и их интеграция в бизнес-решения. ", "responsibility": "Разработка python фреймворка GigaChain и решений на его основе, внедрение новых возможностей GigaChat. Участие в создании и развитии LLM GigaChat. ", "salary": 0}, {"name": "Senior Python Developer [Инновации]", "url": "https://hh.ru/vacancy/108833878", "requirement": "Высшее техническое образование. Опыт работы <highlighttext>Python</highlighttext> <highlighttext>разработчиком</highlighttext> от 4х лет. Уверенное знание Python, а также владение фреймворками: FastAPI, Django. ", "responsibility": "Участвовать в проектировании архитектуры веб-платформы. Разрабатывать и поддерживать внутренние сервисы, в том числе сервисы для взаимодействия с ML моделями. ", "salary": 0}, {"name": "Python-разработчик в Толк, Middle+", "url": "https://hh.ru/vacancy/110420665", "requirement": "Опыт работы с брокерами сообщений (предпочтительно Kafka). Опыт участия в разработке распределенных систем. Знание подходов CI/CD и их реализации...", "responsibility": "Один из наших продуктов — Контур.Толк, это облачное пространство для проведения аудио- и видеоконференций с возможностью записи, планированием встреч, интеграцией с...", "salary": 0}, {"name": "Senior Python Developer", "url": "https://hh.ru/vacancy/110878099", "requirement": "Commercial working experience with Python 3+ years. Excellent knowledge of general programming issues: design patterns, data structures, algorithms. ", "responsibility": "Write structured, clean, reusable, and testable code using Python. Design and implement robust application. Develop and maintain high-performance. ", "salary": 0}, {"name": "Senior Python developer", "url": "https://hh.ru/vacancy/109645044", "requirement": "Опыт работы с чат ботами. -Опыт работы с IoT решениями.", "responsibility": "Драйвер новой модификации блока вызова домофона Beward DKS. Арм для специалиста подрядчика (бот telegram) для регистрации работ и подтверждения их...", "salary": 0}, {"name": "Python developer / Разработчик Python (KORNFELD)", "url": "https://hh.ru/vacancy/110611643", "requirement": "Уверенное владение Python3 в области сетевого программирования (sockets). Знание сетевых технологий, стека протоколов TCP/IP + представление о модели...", "responsibility": "Kornfeld - это семейство высокопроизводительных коммутаторов для центров обработки данных, поддерживающих на аппаратном уровне обработку трафика L2/L3 и...", "salary": 0}, {"name": "Python Developer", "url": "https://hh.ru/vacancy/108952474", "requirement": "Be able to work with API of various embedded systems. 3+ years of <highlighttext>Python</highlighttext> <highlighttext>development</highlighttext> experience. Knowledge working with...", "responsibility": "Review of existing automation tools and their integration with other systems. Implement various automation blocks in Python tying together as...", "salary": 0}, {"name": "Python-разработчик / IT-специалист (офис)", "url": "https://hh.ru/vacancy/109704742", "requirement": "Высшее техническое / математическое образование, либо учитесь на последнем курсе. Аналитический склад ума, ответственность, уверенная работа с цифрами и таблицами. ", "responsibility": "Разработка, оптимизация и рефакторинг бэкенда (Python, FastAPI, Docker), внедрение хранилищ данных (PostgreSQL, Redis). No-code решения (складывание ботов из блоков...", "salary": 70000}, {"name": "Разработчик Python", "url": "https://hh.ru/vacancy/109306217", "requirement": "Глубокое знание языка Python, включая ООП, продвинутые конструкции языка, стандартную библиотеку и популярные фреймворки (Django, Flask). Опыт работы с популярными...", "responsibility": "Разработка, тестирование и поддержка REST API на основе Python и FastAPI. Взаимодействие с базами данных PostgreSQL. Оптимизация производительности бэкенда. ", "salary": 0}, {"name": "ML-Python developer (NLP, LLM)", "url": "https://hh.ru/vacancy/108198467", "requirement": "Опыт работы более 2-х лет в качестве <highlighttext>Python</highlighttext>-<highlighttext>разработчика</highlighttext>. Опыт работы с NLP-моделями не менее 1 года. ", "responsibility": "Разработка и обучение моделей машинного обучения для задач NLP: классификация текста, извлечение информации, генерация текста, построение rag-систем, суммаризация, создание...", "salary": 0}, {"name": "Senior Python developer", "url": "https://hh.ru/vacancy/108482937", "requirement": "Уверенные знания языка Python. Знание паттернов проектирования. Опыт создания приложений, включая дизайн. Умение работать с заказчиками: составлять и понимать технические...", "responsibility": "Разработкой Python утилит для внутреннего использования. Определением списка доработок на основании требований сотрудников. Формированием дорожной карты проекта. Улучшением проекта согласно...", "salary": 0}, {"name": "Python Developer for ML team", "url": "https://hh.ru/vacancy/110426829", "requirement": "Experience as an ML Engineer for 3+ years. Strong proficiency in Python and knowledge of common ML libraries (PyTorch...", "responsibility": "Writing services and APIs that allow access to the ML models. Reducing the run-time of processing millions of data...", "salary": 0}, {"name": "Python Developer", "url": "https://hh.ru/vacancy/110325608", "requirement": "Опыт работы на позиции разработчика от 2х лет. Отличное знание Python. Отличное знание SQL. Отличное знание алгоритмов и структур...", "responsibility": "Участвовать в разработке продукта: декомпозиция, оценка задач и их реализация. Взаимодействовать с членами команды, интеграторами платформ, заказчиками. Участвовать в разработке...", "salary": 0}, {"name": "Middle Python-разработчик", "url": "https://hh.ru/vacancy/96610425", "requirement": "Опыт коммерческой разработки на Python (django). Навыки опытного пользователя Linux. Опыт работы с Bash, SSH, SFTP. Опыт работы с SQL...", "responsibility": "Наша команда занимается разработкой прикладного программного обеспечения для систем хранения данных (СХД). СХД - это программно-аппаратный комплекс, непосредственно предназначенный для...", "salary": 250000}, {"name": "Python-разработчик", "url": "https://hh.ru/vacancy/107080369", "requirement": "Опыт коммерческой разработки от 1 года. Уверенное программирование на Python или других скриптовых языках с последующей миграцией на Python. ", "responsibility": "Разработка — 70% времени. Ревью кода — 20% времени. Контроль сроков — 10% времени. Общение с крутыми людьми – 100% времени!", "salary": 250000}, {"name": "Senior Python developer (FastAPI)", "url": "https://hh.ru/vacancy/107327962", "requirement": "Ищем опытного разработчика с опытом работы в области облачных сервисов (AWS) и уверенным владением Python для работы на иностранном проекте. ", "responsibility": "Опцию перемещения между нашими зарубежными офисами.", "salary": 0}, {"name": "Senior Python Developer", "url": "https://hh.ru/vacancy/110978905", "requirement": "Commercial working experience with Python 3+ years. Knowledge of general programming issues: design patterns, data structures, algorithms. ", "responsibility": "Write structured, clean, reusable, and testable code using Python. Design and implement robust application. Develop and maintain high-performance. ", "salary": 0}, {"name": "Python-разработчик в Толк, Middle+", "url": "https://hh.ru/vacancy/110420662", "requirement": "Опыт работы с брокерами сообщений (предпочтительно Kafka). Опыт участия в разработке распределенных систем. Знание подходов CI/CD и их реализации...", "responsibility": "Один из наших продуктов — Контур.Толк, это облачное пространство для проведения аудио- и видеоконференций с возможностью записи, планированием встреч, интеграцией с...", "salary": 0}, {"name": "Инженер-программист (backend Python developer)", "url": "https://hh.ru/vacancy/106947683", "requirement": "Опыт разработки на Python от 3 лет. - опыт работы с ОС Linux. - стек: FastAPI, SQLAlchemy, Postgres. - опыт проектирования и разработки...", "responsibility": "Backend разработка. – реализация бизнес-логики. – рефакторинг текущей архитектуры.", "salary": 90000}, {"name": "Senior Python разработчик с интересом к рынку облигаций (удаленно, РФ)", "url": "https://hh.ru/vacancy/109451717", "requirement": "Уверенные знание структур данных и алгоритмов. Навыки написания поддерживаемого, тестируемого и читаемого кода. Навык декомпозиции сложных задач.", "responsibility": "Мы — команда Skybonds в Совкомбанке, создаем продукт для анализа рынка ценных бумаг и эффективного управления портфелем. Пользователями продукта являются разные...", "salary": 0}, {"name": "Backend-разработчик/Python-разработчик", "url": "https://hh.ru/vacancy/109663268", "requirement": "Высшее образование. Уверенное знание Python или JavaScript (Node.js). Опыт работы с фреймворками Flask/Django или Express.js. Опыт работы с API...", "responsibility": "Разработка и поддержка программного обеспечения для автоматического сбора отзывов с точек на Яндекс.Картах и Google Maps. Создание системы для отображения...", "salary": 0}, {"name": "Middle Python Developer: Backend / Server side", "url": "https://hh.ru/vacancy/109888859", "requirement": "4+ года опыта с Python(включая asyncio). Опыт работы с FastAPI/Flask или аналогичными фрэймворками. Опыт работы с реляционными...", "responsibility": "Разработка и поддержка инфраструктурных сервисов и систем. Совместная работа с другими командами над архитектурой сервисов и систем. Написание переиспользуемого, тестируемого...", "salary": 4000}, {"name": "Python разработчик", "url": "https://hh.ru/vacancy/109114146", "requirement": "Отличное знание Python 3 и опыт промышленной разработки на Python от трех лет. Опыт многопоточного и асинхронного программирования. ", "responsibility": "Проектирование компонентов систем. Организация процесса разработки. Написание и ревью кода. Написание тестов на свой код. Наставление менее опытных коллег.", "salary": 0}, {"name": "Senior/Middle Python разработчик", "url": "https://hh.ru/vacancy/109218331", "requirement": "Не менее 2 лет опыта в должности разработчика backend на языке Python. Практический опыт и знания фреймворков Django, Django ORM...", "responsibility": "Участвовать в разработке крутого инструмента. Разработка и тестирование нового функционала. Оформление документации по разработанным функциям/фичам. Взаимодействовать с коллегами: как...", "salary": 0}, {"name": "Python-разработчик", "url": "https://hh.ru/vacancy/108175744", "requirement": "Отличное знание Python. Опыт работы с linux, docker, API, celery, FastAPI. Понимание принципов ООП, SOLID, паттернов проектирования. Опыт работы с...", "responsibility": "Разработка на Python и Django. Доработка и сопровождение существующего кода. Участие в планировании/code-review задач. Устранение ряда мелких ошибок. ", "salary": 0}, {"name": "Senior Python Developer", "url": "https://hh.ru/vacancy/110251298", "requirement": "Владение python на экспертном уровне. Фундоментальное понимание внутреннего устройства Django ORM, FastAPI, pydantic. Глубокое понимание основных протоколов: http/https, websocket...", "responsibility": "Разработка/развитие движка и пакетов фреймворка. Общение по телефону с HR — 10-15 минут. Техническое собеседование по Zoom с руководителем...", "salary": 0}, {"name": "Python-разработчик", "url": "https://hh.ru/vacancy/108243626", "requirement": "Отличное знание Python 3 и опыт промышленной разработки на Python от трех лет. Опыт многопоточного и асинхронного программирования. ", "responsibility": "Проектирование компонентов систем. Организация процесса разработки. Написание и ревью кода. Написание тестов на свой код. Наставление менее опытных коллег.", "salary": 0}, {"name": "Python-разработчик", "url": "https://hh.ru/vacancy/109957719", "requirement": "Имеешь опыт работы с Python более 4 лет. Хорошее знание linux (RHEL/Ubuntu). Опыт работы с PostgreSQL (создание и оптимизация...", "responsibility": null, "salary": 0}, {"name": "Python developer / Разработчик Python (KORNFELD)", "url": "https://hh.ru/vacancy/109845000", "requirement": "Уверенное владение Python3 в области сетевого программирования (sockets). Знание сетевых технологий, стека протоколов TCP/IP + представление о модели...", "responsibility": "Kornfeld - это семейство высокопроизводительных коммутаторов для центров обработки данных, поддерживающих на аппаратном уровне обработку трафика L2/L3 и...", "salary": 0}, {"name": "Lead Python разработчик", "url": "https://hh.ru/vacancy/110943821", "requirement": "Опыт коммерческой разработки от 4х лет. Опыт самостоятельного ведения задач от проектирования до внедрения. Опыт руководства командой от 4...", "responsibility": "Проектировать архитектуру микросервисов в рамках проектов компании. Разрабатывать высоконагруженные, масштабируемые, безопасные сервисы в рамках SOA-проекта. Заниматься менеджментом команды: проработка...", "salary": 0}, {"name": "SQL-разработчик", "url": "https://hh.ru/vacancy/110653660", "requirement": "Опыт работы в роли <highlighttext>Python</highlighttext> <highlighttext>Developer</highlighttext> от 4-х лет. Опыт работы с Docker, GitLab CI, OpenShift либо Kubernetes, nginx. ", "responsibility": "Исправлять ошибки в коде. Разрабатывать запросы к БД. Писать тестовые сценарии для проверке разработанного кода.", "salary": 120000}, {"name": "Python developer (Senior)", "url": "https://hh.ru/vacancy/109079826", "requirement": "Опыт коммерческой разработки на Python/Django не менее 5 лет. Отличное знание фреймворка django версии не ниже 3 (ORM, формы...", "responsibility": "Разработка веб-приложений для доступа пользователей к алгоритмам автоматизации. Поддержка текущей кодовой базы и внедрение нового функционала для существующих приложений. ", "salary": 0}, {"name": "Python-разработчик", "url": "https://hh.ru/vacancy/109917853", "requirement": "Опыт работы разработчиком от 3-х лет. Понимание и опыт работы с брокерами сообщений для организации асинхронной обработки задач и...", "responsibility": "Разработка микросервисов для Apache Kafka, Postgres. Логирование системы (Grafana). Разработка и модернизация адаптеров. Решение операционных задач для корректной работы корпоративной...", "salary": 150000}, {"name": "Senior Python разработчик", "url": "https://hh.ru/vacancy/108604439", "requirement": "Более 3 лет опыта разработки на Python. Владение асинхронным программированием с asyncio, а также алгоритмами и ООП. Опыт работы с...", "responsibility": "Разрабатывать платформу управления виртуализацией и ее подсистем на Python. Работать с libvirt, qemu, cloud-init и технологиями репликации. ", "salary": 0}, {"name": "Python-разработчик Machine Learning / Computer Vision", "url": "https://hh.ru/vacancy/109509980", "requirement": "Опыт работы в разработке на Python не менее 3 лет. Глубокие знания Python. Опыт работы с библиотеками и фреймворками для...", "responsibility": "Разработка и поддержка приложений на Python с использованием методов машинного обучения. Совместная работа с data scientist-ами и другими членами...", "salary": 400000}, {"name": "Python-разработчик", "url": "https://hh.ru/vacancy/108236330", "requirement": "Отличное знание Python 3 и опыт промышленной разработки на Python от трех лет. Опыт многопоточного и асинхронного программирования. ", "responsibility": "Проектирование компонентов систем. Организация процесса разработки. Написание и ревью кода. Написание тестов на свой код. Наставление менее опытных коллег.", "salary": 0}, {"name": "Middle+ Python-разработчик", "url": "https://hh.ru/vacancy/108955097", "requirement": "Хорошее владение технологиями: Python 3.x, RabbitMQ, PostgreSQL, Redis, FastAPI, Docker. Опыт разработки сложных высоконагруженных приложений. Ответственность и умение работать...", "responsibility": "Разработка backend-a микросервисных web-приложений. Участие в принятии технических решений. Участие в планировании и оценке задач. Code review.", "salary": 280000}, {"name": "Ведущий / Senior python разработчик", "url": "https://hh.ru/vacancy/108517244", "requirement": "Инженерное или техническое образование (обязательно). Опыт разработки на Python от 4х лет, на позиции Senior - от 1 года. ", "responsibility": "Мы в поисках опытного <highlighttext>python</highlighttext> <highlighttext>разработчика</highlighttext> в команду разработки бэкенда Платформы Моделирования Космической Системы. Платформа состоит из пользовательских приложений, отвечающих...", "salary": 0}, {"name": "Python разработчик", "url": "https://hh.ru/vacancy/109524342", "requirement": "Отличное знание Python 3 и опыт промышленной разработки на Python от трех лет. Опыт многопоточного и асинхронного программирования. ", "responsibility": "Проектирование компонентов систем. Организация процесса разработки. Написание и ревью кода. Написание тестов на свой код. Наставление менее опытных коллег.", "salary": 0}, {"name": "SQL- разработчик", "url": "https://hh.ru/vacancy/110653649", "requirement": "Опыт работы в роли <highlighttext>Python</highlighttext> <highlighttext>Developer</highlighttext> от 4-х лет. Опыт работы с Docker, GitLab CI, OpenShift либо Kubernetes, nginx. ", "responsibility": "Исправлять ошибки в коде. Разрабатывать запросы к БД. Писать тестовые сценарии для проверке разработанного кода.", "salary": 120000}, {"name": "Lead python developer", "url": "https://hh.ru/vacancy/107771951", "requirement": "Отличные знания и большой опыт работы Python(Senior\\Lead). - Опыт создания приложений клиент-серверной архитектуры под linux. - Опыт взаимодействия программы...", "responsibility": "Основная архиважная часть функционала – перевод Legacy-монолита(Perl) на микросервисную архитектуру(Python). - Внедрение и организация процессов разработки на Python. - ", "salary": 0}, {"name": "Data Engineer", "url": "https://hh.ru/vacancy/109199164", "requirement": "Опыт работы в роли Data Engineer или <highlighttext>Python</highlighttext> <highlighttext>Developer</highlighttext> от 1 года. Отличные знания Python для создания и поддержки ETL...", "responsibility": "Перевод на Python и выделение в микровсервисы существующих ETL-процессов, написанных на PHP в рамках MVP. Разработка новых ETL-процессов...", "salary": 0}, {"name": "Python Developer (собственная low-code RPA-платформа)", "url": "https://hh.ru/vacancy/106039261", "requirement": "Опыт коммерческой разработки на Python 3 версии от 2 лет. Понимание принципов ООП, паттернов проектирования, SOLID. Опыт разработки под Windows. ", "responsibility": "Предстоит улучшать и расширять набор активностей для создания сценариев офисной автоматизации (Web, Excel, Word, SAP и прочие приложения). ", "salary": 0}, {"name": "Python developer (Senior)", "url": "https://hh.ru/vacancy/109079828", "requirement": "Опыт коммерческой разработки на Python/Django не менее 3 лет. Отличное знание фреймворка django версии не ниже 3 (ORM, формы...", "responsibility": "Разработка веб-приложений для доступа пользователей к алгоритмам автоматизации. Поддержка текущей кодовой базы и внедрение нового функционала для существующих приложений. ", "salary": 0}, {"name": "Python-разработчик (middle, middle+)", "url": "https://hh.ru/vacancy/102653602", "requirement": "Знание Python. Понимание принципов MVC в программировании. Опыт работы с популярными фреймворками Python. Знание SQL, JavaScript, CSS, HTML. ", "responsibility": "Разработкой программного кода (BackEnd) высоконагруженной системы, разработкой и сопровождением микро-сервисов на Python.", "salary": 0}, {"name": "SQL- разработчик", "url": "https://hh.ru/vacancy/110653653", "requirement": "Опыт работы в роли <highlighttext>Python</highlighttext> <highlighttext>Developer</highlighttext> от 4-х лет. Опыт работы с Docker, GitLab CI, OpenShift либо Kubernetes, nginx. ", "responsibility": "Исправлять ошибки в коде. Разрабатывать запросы к БД. Писать тестовые сценарии для проверке разработанного кода.", "salary": 120000}, {"name": "Разработчик Python/Pyspark, Платформа АБ-тестов, Стенды метрик", "url": "https://hh.ru/vacancy/106392946", "requirement": "Опыт разработки на Python от 2-х лет. Опыт работы с Spark/Pyspark/Hadoop, либо YT/YQL. Понимание принципов обработки...", "responsibility": "Платформу расчета метрик и статистических тестов. Инструменты предварительного анализа метрик. Систему аудита метрик (AA-тесты). Инструменты пост-анализа экспериментов. ", "salary": 0}, {"name": "Python - разработчик", "url": "https://hh.ru/vacancy/109201342", "requirement": "Знаешь Python 3 и имеешь опыт промышленной разработки на Python от трех лет. Есть опыт многопоточного и асинхронного программирования. ", "responsibility": "Проектировать компоненты систем. Организовывать процесс разработки. Писать и ревьюить код. Наставлять менее опытных коллег.", "salary": 0}, {"name": "Middle Python Developer: Backend / Server side", "url": "https://hh.ru/vacancy/109888860", "requirement": "4+ года опыта с Python(включая asyncio). Опыт работы с FastAPI/Flask или аналогичными фрэймворками. Опыт работы с реляционными...", "responsibility": "Разработка и поддержка инфраструктурных сервисов и систем. Совместная работа с другими командами над архитектурой сервисов и систем. Написание переиспользуемого, тестируемого...", "salary": 4000}, {"name": "Python разработчик", "url": "https://hh.ru/vacancy/85594713", "requirement": "Отличное знание Python 3 и опыт промышленной разработки на Python от трех лет. Опыт многопоточного и асинхронного программирования. ", "responsibility": "Проектирование компонентов систем. Организация процесса разработки. Написание и ревью кода. Написание тестов на свой код. Наставление менее опытных коллег.", "salary": 0}, {"name": "Senior Python developer", "url": "https://hh.ru/vacancy/105753546", "requirement": "Опыт коммерческой разработки на python от 4 лет. Опыт работы с FastApi от 3 лет. Углубленное знание SQL и опыт...", "responsibility": "Разработка бэкенда. Участие в разработке продуктовой фабрики по страхованию грузов. Интеграция с внутренними и внешними сервисами компании. Разработка документации. ", "salary": 0}, {"name": "Senior Python Developer in Test / Инженер-программист (KORNFELD)", "url": "https://hh.ru/vacancy/111235935", "requirement": "Уверенного владения Python и pytest. Знания шаблонов проектирования и умения их применять. Опыт работы с asyncio, aiohttp, sqlalchemy, scapy, scrapli...", "responsibility": "Разработкой и поддержкой библиотек/фреймворков для задач автоматизированного тестирования сетевого оборудования (L2+, L3). Разработкой подсистемы сервисов для...", "salary": 0}, {"name": "Ведущий инженер-программист (Senior/Lead Python developer)", "url": "https://hh.ru/vacancy/109464155", "requirement": "Опыт разработки на Python от 5 лет. – опыт наставничества специалистов. – опыт работы с Python, asyncio, FastAPI, SQL, Postgresql. Linux. – ", "responsibility": "Рефакторинг legacy проекта, покрытие существующего кода unit-тестами, постепенное улучшение архитектуры проекта. – разработка ключевых программных модулей проекта. – интеграция с другими...", "salary": 300000}, {"name": "Python-разработчик", "url": "https://hh.ru/vacancy/108420149", "requirement": "Уверенное владение Python 3. Понимание асинхронного программирования. Опыт работы с HTTP, Rest API, JSON. Опыт работы с микрофреймворками (преимущественно Flask...", "responsibility": "Участие в разработке роботизированных систем. Ведение технической документации. Плотное взаимодействие со всеми специалистами проекта. Интеграция сторонних систем в проект, посредством...", "salary": 200000}, {"name": "Python разработчик (SDN)", "url": "https://hh.ru/vacancy/107775148", "requirement": "Опыт проектирования и реализации крупных enterprise-систем. Умение выбирать архитектурные шаблоны, паттерны проектирования. Опыт разработки на Python 3+ лет. ", "responsibility": "Разработка архитектуры нового продукта. Разработка сервиса, ежедневно используемого в проде инженерами и архитекторами для решения задач развития и поддержания IT...", "salary": 0}, {"name": "Middle Python разработчик", "url": "https://hh.ru/vacancy/108991597", "requirement": "Профильное высшее образование. Опыт коммерческой бэкенд разработки. Понимание и опыт применения принципов ООП, паттернов проектирования и асинхронного программирования. ", "responsibility": "Компания находится в реестре ИТ-компаний Минцифры.", "salary": 240000}, {"name": "Python developer", "url": "https://hh.ru/vacancy/109473220", "requirement": "Опыт коммерческой разработки от 2-х лет. Уверенное программирование на Python или других скриптовых языках с последующей миграцией на Python. ", "responsibility": "Разработка — 70% времени. Ревью кода — 20% времени. Контроль сроков — 10% времени. Общение с крутыми людьми – 100% времени!", "salary": 200000}, {"name": "Python разработчик", "url": "https://hh.ru/vacancy/108329139", "requirement": "Отличное знание Python 3 и опыт промышленной разработки на Python от трех лет. Опыт многопоточного и асинхронного программирования. ", "responsibility": "Проектирование компонентов систем. Организация процесса разработки. Написание и ревью кода. Написание тестов на свой код. Наставление менее опытных коллег.", "salary": 0}, {"name": "Python-разработчик", "url": "https://hh.ru/vacancy/110221833", "requirement": "1. Опыт 3,5+ лет. 2. Опыт написания чистого, оптимизированного и поддерживаемого кода. 3. Опыт работы с Django, Flask...", "responsibility": "8 экспертных центров по разным направлениям разработки ПО. 1000+ сотрудников. ИПР - индивидуальный план развития. Митап - возможность присутствовать на митапов...", "salary": 270000}, {"name": "Strong Middle Python разработчик", "url": "https://hh.ru/vacancy/109763553", "requirement": "Опыт работы с фреймворками Django, FastAPI больше 2-х лет. Опыт работы с Celery. Глубокое понимание asyncio. Опыт работы с...", "responsibility": "Разработка новых и поддержка существующих проектов. Принимать участие в улучшении и оптимизации кода. Участвовать в код ревью с командой.", "salary": 0}, {"name": "Python разработчик (уровень Middle+)", "url": "https://hh.ru/vacancy/110306192", "requirement": "Опыт работы на Python от 2-3 лет (Middle) или выше. Глубокие знания и практический опыт работы с: Selenium для...", "responsibility": "Разработка и поддержка клиент-серверных приложений с использованием Python. Проектирование и реализация решений для сбора, парсинга и анализа данных (Data...", "salary": 120000}, {"name": "Python разработчик (Middle+)", "url": "https://hh.ru/vacancy/109200298", "requirement": "Уверенное знание Python. Понимание ООП и SOLID. Понимание работы с Git в команде (Для чего нужен Draft, Rebase, Как готовить...", "responsibility": "Разработка новой функциональности. Создание новых тестов для выпускаемых устройств, модернизация существующих. Покрытие кода тестами. Написание и поддержка документации по проектам.", "salary": 0}, {"name": "Senior Python developer / Инженер-программист (Release engineering)", "url": "https://hh.ru/vacancy/110769484", "requirement": "Отличное знание Python, 3-4 года активного девелопмента. Знание принципов разработки ООП. Опыт разработки приложений и библиотек. Привычка написания юнит...", "responsibility": "Главная цель нашего департамента – создание системы выпуска продуктов, повторного использования кода и компонент, всего процесса разработки и поставки ПО в...", "salary": 0}, {"name": "Python-разработчик", "url": "https://hh.ru/vacancy/105758081", "requirement": "Отличное знание Python 3 и опыт промышленной разработки на Python от трех лет. Опыт многопоточного и асинхронного программирования. ", "responsibility": "Проектирование компонентов систем. Организация процесса разработки. Написание и ревью кода. Написание тестов на свой код. Наставление менее опытных коллег.", "salary": 0}, {"name": "Middle Python-разработчик", "url": "https://hh.ru/vacancy/108711447", "requirement": "Наставлять менее опытных коллег. ТРЕБОВАНИЯ. Опыт промышленной разработки на Python от 3 лет. Отлично знаете Python 3. Есть опыт многопоточного...", "responsibility": "Писать код и проводить код-ревью. Писать тесты на свой код.", "salary": 0}, {"name": "Middle Python-разработчик (Инженер-программист 2 категории)(01050-1)", "url": "https://hh.ru/vacancy/104796042", "requirement": "Высшее образование специалитет / магистратура (готовы рассмотреть в том числе соискателя-студента магистратуры). Опыт разработки на Django. Опыт проектирования БД. ", "responsibility": "Участие в разработке автономной навигационной системы для морских судов. Разработка внутренней логики приложения. Участие в проектировании и разработке сервисов распределенной...", "salary": 130000}, {"name": "Python разработчик (Центр компетенций CV и нейросетевой оптимизации)", "url": "https://hh.ru/vacancy/109163052", "requirement": "Опыт разработки на Python от 3-х лет. Опыт проектирования программной архитектуры. Опыт разработки высоконагруженных многопоточных приложений. Будет плюсом: Опыт...", "responsibility": "Модульная разработка в рамках инфраструктуры Robotics Operation System. Реализация модулей пред- и постобработки данных, поступающих от разнородных сенсоров, для генерации...", "salary": 0}, {"name": "Python Developer", "url": "https://hh.ru/vacancy/108990826", "requirement": "Опыт работы с Python, Django от 2-х лет. Опыт работы с jinja2 шаблонами желателен. Понимание работы сетевых протоколов...", "responsibility": "Планирование работ и оценка задач. Написание программного кода, разработка программных компонентов и скриптов, проведение код-ревью. Разработка сложных веб-приложений...", "salary": 160000}, {"name": "Senior Python разработчик (SberInfra.Cloud)", "url": "https://hh.ru/vacancy/110431920", "requirement": "Опыт разработки на Python (используем Python 3.9 и 3.11). Опыт работы с фреймворками Django/Flask/FastApi. ", "responsibility": "Активно участвовать в развитии и поддержке облачной инфраструктуры Банка и связанных сервисов (automate infrastructure provisioning, infrastructure as code). ", "salary": 0}, {"name": "Middle/Senior Python Developer", "url": "https://hh.ru/vacancy/110250005", "requirement": "Знание Python 3, опыт работы с Django. Опыт работы с базами данных (SQL и NoSQL). Знание основ архитектуры веб-приложений. ", "responsibility": "Разработкой и поддержкой серверной части программных продуктов на языке. Python. Оптимизацией и улучшением существующего кода. Участием в проектировании архитектуры решений. ", "salary": 3000}, {"name": "Experienced Python Engineer", "url": "https://hh.ru/vacancy/109551224", "requirement": "4+ years of professional work experience as a <highlighttext>Python</highlighttext> <highlighttext>developer</highlighttext>. Proven experience with Django framework in production environments. ", "responsibility": "Leading product implementations and collaborating directly with clients to understand and fulfill requirements. Back-end development using Python, with a...", "salary": 0}, {"name": "Senior Python разработчик", "url": "https://hh.ru/vacancy/108788613", "requirement": "Опыт разработки и оптимизации многопоточных (threading, multiprocessing) и асинхронных (asyncio) приложений на python. - Понимание принципов работы ipc (межпроцессного взаимодействия) и...", "responsibility": "Разрабатывать, развивать и осуществлять поддержку Python-сервисов. - Участвовать в устранении технического долга. - Проводить выкатку кода, в том числе писать код...", "salary": 0}, {"name": "Python developer (Middle/Senior)", "url": "https://hh.ru/vacancy/109751646", "requirement": "5+ лет опыта (3+ на Python). Опыт работы с чистым Python. Опыт работы с асинхронностью, многопоточностью. ", "responsibility": "Платформу для спортивного беттинга и esports. Интеграцию API. Аналитические инструменты на основе больших данных. Автоматизированные решения и услуги по прогнозированию...", "salary": 0}, {"name": "Senior Python Developer (проект CVM)", "url": "https://hh.ru/vacancy/109972954", "requirement": "Опыт коммерческой разработки на Python. Опыт работы с SQL(PostgreSQL,Clickhouse) и NoSQL(MongoDB,redis) базами данных. Опыт разработки ETL...", "responsibility": "Разработка с использованием Python3 (занимает 50% от общего функционала). Участие в процессе выбора и внедрения новых технологий для оптимизации...", "salary": 0}, {"name": "Senior/ Middle Python Developer (ML)", "url": "https://hh.ru/vacancy/106800365", "requirement": "Опыт разработки на Python от 3-х лет. Использование контейнеризации (Docker, Kubernetes). Понимание концепций DevOps и CI/CD. ", "responsibility": "Для эффективной работы сервисов мы активно используем модели машинного обучения, число которых измеряется десятками (ценообразование, прогноз спроса, рекомендации). ", "salary": 0}, {"name": "Инженер программист/embedded – разработчик", "url": "https://hh.ru/vacancy/109142954", "requirement": "Опыт разработки встраиваемого ПО МК. Опыт работы с flash-памятью, интерфейсами SPI, I2C, USB. UART. GPIO. ", "responsibility": "Участие в проектах в качестве разработчика. Участие в разработке и согласовании ТЗ на разработку новых изделий. Макетирование/тестирование/отладка прототипов. ", "salary": 0}, {"name": "SQL- разработчик", "url": "https://hh.ru/vacancy/110653659", "requirement": "Опыт работы в роли <highlighttext>Python</highlighttext> <highlighttext>Developer</highlighttext> от 4-х лет. Опыт работы с Docker, GitLab CI, OpenShift либо Kubernetes, nginx. ", "responsibility": "Исправлять ошибки в коде. Разрабатывать запросы к БД. Писать тестовые сценарии для проверке разработанного кода.", "salary": 120000}, {"name": "Senior Python developer/Python инженер", "url": "https://hh.ru/vacancy/109145703", "requirement": "Наличие опыта командной работы в коммерческих проектах более 5-ти лет. Знание Python 3 Умение писать объектно-ориентированный, структурированный и...", "responsibility": "Разрабатывать приложение pSeven Enterprise., используя Python 3.5+, Django, Tornado, Asyncio, Multiprocessing, GraphQL. Самостоятельно решать задачи, брать на себя...", "salary": 0}, {"name": "Senior Python разработчик", "url": "https://hh.ru/vacancy/107412285", "requirement": "Широкий опыт разработки на Python (3.x) от 5 лет. Опыт проектирования высоконагруженных сервисов. Уверенное знание и применение асинхронных фреймворков...", "responsibility": "Развивать и поддерживать платформу распознавания лиц. Проектировать API и архитектуру для новых задач и сервисов. Делать проект лучше со всех...", "salary": 316000}, {"name": "Разработчик Python (Middle)", "url": "https://hh.ru/vacancy/109043917", "requirement": "Уровень: middle, middle+. Опыт разработки на Python от 3-х лет. Знание и опыт применения Git, docker. Опыт работы с...", "responsibility": "Backend-разработка новых функциональных блоков. Самостоятельно декомпозировать задачи бэклога. Оптимизация кода, запросов и БД. REST API для frontend-приложений. ", "salary": 0}, {"name": "Python developer / Разработчик Python (TATLIN.FLEX)", "url": "https://hh.ru/vacancy/107119475", "requirement": "Опыт коммерческой разработки на Python 3.9+ (RPC, TDD, Очереди, Параллелизм). Опыт работы со стандартными библиотеками Python (subprocess, concurrent.futures...", "responsibility": "Департамент TATLIN.FLEX разрабатывает Систему Хранения Данных (СХД) TATLIN.FLEX с гибкими вариантами конфигурации аппаратного комплекса. Для поддержки активного роста продукта, мы...", "salary": 0}, {"name": "Senior Python Developer", "url": "https://hh.ru/vacancy/110994457", "requirement": "Опыт коммерческой разработки на Python от 3-х лет. Владение одним из асинхронных фреймворком: FastAPI, AioHttp. Опыт работы с asyncio...", "responsibility": "Этапы отбора: Анкета. Первичное интервью. Техническое интервью. Оффер.", "salary": 0}, {"name": "Python-разработчик в Толк, Middle+", "url": "https://hh.ru/vacancy/110420664", "requirement": "Опыт работы с брокерами сообщений (предпочтительно Kafka). Опыт участия в разработке распределенных систем. Знание подходов CI/CD и их реализации...", "responsibility": "Один из наших продуктов — Контур.Толк, это облачное пространство для проведения аудио- и видеоконференций с возможностью записи, планированием встреч, интеграцией с...", "salary": 0}, {"name": "Python разработчик (Лаборатория ИИ)", "url": "https://hh.ru/vacancy/109435844", "requirement": "Уверенное владение Python. Хорошее знание Python-библиотек для обработки и визуализации данных: Pandas/PySpark, Matplotlib и т. д.. ", "responsibility": "Автоматизация рабочих процессов бизнес-подразделений. Разработка оптимальных алгоритмов обработки табличных данных. Интеграция разработанных решений в инфраструктуру Банка. Выбор оптимальных вариантов...", "salary": 0}, {"name": "Senior Python Developer", "url": "https://hh.ru/vacancy/110815436", "requirement": "5+ years of experience in Python (with expertise in asyncio, FastAPI). 2+ years of experience with MongoDB, Redis...", "responsibility": "Product Architecture: Design a scalable and secure product architecture. Evaluate and implement technologies to enhance performance and streamline operations. ", "salary": 0}, {"name": "Python разработчик (Сочи)", "url": "https://hh.ru/vacancy/109607359", "requirement": "Профессионалы, которые готовы поддерживать идеи, развитие и интерес. Методология, построенная на привлечении учащихся к процессу познания и прикладное использование знаний...", "responsibility": "Планирование и осуществление учебной деятельности (лекционные и практические занятия) в группах 16 человек в соответствии с образовательной программой. ", "salary": 50000}, {"name": "SQL- разработчик", "url": "https://hh.ru/vacancy/110653650", "requirement": "Опыт работы в роли <highlighttext>Python</highlighttext> <highlighttext>Developer</highlighttext> от 4-х лет. Опыт работы с Docker, GitLab CI, OpenShift либо Kubernetes, nginx. ", "responsibility": "Исправлять ошибки в коде. Разрабатывать запросы к БД. Писать тестовые сценарии для проверке разработанного кода.", "salary": 120000}, {"name": "Python-разработчик", "url": "https://hh.ru/vacancy/108374094", "requirement": "Опыт программирования на Python от 3 лет. Глубокие знания основ Computer Science: алгоритмы, структуры данных, операционные системы, сети. ", "responsibility": "Автоматизированная система анализа и интерпретации чертежей. Системы отслеживания производственного процесса. Управление станками и промышленным оборудованием. Системы видеомониторинга. Разработка серверной части...", "salary": 0}, {"name": "Python-разработчик", "url": "https://hh.ru/vacancy/94747210", "requirement": "Отличное знание Python 3 и опыт промышленной разработки на Python от трех лет. Опыт многопоточного и асинхронного программирования. ", "responsibility": "Проектирование компонентов систем. Организация процесса разработки. Написание и ревью кода. Написание тестов на свой код. Наставление менее опытных коллег.", "salary": 0}, {"name": "SQL- разработчик", "url": "https://hh.ru/vacancy/110653651", "requirement": "Опыт работы в роли <highlighttext>Python</highlighttext> <highlighttext>Developer</highlighttext> от 4-х лет. Опыт работы с Docker, GitLab CI, OpenShift либо Kubernetes, nginx. ", "responsibility": "Исправлять ошибки в коде. Разрабатывать запросы к БД. Писать тестовые сценарии для проверке разработанного кода.", "salary": 120000}, {"name": "Python Developer (Kintsugi)", "url": "https://hh.ru/vacancy/108970435", "requirement": "Уверенное владение Python 3, asyncio. Коммерческий опыт разработок на Python от 2х лет. Знание и понимание основ построения высоконагруженных...", "responsibility": "Анализ требований, проектирование и реализация новой функциональности. Обеспечение поддержки 3го уровня (поиск и решение проблем). Участие, в совместном с...", "salary": 0}, {"name": "Ментор на курс “Middle Python-разработчик”", "url": "https://hh.ru/vacancy/110652059", "requirement": "Опыт разработки на Python от 3-х лет. Работали с синхронными и асинхронными фреймворками. Наш стек: Django, Flask, FastAPI. ", "responsibility": "Отвечает на вопросы студентов в чате и помогает с трудностями на протяжении всего обучения. Проводит вебинары, групповые и индивидуальные встречи...", "salary": 0}, {"name": "Senior Python Developer in Test / Инженер-программист (Common Yadro Platform)", "url": "https://hh.ru/vacancy/99828532", "requirement": "Опыт автоматизации тестирования backend микросервисов и/или клиент-серверных приложений на языке Python (например, с использованием pytest framework, библиотек requests...", "responsibility": "Разрабатываемая экосистема включает создание Linux-based дистрибутива ОС, разработку основных платформенных сервисов и модулей, в частности, слоя управления платформой и...", "salary": 0}, {"name": "Senior Python developer", "url": "https://hh.ru/vacancy/109951732", "requirement": "Хорошее знание Python (3.x). Опыт проектирования распределенных приложений. Опыт работы с многопоточными приложениями и системами очередей. Опыт разработки API...", "responsibility": "Разработка приложения для расчета данных буровых скважин, их последующего хранения и обработки сторонним ПО. Участие в обсуждении технических особенностей и...", "salary": 0}, {"name": "Team Lead Python Developer", "url": "https://hh.ru/vacancy/110999804", "requirement": "Опыт работы на аналогичной должности от 2-х лет. Опыт разработки на python 3 от 5-ти лет. ", "responsibility": "Отвечать за развитие платформы, выбор подходов, технологий и внедрение этих технологий в продукт. Развивать backend разработчиков. Выполнять роль архитектора и...", "salary": 0}, {"name": "Python Backend-разработчик (Middle/Senior)", "url": "https://hh.ru/vacancy/109533742", "requirement": "Коммерческий опыт работы на Python в продуктовых командах от 3-х лет. Понимание механики языка Python3.10+ и...", "responsibility": "Разработка и доработка веб-приложений на Python, преимущественно на aiohttp/fastapi. Реализация взаимодействия облачной и локальной (на буровой) систем. ", "salary": 200000}, {"name": "Python-разработчик (ML/ETL)", "url": "https://hh.ru/vacancy/109078703", "requirement": "Какие знания и навыки для нас важны: Опыт backend-разработки на Python от 2 лет. Глубокое знание Python, большим плюсом...", "responsibility": "О проекте: Департамент анализа данных и моделирования создан в 2019 году для стратегического развития функции анализа данных. Управление процессных и...", "salary": 0}, {"name": "Python Developer", "url": "https://hh.ru/vacancy/109199830", "requirement": "Знаешь Python 3 и имеешь опыт промышленной разработки на Python от трех лет. Есть опыт многопоточного и асинхронного программирования. ", "responsibility": "Проектировать компоненты систем. Организовывать процесс разработки. Писать и ревьюить код. Наставлять менее опытных коллег.", "salary": 0}, {"name": "Senior Python Developer", "url": "https://hh.ru/vacancy/109969398", "requirement": "Отличные знания Python. Отличные знания фреймворка Django. Понимание ключевых интернет архитектур, технологий, протоколов и форматов, таких как TCP/IP, HTTP...", "responsibility": "Разработка ПО на языке Python. Участие в разработке архитектуры программных решений. Code review.", "salary": 0}, {"name": "Python developer / Разработчик Python (TATLIN.FLEX)", "url": "https://hh.ru/vacancy/107119469", "requirement": "Опыт коммерческой разработки на Python 3.9+ (RPC, TDD, Очереди, Параллелизм). Опыт работы со стандартными библиотеками Python (subprocess, concurrent.futures...", "responsibility": "Департамент TATLIN.FLEX разрабатывает Систему Хранения Данных (СХД) TATLIN.FLEX с гибкими вариантами конфигурации аппаратного комплекса. Для поддержки активного роста продукта, мы...", "salary": 0}, {"name": "Backend Developer (Checkout)", "url": "https://hh.ru/vacancy/108956009", "requirement": "Пишешь на Python от 3-4 лет, реализуешь коммерческие проекты: умеешь писать рабочий, производительный и читаемый код, покрывать его тестами. ", "responsibility": "Разрабатывать и внедрять новую функциональность. Рефакторить и оптимизировать существующий код. Декомпозировать продуктовые требования в задачи и проекты разработки. ", "salary": 0}, {"name": "Senior Python developer", "url": "https://hh.ru/vacancy/110962110", "requirement": "Опыт коммерческой разработки от 3х лет. Знания Python, Django, DRF, FastAPI, SQL. Знание и понимание принципов ООП, SOLID, KISS...", "responsibility": "Создание, поддержка и рефакторинг web-сервисов для команды и игроков. Оценка входящих задач и соблюдение сроков выполнения. Участие в выборе...", "salary": 0}, {"name": "Python developer / Разработчик Python (KORNFELD)", "url": "https://hh.ru/vacancy/89889043", "requirement": "Уверенное владение Python3 в области сетевого программирования (sockets). Знание сетевых технологий, стека протоколов TCP/IP + представление о модели...", "responsibility": "Kornfeld - это семейство высокопроизводительных коммутаторов для центров обработки данных, поддерживающих на аппаратном уровне обработку трафика L2/L3 и...", "salary": 0}, {"name": "Python-разработчик (middle, middle+)", "url": "https://hh.ru/vacancy/108261996", "requirement": "Знание Python. Понимание принципов MVC в программировании. Опыт работы с популярными фреймворками Python. Знание SQL, JavaScript, CSS, HTML. ", "responsibility": "Разработкой программного кода (BackEnd) высоконагруженной системы, разработкой и сопровождением микро-сервисов на Python.", "salary": 0}, {"name": "Senior Python Developer", "url": "https://hh.ru/vacancy/110815437", "requirement": "5+ years of experience in Python (with expertise in asyncio, FastAPI). 2+ years of experience with MongoDB, Redis...", "responsibility": "Product Architecture: Design a scalable and secure product architecture. Evaluate and implement technologies to enhance performance and streamline operations. ", "salary": 0}, {"name": "Senior Python", "url": "https://hh.ru/vacancy/109803136", "requirement": "Опыт разработки не менее 3 лет. Знание жизненного цикла разработки ПО. Опыт разработки высоконагруженных web-проектов на Python. ", "responsibility": "Участвовать в разработке архитектуры систем. Обосновывать выбор технических решений. Разрабатывать и решать сложные задачи. Находить решения и брать на себя...", "salary": 0}, {"name": "IT-рекрутер", "url": "https://hh.ru/vacancy/103186769", "requirement": "Какие компетенции и опыт нам необходимы: - уверенное знание методов подбора и использования различных источников поиска персонала, в том числе опыт...", "responsibility": "Сотрудничаем с российскими и зарубежными заказчиками, предлагаем индивидуальные концепции и IT-решения для каждого клиента. -Оперативное закрытие актуальных позиций. ", "salary": 0}, {"name": "Middle+ Python Developer", "url": "https://hh.ru/vacancy/109224579", "requirement": "Ability to work effectively both independently and as part of a team. Ability to solve multiple tasks at the same...", "responsibility": "Algorithmic Brains - IT company with a development center in Minsk. We have been working since 2018. We create products in...", "salary": 0}, {"name": "Senior Python Developer in Test / Инженер-программист (KORNFELD)", "url": "https://hh.ru/vacancy/111235934", "requirement": "Уверенного владения Python и pytest. Знания шаблонов проектирования и умения их применять. Опыт работы с asyncio, aiohttp, sqlalchemy, scapy, scrapli...", "responsibility": "Разработкой и поддержкой библиотек/фреймворков для задач автоматизированного тестирования сетевого оборудования (L2+, L3). Разработкой подсистемы сервисов для...", "salary": 0}, {"name": "Python-разработчик", "url": "https://hh.ru/vacancy/109877977", "requirement": "Образование в области информационных технологий, компьютерных наук или смежной области. Не менее 3 лет опыта в программировании на Python. ", "responsibility": "Разработка, оптимизация и поддержка прокси-сервера, написанного на Python. Интеграция прокси-сервера с локальным API приложения пользователя. Обеспечение безопасного и...", "salary": 0}, {"name": "SQL- разработчик", "url": "https://hh.ru/vacancy/110653661", "requirement": "Опыт работы в роли <highlighttext>Python</highlighttext> <highlighttext>Developer</highlighttext> от 4-х лет. Опыт работы с Docker, GitLab CI, OpenShift либо Kubernetes, nginx. ", "responsibility": "Исправлять ошибки в коде. Разрабатывать запросы к БД. Писать тестовые сценарии для проверке разработанного кода.", "salary": 120000}, {"name": "Продакт Разработчик Python CRM", "url": "https://hh.ru/vacancy/106851831", "requirement": "2+ года опыта в Python с выдающимися достижениями. Увлечение передовыми технологиями, опыт применения GPT для анализа данных с подключением...", "responsibility": "Отвечаете за доставку проектов в продакшн каждую неделю и решаете кросс-командных проблемы для этого. Грумите и планируете беклог. ", "salary": 2700}, {"name": "Python developer (Senior)", "url": "https://hh.ru/vacancy/109079827", "requirement": "Опыт коммерческой разработки на Python/Django не менее 5 лет. Отличное знание фреймворка django версии не ниже 3 (ORM, формы...", "responsibility": "Разработка веб-приложений для доступа пользователей к алгоритмам автоматизации. Поддержка текущей кодовой базы и внедрение нового функционала для существующих приложений. ", "salary": 0}, {"name": "Python разработчик", "url": "https://hh.ru/vacancy/109542696", "requirement": "Стаж работы по данному направлению более года. Знание SQL (запросы, хранимые процедуры, MS SQL, PostgreSQL, My SQL), Python (желателен опыт...", "responsibility": "Разработка приложений сбора данных, обработки данных, взаимодействия с промышленным оборудованием и базами данных.", "salary": 150000}, {"name": "Fullstack Developer (C#/JavaScript)", "url": "https://hh.ru/vacancy/109664581", "requirement": "Уверенные знания и опыт разработки на C#, JS, jQuery, HTML, CSS. Знание и опыт разработки на ASP.NET Core MVC. ", "responsibility": "Реализация модуля для взаимодействия отдела продаж и отдела продвижения. Автоматизация создания/редактирования карточек товаров. Решение задач по ценообразованию, медиа, коммуникациям...", "salary": 0}, {"name": "Senior Python разработчик (Intelligent Document Processing)", "url": "https://hh.ru/vacancy/109147691", "requirement": "Опыт создания высоконагруженных продуктов. Опыт промышленной разработки на Python от 3-х лет (мы используем Django, Asyncio). Опыт работы с...", "responsibility": "Заниматься продуктовой разработкой. Проектировать и писать нагруженные сервисы на Python. Создавать масштабируемую и надежную архитектуру и API. Интегрироваться с партнерами...", "salary": 0}, {"name": "Python developer", "url": "https://hh.ru/vacancy/107094770", "requirement": "Имеешь опыт построения микросервисной архитектуры для работы с большими объёмами данных. Понимаешь преимущества асинхронного кода и когда его стоит использовать. ", "responsibility": "Создание бизнес-архитектуры: реинжиниринг бизнес-процессов, подготовка бизнес-требования, проектирование модели данных. Разработка ядра платформы. Начало реализации ряда прикладных сервисов. ", "salary": 0}, {"name": "Senior Python Developer (Remote, Israel)", "url": "https://hh.ru/vacancy/110541545", "requirement": "At least six years of experience in server-side Python programming (multi-threading, multi-processing, communication protocols, and databases). ", "responsibility": "You will be part of our dynamic mixed development team, collaborating with a leading storage company based in Tel Aviv.", "salary": 3500}, {"name": "Senior python developer", "url": "https://hh.ru/vacancy/102265867", "requirement": "От 1 года опыт курирования команды разработки (курирование, постановка задач, составление планов и т.п). Опыт от 2х лет...", "responsibility": "Разработка back-end. Руководство командой разработки (декомпозиция, постановка и контроль задач). Участие в разработке и согласования архитектуры решений. ", "salary": 0}, {"name": "Продакт Разработчик Python CRM", "url": "https://hh.ru/vacancy/106750549", "requirement": "2+ года опыта в Python с выдающимися достижениями. Увлечение передовыми технологиями, опыт применения GPT для анализа данных с подключением...", "responsibility": "Отвечаете за доставку проектов в продакшн каждую неделю и решаете кросс-командных проблемы для этого. Грумите и планируете беклог. ", "salary": 2700}, {"name": "Python Developer", "url": "https://hh.ru/vacancy/105638250", "requirement": "Коммерческий опыт создания веб-приложений с использованием Python-фреймворков (Django, FastAPI, Flask) от 1 года. Знание Python Core и встроенной...", "responsibility": null, "salary": 0}, {"name": "Senior Python Developer", "url": "https://hh.ru/vacancy/109420961", "requirement": "Комерческий опыт на Python от 2ух лет. Опыт проведения Code Review. Понимание основных принципов работы брокеров сообщений, кэш-серверов...", "responsibility": "Разработка и поддержка масштабируемых, высокопроизводительных приложений на Python. Перевод бизнес-требований в код на основе спецификаций от продакт-менеджеров и...", "salary": 5500}, {"name": "Python-разработчик (Middle)", "url": "https://hh.ru/vacancy/108918625", "requirement": "Опыт коммерческой разработки на Python более двух лет. Опыт разработки систем взаимодействия клиент-серверных приложений. Опыт работы с Aiohttp или...", "responsibility": "Разработка клиент-серверной части. Автоматизация, работа с формами данных. Внедрение нового функционала и оптимизация кода. Разработка микросервисов. Написание API.", "salary": 180000}, {"name": "Python developer (Senior)", "url": "https://hh.ru/vacancy/109079830", "requirement": "Опыт коммерческой разработки на Python/Django не менее 5 лет. Отличное знание фреймворка django версии не ниже 3 (ORM, формы...", "responsibility": "Разработка веб-приложений для доступа пользователей к алгоритмам автоматизации. Поддержка текущей кодовой базы и внедрение нового функционала для существующих приложений. ", "salary": 0}, {"name": "Инженер-программист / Бэкенд-разработчик на Python", "url": "https://hh.ru/vacancy/86548323", "requirement": "Опыт разработки от 2 лет на Python. - Опыт в ОС Linux. - Стек: Flask/FastAPI, SQLAlchemy, Postgres, Redis, Celery. - ", "responsibility": "В отдел разработки автоматизированных систем управления. - Backend разработка. - Реализация бизнес-логики. - Взаимодействие с командой. - Анализ и оценка требований. - ", "salary": 90000}, {"name": "Ведущий Python-разработчик", "url": "https://hh.ru/vacancy/108175743", "requirement": "Отличное знание Python. Опыт работы с linux, docker, API, celery, FastAPI. Понимание принципов ООП, SOLID, паттернов проектирования. Опыт работы с...", "responsibility": "Разработка на Python и Django. Техническое лидерство, помощь в решении сложных задач менее опытным коллегам. Проработка задач совместно с аналитиком...", "salary": 0}, {"name": "Python developer", "url": "https://hh.ru/vacancy/98964007", "requirement": "Высшее техническое образование. Знание Python и опыт работы от 3-х лет. Опыт применения фреймворков: Django/Fast API. ", "responsibility": "Разрабатывать backend на Python. Написание программных модулей, облегчающих решение типовых задач обработки данных. Code review, обеспечение качества кода.", "salary": 0}, {"name": "Senior Python developer", "url": "https://hh.ru/vacancy/110070729", "requirement": "Опыт коммерческой разработки на Python от 3 до 5 лет. Уверенное владение одним или несколькими фреймворками (Django, Flask, FastAPI, AioHttp...", "responsibility": "Разрабатывать лучшие инструменты для того, чтобы каждый человек был на. Разработка и поддержка серверной части приложений на Python. ", "salary": 315000}, {"name": "Python-разработчик (ESKO Automation Engine)", "url": "https://hh.ru/vacancy/109721829", "requirement": "Знание Python, Django, FastApi, PostgreSQL, Docker, Docker-compose, Docker swarm, Jenkins CICD 11:13. Знание или готовность изучать ESKO Automation...", "responsibility": "Поддержка и увеличение работоспособности Docker-систем.", "salary": 150000}, {"name": "Программист С++", "url": "https://hh.ru/vacancy/111199663", "requirement": "Не нужно знать идеально все наши технологии. Нужна светлая голова и страстное желание работать.", "responsibility": "Разработка решений по разбору и обработке файлов электронной отчетности. Интеграции Desktop-приложений и облачных сервисов в сфере ЭО и ЭДО. ", "salary": 230000}, {"name": "Python Developer / Vue.js / Разработчик", "url": "https://hh.ru/vacancy/109296427", "requirement": "Имеешь опыт работы не менее трех лет. Опыт работы с чат-ботами и API: Глубокие знания Python и опыт разработки...", "responsibility": "Cоздаем комплексные решения для фронт- и бэк-офисов на базе low-code платформы. *Резидент Сколково. *Аккредитация в Минцифры. *", "salary": 300000}, {"name": "Senior Python разработчик на проект создания частного облака", "url": "https://hh.ru/vacancy/104180725", "requirement": "Опыт коммерческой разработки на Python от 3 лет. Понимание многопоточности / многопроцессности / асинхронности. Навыки проектирования микросервисов. Опыт работы с очередями (RabbitMQ...", "responsibility": "Программировать бизнес-логику на Python, писать тесты, делать code review. Разрабатывать и совершенствовать сервисы облачной платформы на Python: сервис управления...", "salary": 0}, {"name": "Python-разработчик в Толк, Middle+", "url": "https://hh.ru/vacancy/110420667", "requirement": "Опыт работы с брокерами сообщений (предпочтительно Kafka). Опыт участия в разработке распределенных систем. Знание подходов CI/CD и их реализации...", "responsibility": "Один из наших продуктов — Контур.Толк, это облачное пространство для проведения аудио- и видеоконференций с возможностью записи, планированием встреч, интеграцией с...", "salary": 0}, {"name": "Ведущий инженер-программист / Разработчик на Python", "url": "https://hh.ru/vacancy/86548580", "requirement": "Опыт разработки от 5 лет на Python. - Опыт в ОС Linux. - Стек: Flask/FastAPI, SQLAlchemy, Postgres, Redis, Celery. - ", "responsibility": "В отдел разработки автоматизированных систем управления. - Backend разработка. - Реализация бизнес-логики. - Участие в улучшении и доработке текущей архитектуры. - ", "salary": 200000}, {"name": "Senior Python-разработчик", "url": "https://hh.ru/vacancy/108935291", "requirement": "Опыт разработки на python – от 4 лет. Понимание принципов клиент-серверного взаимодействия (в том числе REST API, WebSocket). ", "responsibility": "Разработка серверной части нового продукта. Участие вместе с руководителем группы в проектировании архитектуры бэкенда с учетом требований по нагрузке, масштабируемости...", "salary": 0}, {"name": "Python developer", "url": "https://hh.ru/vacancy/109275047", "requirement": "От 3 года опыта разработки на python. - Понимание принципов Python-разработки. - Опыт с SQL/NoSQL базами данных, с docker. - ", "responsibility": "Проект: Основной проект — платформа совместных безопасных вычислений, которая проводит скоринг клиентов банков для оценки кредитного рейтинга. - Программирование распределенных вычислений. - ", "salary": 0}, {"name": "Senior Python developer", "url": "https://hh.ru/vacancy/109951669", "requirement": "Хорошее знание Python (3.x). Опыт проектирования распределенных приложений. Опыт работы с многопоточными приложениями и системами очередей. Опыт разработки API...", "responsibility": "Разработка приложения для расчета данных буровых скважин, их последующего хранения и обработки сторонним ПО. Участие в обсуждении технических особенностей и...", "salary": 0}, {"name": "Python разработчик/developer в IT-банк", "url": "https://hh.ru/vacancy/111206390", "requirement": "ПРЕИМУЩЕСТВА. ОТ ВАС. Опыт от 3 лет. Легко разбираетесь в Python 3. Многопоточно и асинхронно программируете. FastApi, Flask или др. ", "responsibility": "Продвинутый IT-банк в поисках <highlighttext>Python</highlighttext>-<highlighttext>разработчиков</highlighttext> уровня Middle. Кодить и тестировать.", "salary": 0}, {"name": "Senior python developer в команду Яндекс Документов", "url": "https://hh.ru/vacancy/109309587", "requirement": "Понимаете принципы построения распределённых отказоустойчивых систем. Умеете тестировать собственный код и работать с кодом коллег.", "responsibility": "Продуктовыми задачами - разрабатывать сервис и писать новые фичи с нуля. Активно влиять на архитектурные решения. Поддерживать ПО — от написания до...", "salary": 0}, {"name": "Senior Python разработчик", "url": "https://hh.ru/vacancy/109763417", "requirement": "опыт работы с микросервисами. - опыт проектирования Базы Данных. - опыт ведения проекта. - опыт работы с фреймворками Django, FastAPI больше 4-х...", "responsibility": null, "salary": 0}, {"name": "Senior Python-разработчик", "url": "https://hh.ru/vacancy/104583514", "requirement": "Опыт разработки на Python не менее 3 лет (Python 3.5+). Опыт работы с Django framework. Опыт работы с...", "responsibility": "Разработкой web-проектов и цифровых сервисов c использованием Python/Django. Интеграцией приложений с различными внутренними информационными системами. Настройкой и поддержкой...", "salary": 0}, {"name": "Python-разработчик", "url": "https://hh.ru/vacancy/95531573", "requirement": "Знаешь Python 3 и имеешь опыт промышленной разработки на Python от трех лет. Есть опыт многопоточного и асинхронного программирования. ", "responsibility": "Проектировать компоненты систем. Организовывать процесс разработки. Писать и ревьюить код. Наставлять менее опытных коллег.", "salary": 0}, {"name": "Senior Python Developer (Ecom)", "url": "https://hh.ru/vacancy/109430496", "requirement": "Опыт коммерческой разработки Python – от 3х лет обязательно. Опыт с Django – от 2х лет обязательно. Знание SQL – MySQL...", "responsibility": "Разработка, code review и рефакторинг кода. Сопровождение и документирование написанного кода. Участие в проектировании систем. Оптимизация сервисов под высокие нагрузки. ", "salary": 0}, {"name": "Python-разработчик", "url": "https://hh.ru/vacancy/108972492", "requirement": "Знание python. Знание linux, shell. Умение самостоятельно ставить задачи и формировать обратную связь для команды. Знание REST API (Sanic), gRPC...", "responsibility": "Автоматизированное тестирование оборудования. Графические интерфейсы для ручного тестирования оборудования. Поддержка небольших REST, gRPC сервисов.", "salary": 0}, {"name": "Python разработчик", "url": "https://hh.ru/vacancy/105307086", "requirement": "Отличное знание Python 3 и опыт промышленной разработки на Python от трех лет. Опыт многопоточного и асинхронного программирования. ", "responsibility": "Проектирование компонентов систем. Организация процесса разработки. Написание и ревью кода. Написание тестов на свой код. Наставление менее опытных коллег.", "salary": 0}, {"name": "Python разработчик (Middle +, Senior)", "url": "https://hh.ru/vacancy/107710159", "requirement": "Стек технологий: Python 5+, Flask, SQLAlchemy, FastAPI, Django, Asyncio, Pytest, Unittest, PostgreSQL. Что мы ожидаем от кандидата: Уверенное знание...", "responsibility": "Опцию перемещения между нашими зарубежными офисами.", "salary": 0}, {"name": "Python Developer в VK Tax Compliance", "url": "https://hh.ru/vacancy/109631278", "requirement": "Опыт разработки на Python от трёх лет. Опыт работы с FastAPI. Понимание микросервисной архитектуры. Опыт работы с БД Postgres. ", "responsibility": "Платформа VK Tax Compliance — передовое ИТ-решение, которое учитывает особенности вашей компании и позволяет выполнить все требования законодательства к информационному...", "salary": 0}, {"name": "Python-разработчик в финтех проект", "url": "https://hh.ru/vacancy/109642542", "requirement": "Наставлять менее опытных коллег. ТРЕБОВАНИЯ. Опыт промышленной разработки на Python от 3 лет. Отлично знаете Python 3. Есть опыт многопоточного...", "responsibility": "Писать код и проводить код-ревью. Писать тесты на свой код.", "salary": 0}, {"name": "Senior Python Developer", "url": "https://hh.ru/vacancy/109686219", "requirement": "Опыт в продуктовой компании с мобильными приложениями. Хорошие знания Python. Знание принципов REST API. Опыт использования какого-либо фреймворка с...", "responsibility": "Разрабатывать и поддерживать серверную часть наших AI-приложений на Python. Проектировать и оптимизировать API для взаимодействия с мобильными приложениями. ", "salary": 3000}, {"name": "Продакт Разработчик Python AI (удаленно)", "url": "https://hh.ru/vacancy/110682804", "requirement": "2+ года опыта в Python с выдающимися достижениями. Увлечение передовыми технологиями, опыт применения GPT для анализа данных с подключением...", "responsibility": "Отвечаете за доставку проектов в продакшн каждую неделю и решаете кросс-командных проблемы для этого. Грумите и планируете беклог. ", "salary": 2700}, {"name": "Senior Python - разработчик", "url": "https://hh.ru/vacancy/108464684", "requirement": "Python – уверенное владение. Git (создавать ветки, делать rebase, merge, squash). Принципы работы с PyTest (Python). Алгоритмы и структуры данных. ", "responsibility": "Разрабатывает программные модули; пишет, отлаживает и оптимизирует программный код. Участвует в решении крупноблочных задач в высоконагруженных системах. Создаёт распределённые и...", "salary": 0}, {"name": "Python-разработчик", "url": "https://hh.ru/vacancy/109073609", "requirement": "Отличное знание Python 3 и FastAPI. Опыт работы с базами данных PostgreSQL и Redis. Опыт разработки RESTful API. ", "responsibility": "Разрабатывать и поддерживать высококачественный код на Python. Участвовать в проектировании архитектуры приложения и выборе технологий. Создавать и оптимизировать RESTful API. ", "salary": 0}, {"name": "Senior Python-developer", "url": "https://hh.ru/vacancy/109047153", "requirement": "Опыт коммерческой разработки от 3-х лет. Уверенное программирование на Python или других скриптовых языках с последующей миграцией на Python. ", "responsibility": "Разработка — 70% времени. Ревью кода — 20% времени. Контроль сроков — 10% времени. Общение с крутыми людьми – 100% времени!", "salary": 270000}, {"name": "Product Manager Data Science", "url": "https://hh.ru/vacancy/109639944", "requirement": "Умение работать со сложными технологическими продуктами, планировать и выпускать релизы в срок. Умение сформировать и донести продуктовое видение. ", "responsibility": "Управлять командой, состоящей из дата-аналитиков, project manager и <highlighttext>Python</highlighttext> <highlighttext>разработчиков</highlighttext>, подключать DS специалистов. Отвечать за мотивацию и people management. ", "salary": 0}, {"name": "SQL- разработчик", "url": "https://hh.ru/vacancy/110653662", "requirement": "Опыт работы в роли <highlighttext>Python</highlighttext> <highlighttext>Developer</highlighttext> от 4-х лет. Опыт работы с Docker, GitLab CI, OpenShift либо Kubernetes, nginx. ", "responsibility": "Исправлять ошибки в коде. Разрабатывать запросы к БД. Писать тестовые сценарии для проверке разработанного кода.", "salary": 120000}, {"name": "Senior Python разработчик с интересом к рынку облигаций (удаленно, РФ)", "url": "https://hh.ru/vacancy/109054444", "requirement": "Уверенные знание структур данных и алгоритмов. Навыки написания поддерживаемого, тестируемого и читаемого кода. Навык декомпозиции сложных задач.", "responsibility": "Мы — команда Skybonds в Совкомбанке, создаем продукт для анализа рынка ценных бумаг и эффективного управления портфелем. Пользователями продукта являются разные...", "salary": 0}, {"name": "Middle Python разработчик", "url": "https://hh.ru/vacancy/80229280", "requirement": "Опыт коммерческой разработки от 3-х лет. Высшее завершенное техническое образование. Уверенное знание Python. Хорошее знание ООП, принципов и паттернов...", "responsibility": "Участие в качестве разработчика в проектах с использованием современных технологий. Внедрение разработок у заказчика. Участие в проработке архитектуры решений.", "salary": 0}, {"name": "Разработчик корпоративного хранилища данных (SQL, Oracle)", "url": "https://hh.ru/vacancy/110227629", "requirement": "Отличный уровень SQL: написание сложных запросов, оптимизация кода. Опыт работы с хранилищем данных. Умение применять современные информационные технологии для решения...", "responsibility": "Разрабатывать процедуры по обработке информации хранилища данных Компании в СУБД Oracle. Оптимизация кода (опыт работы с оптимизаторами). Взаимодействовать с заказчиками...", "salary": 0}, {"name": "Senior Python Developer", "url": "https://hh.ru/vacancy/109070335", "requirement": "Опыт работы в коммерческой разработке от 6 лет. Высшее образование. Опыт работы с различными фреймворками, библиотеками и инструментами, используемыми в...", "responsibility": "Разработка и поддержка программного обеспечения на языке программирования Python. Анализ и оптимизация существующего кода. Участие в проектировании архитектуры программных продуктов. ", "salary": 0}, {"name": "Python-разработчик системы логистических операций в Яндекс.Лавку", "url": "https://hh.ru/vacancy/92581092", "requirement": "Уверенно знаете любой современный язык программирования. Понимаете, как устроены *nix-подобные операционные системы. Способны работать и в команде, и самостоятельно. ", "responsibility": "Яндекс Лавка — сервис быстрой доставки продуктов. Наша команда отвечает за взаимодействие сервиса с курьерами. Здесь происходит управление сменами (от их...", "salary": 0}, {"name": "Senior/Lead Python Developer", "url": "https://hh.ru/vacancy/107798232", "requirement": "Опыт работы с python от 3-х лет, знание принципов разработки и паттернов. Знание numpy, pandas, структуры данных и алгоритмы...", "responsibility": "Проектирование и разработка архитектуры отказоустойчивого, микросервисного решения. Написание тестов к коду, проведение код-ревью проекта, pефакторинг сложного кода математиков. ", "salary": 0}, {"name": "ML-Python разработчик (LLM)", "url": "https://hh.ru/vacancy/106994429", "requirement": "Опыт работы более 2-х лет в качестве <highlighttext>Python</highlighttext>-<highlighttext>разработчика</highlighttext>. Опыт работы с NLP-моделями не менее 1 года. ", "responsibility": "Разработка и обучение моделей машинного обучения для задач NLP: классификация текста, извлечение информации, генерация текста, построение rag-систем, суммаризация, создание...", "salary": 0}, {"name": "Python Developer (Middle+)", "url": "https://hh.ru/vacancy/109304173", "requirement": "Работа в IT-проектах либо командах на позиции <highlighttext>Python</highlighttext> <highlighttext>Developer</highlighttext> от 3-х лет. Построение, понимание и поддержка архитектуры. ", "responsibility": "Разрабатывать и поддерживать Python-приложения и скрипты. Работать с базами данных (MySQL, ClickHouse, Redis). Работать с брокерами сообщений (Kafka). ", "salary": 140000}, {"name": "Senior Python Developer с переходом на Go (PT Application Firewall)", "url": "https://hh.ru/vacancy/110169458", "requirement": "Опыт коммерческой разработки от 5 лет. Опыт разработки на Python. Знание и желание переходить на Go. Знания и опыт в...", "responsibility": "Развитие бэкенд части на Go - проектирование и разработка новых сервисов. Поддержка уже существующих сервисов (Python, Go). Участие в развитии платформы...", "salary": 0}, {"name": "Senior/Lead Python developer", "url": "https://hh.ru/vacancy/108475747", "requirement": "Опыт работы на позиции тимлида или старшего разработчика (Senior <highlighttext>Python</highlighttext> <highlighttext>Developer</highlighttext>) от 2 лет. Глубокие знания Python и опыт разработки...", "responsibility": "Формирование и руководство командой разработки: участие в подборе специалистов, наставничество, поддержка профессионального роста. Организация и координация работы команды для выполнения...", "salary": 0}, {"name": "Python developer/разработчик в онлайн-банк", "url": "https://hh.ru/vacancy/110610327", "requirement": "Работаете на Python от 3 лет. Умеете многопоточно и асинхронно программировать. Свободно работаете с: FastApi, Flask или др. ", "responsibility": "Море спецпредложений на продукты IT-банка. Покрытие затрат на спорт. ЗАДАЧИ. Кодить и тестить код.", "salary": 0}, {"name": "Python Developer (MDR)", "url": "https://hh.ru/vacancy/109157262", "requirement": "Опыт разработки на python и желание использовать Java или JavaScript в работе. Умение разбираться в чужом коде. Практика использования TDD. ", "responsibility": "Количество современных угроз возрастает c каждым днем, и теперь необходимы продукты на базе технологий Big Data и Machine Learning для...", "salary": 0}, {"name": "Python разработчик Middle/Senior в офис", "url": "https://hh.ru/vacancy/106770167", "requirement": "Высшее техническое образование. Понимание ООП, знание паттернов разработки. Опыт работы с языком программирования Python от 2-х лет. ", "responsibility": "Развитием собственных систем (разработка продукта, интеграция с внешними и внутренними сервисами, доработка текущего функционала). Реализация и сопровождение системы в боевом...", "salary": 0}, {"name": "Python-разработчик", "url": "https://hh.ru/vacancy/109535772", "requirement": "Опыт коммерческой разработки на Python от 3-х лет. Опыт многопоточного и асинхронного программирования. Опыт работы с фреймворками: FastApi, asyncio. ", "responsibility": "Проектирование компонентов систем. Организация процесса разработки. Написание и ревью кода.", "salary": 0}, {"name": "Senior Python Developer", "url": "https://hh.ru/vacancy/108700897", "requirement": "опыт коммерческой разработки на Python ― от 5 лет. - опытный пользователь Linux. - опыт работы с реляционными базами данных. - хорошие коммуникативные навыки...", "responsibility": "1. Трансформация и автоматизация бизнес-процессов организации. 2. Разработка библиотек для внутреннего использования.", "salary": 0}, {"name": "Python-разработчик в Толк, Middle+", "url": "https://hh.ru/vacancy/110420661", "requirement": "Опыт работы с брокерами сообщений (предпочтительно Kafka). Опыт участия в разработке распределенных систем. Знание подходов CI/CD и их реализации...", "responsibility": "Один из наших продуктов — Контур.Толк, это облачное пространство для проведения аудио- и видеоконференций с возможностью записи, планированием встреч, интеграцией с...", "salary": 0}, {"name": "Python Programmer", "url": "https://hh.ru/vacancy/104232468", "requirement": "Уверенные знания основных структур данных и алгоритмов, скорости их работы. Уверенные знания принципов ООП. Базовые знания Python. Умение разбираться в...", "responsibility": "Принимать непосредственное участие в разработке фич команды – декомпозиции, написании кода, сопровождении на разных этапах. Участвовать в улучшении и стабилизации фич. ", "salary": 0}, {"name": "Python разработчик/developer в онлайн-банк", "url": "https://hh.ru/vacancy/110871123", "requirement": "ПРЕИМУЩЕСТВА. ОТ ВАС. Опыт от 3 лет. Легко разбираетесь в Python 3. Многопоточно и асинхронно программируете. FastApi, Flask или др. ", "responsibility": "Продвинутый IT-банк в поисках <highlighttext>Python</highlighttext>-<highlighttext>разработчиков</highlighttext> уровня Middle. Кодить и тестировать.", "salary": 0}, {"name": "Преподаватель по IT направлениям", "url": "https://hh.ru/vacancy/108991313", "requirement": "Высшее образование в области IT. Опыт работы в преподавании (желателен, но не обязателен). Знание и умение работать с современными технологиями...", "responsibility": "Компьютерная грамотность. <highlighttext>Python</highlighttext> <highlighttext>разработчик</highlighttext>. Фронтенд-разработка. Разработка игр. Мобильная разработка. Робототехника. 3D моделирование. Искусственный интеллект. Системное администрирование. ", "salary": 0}, {"name": "Python разработчик (Middle+/Senior)", "url": "https://hh.ru/vacancy/107027857", "requirement": "Наши пожелания к знаниям и опыту: Уверенные знания Python. Уверенные знания как минимум одного из Web фреймворков - Django/FastAPI. ", "responsibility": "Возможность развивать личный бренд: выступление на митапах, конференциях, публикация статей. Бесплатные пользование услугами компании: домены, хостинг, SSL.", "salary": 0}, {"name": "ML-Python разработчик (NLP)", "url": "https://hh.ru/vacancy/109536665", "requirement": "Опыт работы более 2-х лет в качестве <highlighttext>Python</highlighttext>-<highlighttext>разработчика</highlighttext>. Опыт работы с NLP-моделями не менее 1 года. ", "responsibility": "Разработка и обучение моделей машинного обучения для задач NLP: классификация текста, извлечение информации, генерация текста, 3.построение rag-систем, суммаризация, создание...", "salary": 0}, {"name": "Python Developer / Backend (Middle)", "url": "https://hh.ru/vacancy/109302055", "requirement": "Опыт работы в Backend разработке на Python от 2 лет. Знание Flask, FastAPI, PostgreSQL, Redis, Celery, Git, Rabbitmq, SQLAlchemy.", "responsibility": "Разработка Backend микросервисов и сервисов. Проектирование новых сервисов, участие в разработке очень масштабной внутренней инфраструктуры проектов. Поддержка существующих сервисов и...", "salary": 220000}, {"name": "Python developer (Персональный финансовый менеджмент)", "url": "https://hh.ru/vacancy/110255801", "requirement": "Опыт работы <highlighttext>Python</highlighttext> <highlighttext>разработчиком</highlighttext> от 2 лет. Владение Python3 на уверенном уровне. Понимание структур данных. Понимание работы с ресурсами...", "responsibility": "Анализ бизнес и системных требований, генерация идей, проработка технических решений, интеграционных взаимодействий. Участие в разработке продуктов и концепций (мозговые штурмы...", "salary": 0}, {"name": "Разработчик python (senior)", "url": "https://hh.ru/vacancy/109062399", "requirement": "Опыт 5+ лет. Знание Python FastAPI, API, Apache Kafka, Docker. Понимание принципов работы серверов. Навыки написания юнит-тестов и...", "responsibility": "Разработка ядра системы, базовой логики и алгоритмов работы всех компонентов. Обеспечение корректной работы всех функций системы и ее логики. ", "salary": 350000}, {"name": "Senior Python Developer", "url": "https://hh.ru/vacancy/109068475", "requirement": "Опыт backend-разработки на Python от 3 лет (Django / Flask / FastAPI), включая самостоятельное проектирование сущностей, REST API и опыт разработки...", "responsibility": "Написание кода бэкенд-сервисов (управляющий контур КХД) на Python 3.10+. Написание DAG Airflow. Контроль за качеством кода команды...", "salary": 0}, {"name": "Senior Data Engineer", "url": "https://hh.ru/vacancy/110266581", "requirement": "Experience: At least 4 years of experience working as a data engineer or <highlighttext>Python</highlighttext> <highlighttext>developer</highlighttext>. Technical Skills: - Python Proficiency: Proficiency...", "responsibility": "Develop scalable and efficient ETL processes from concept to production to ensure seamless data flow. Work closely with data analysts...", "salary": 0}, {"name": "Python Developer (KATA)", "url": "https://hh.ru/vacancy/109151854", "requirement": "Опыт коммерческой разработки на Python от 3 лет. Владение принципами ООП/SOLID, знание шаблонов проектирования, знание стандартных библиотек. ", "responsibility": "Разработка на Python 3 backend части проекта. Работа с микросервисной архитектурой, написание новых сервисов и поддержка существующих. Участие в проработке...", "salary": 0}, {"name": "Middle+ Python-разработчик (Pandas, Numpy, Openpyxl)", "url": "https://hh.ru/vacancy/109830650", "requirement": "Опыт разработки на Python от 3х лет. Минимальный опыт разработки на JavaScript. Опыт обработки данных с помощью Pandas/Dask...", "responsibility": "Разработка скриптов для обработки данных согласно бизнес-логике исходных отчетов, описанной в ТЗ. Разработка web/desktop интерфейсов для работы бизнес...", "salary": 0}, {"name": "ML-Python разработчик (NLP)", "url": "https://hh.ru/vacancy/109537098", "requirement": "Опыт работы более 2-х лет в качестве <highlighttext>Python</highlighttext>-<highlighttext>разработчика</highlighttext>. Опыт работы с NLP-моделями не менее 1 года. ", "responsibility": "Разработка и обучение моделей машинного обучения для задач NLP: классификация текста, извлечение информации, генерация текста, 3.построение rag-систем, суммаризация, создание...", "salary": 0}, {"name": "Senior Python Developer", "url": "https://hh.ru/vacancy/109483674", "requirement": "ASAP. Tech Stack: Django, Django Rest Framework. Имеет опыт работы разработчиком 5+ лет. Production опыт в тех. ", "responsibility": "Когда необходимо, чтобы человек приступил к работе? Какая планируемая загрузка и длительность проекта:", "salary": 0}, {"name": "Python developer (Senior/Team Lead)", "url": "https://hh.ru/vacancy/111029182", "requirement": "Серьезный опыт разработки на Python, широкий технический кругозор. Опыт работы на лидерской позиции. Понимание лучших инженерных практик (автотестирование, код-ревью...", "responsibility": "Руководство командой разработки одной из подсистем внутреннего облака. Обеспечение качества ИТ-сервиса: стабильность функционирования, скорость доставки изменений и внедрения новых...", "salary": 0}, {"name": "Python developer / Разработчик Python (TATLIN.FLEX)", "url": "https://hh.ru/vacancy/107119463", "requirement": "Опыт коммерческой разработки на Python 3.9+ (RPC, TDD, Очереди, Параллелизм). Опыт работы со стандартными библиотеками Python (subprocess, concurrent.futures...", "responsibility": "Департамент TATLIN.FLEX разрабатывает Систему Хранения Данных (СХД) TATLIN.FLEX с гибкими вариантами конфигурации аппаратного комплекса. Для поддержки активного роста продукта, мы...", "salary": 0}, {"name": "Senior Python developer / Инженер-программист (Release engineering)", "url": "https://hh.ru/vacancy/110769485", "requirement": "Отличное знание Python, 3-4 года активного девелопмента. Знание принципов разработки ООП. Опыт разработки приложений и библиотек. Привычка написания юнит...", "responsibility": "Главная цель нашего департамента – создание системы выпуска продуктов, повторного использования кода и компонент, всего процесса разработки и поставки ПО в...", "salary": 0}, {"name": "Golang/Python-разработчик в команду Общих сервисов Облака", "url": "https://hh.ru/vacancy/107690566", "requirement": "Знание основ алгоритмов и структур данных. Знание и базовый опыт работы с ОС семейства Linux/Unix. Опыт коммерческой разработки на...", "responsibility": "Разрабатывать публичные API облачной платформы на Python и Go, а также связанные с ними инструменты: Terraform Provider, SDK и CLI. ", "salary": 0}, {"name": "Senior Python Developer", "url": "https://hh.ru/vacancy/108360373", "requirement": "Опыт коммерческой разработки на Python от 3-х лет. Владение одним из асинхронных фреймворком: FastAPI, AioHttp. Опыт работы с asyncio...", "responsibility": "Этапы отбора: Анкета. Первичное интервью. Техническое интервью. Оффер.", "salary": 0}, {"name": "Python developer / Разработчик Python (KORNFELD)", "url": "https://hh.ru/vacancy/89889144", "requirement": "Уверенное владение Python3 в области сетевого программирования (sockets). Знание сетевых технологий, стека протоколов TCP/IP + представление о модели...", "responsibility": "Kornfeld - это семейство высокопроизводительных коммутаторов для центров обработки данных, поддерживающих на аппаратном уровне обработку трафика L2/L3 и...", "salary": 0}, {"name": "Python Developer Middle+/Senior", "url": "https://hh.ru/vacancy/109738988", "requirement": "Уверенное знание Python 3.8+. Опыт работы с Django, DRF, FastAPI. Опыт работы с шинами данных и брокерами сообщений...", "responsibility": "Разрабатывать новые части системы (микросервисы, SOA). Проводить Code Review коллег. Покрывать написанный код тестами. Вести документирование технической части. ", "salary": 0}, {"name": "Python разработчик (senior)", "url": "https://hh.ru/vacancy/110250462", "requirement": "Отличное знание Python, Django. - Опыт коммерческой разработки на Python от 7 лет. - Знание SQL, опыт работы с MariaDB. - ", "responsibility": "Техническое описание проекта: Работаем со следующими стеками: uwsgi+nginx, python3, django, mysql, sentry; все серверы на debian8. - ", "salary": 0}, {"name": "Программист С++", "url": "https://hh.ru/vacancy/109473176", "requirement": "Не нужно знать идеально все наши технологии. Нужна светлая голова и страстное желание работать.", "responsibility": "Разработка решений по разбору и обработке файлов электронной отчетности. Интеграции Desktop-приложений и облачных сервисов в сфере ЭО и ЭДО. ", "salary": 230000}, {"name": "Qt Python Developer (Frontend)", "url": "https://hh.ru/vacancy/108425400", "requirement": "If you are an experienced <highlighttext>Python</highlighttext> <highlighttext>Developer</highlighttext>, we expect 3+ years of experience with Qt and readiness to master...", "responsibility": "Develop full-cycle developer user interfaces. Use Python and PySide6 (Qt) to develop interfaces. Be ready to use additional...", "salary": 0}, {"name": "Программист С++", "url": "https://hh.ru/vacancy/109473102", "requirement": "Не нужно знать идеально все наши технологии. Нужна светлая голова и страстное желание работать.", "responsibility": "Поддержка и развитие бизнес-логики функционала для документов рабочего времени и бизнесс логики календаря в мобильном приложении. Ежедневные задачи: Разработка...", "salary": 200000}, {"name": "Senior Python Developer", "url": "https://hh.ru/vacancy/108973622", "requirement": "Опыт разработки от 5-и лет в коммерческих проектах с применением веб-сервисов. Отличное знание языка Python. Понимание того как...", "responsibility": "Разработка веб-сервисов: мобильное API, API для web-приложения (админка), разработка интеграционных и служебных сервисов. Реализация сервисов с использованием потоковой...", "salary": 0}, {"name": "Middle Python Developer: Backend / Server side", "url": "https://hh.ru/vacancy/109888857", "requirement": "4+ года опыта с Python(включая asyncio). Опыт работы с FastAPI/Flask или аналогичными фрэймворками. Опыт работы с реляционными...", "responsibility": "Разработка и поддержка инфраструктурных сервисов и систем. Совместная работа с другими командами над архитектурой сервисов и систем. Написание переиспользуемого, тестируемого...", "salary": 4000}, {"name": "Fullstack Python Developer", "url": "https://hh.ru/vacancy/108699316", "requirement": "Опыт разработки на Python (FastAPI), JavaScript (React, jQuery). Знание HTML/CSS, docker. Отличные знания SQL, опыт работы с PostgreSQL. ", "responsibility": "Разработка веб сервисов на Python, JavaScript, PHP. Переписывание фрагментов монолитных приложений на PHP в микросервисные решения на Python. ", "salary": 0}, {"name": "R&D Engineer/Researcher (Python-разработчик-исследователь)", "url": "https://hh.ru/vacancy/110255492", "requirement": "Опыт коммерческой разработки Python, уровень не ниже middle. Уверенные навыки администрирования Linux. Уверенное понимание принципов работы сетей и сетевых протоколов...", "responsibility": "Разрабатывать и прототипировать: микросервисы с использованием Asyncio и AioHTTP, системные утилиты Linux, демоны по настройке и управлению сетью. ", "salary": 0}, {"name": "R&D Engineer/Researcher (Python-разработчик-исследователь)", "url": "https://hh.ru/vacancy/110255492", "requirement": "Опыт коммерческой разработки Python, уровень не ниже middle. Уверенные навыки администрирования Linux. Уверенное понимание принципов работы сетей и сетевых протоколов...", "responsibility": "Разрабатывать и прототипировать: микросервисы с использованием Asyncio и AioHTTP, системные утилиты Linux, демоны по настройке и управлению сетью. ", "salary": 0}, {"name": "Senior Python Developer", "url": "https://hh.ru/vacancy/107262905", "requirement": "5+ years of commercial development experience with Python. Strong theoretical foundation (algorithms, design patterns, asynchronous programming). Experience with FastAPI...", "responsibility": "Participation in the development of architectural solutions. Maintenance and development of the company’s existing services. Optimization of services for...", "salary": 0}, {"name": "Программист С++", "url": "https://hh.ru/vacancy/109473069", "requirement": "Не нужно знать идеально все наши технологии. Нужна светлая голова и страстное желание работать.", "responsibility": "Поддержка и развитие бизнес-логики функционала для документов рабочего времени и бизнесс логики календаря в мобильном приложении. Ежедневные задачи: Разработка...", "salary": 200000}, {"name": "Python разработчик/developer в IT-банк", "url": "https://hh.ru/vacancy/109736688", "requirement": "ПРЕИМУЩЕСТВА. ОТ ВАС. Опыт от 3 лет. Легко разбираетесь в Python 3. Многопоточно и асинхронно программируете. FastApi, Flask или др. ", "responsibility": "Продвинутый IT-банк в поисках <highlighttext>Python</highlighttext>-<highlighttext>разработчиков</highlighttext> уровня Middle. Кодить и тестировать.", "salary": 0}, {"name": "Python Developer (Web)", "url": "https://hh.ru/vacancy/109965983", "requirement": "Опыт разработки от 5-ти лет. Опыт работы с современными веб-фреймворками FastAPI, Django и т.п. Уверенные знания жизненного...", "responsibility": "Проектированием и разработкой библиотек и сервисов для разных предметных областей. Улучшением процессов и подходов в команде разработки через написание линтеров...", "salary": 0}, {"name": "Middle / Middle+ Python Developer (Backend)", "url": "https://hh.ru/vacancy/109481146", "requirement": "Большой опыт работы с библиотекой asyncio, понимание принципов ее работы. Опыт работы с threading, знание основных примитивов синхронизации. ", "responsibility": "Поддержка и развитие функционала действующих проектов. Рефакторинг кода. Участие в разработке новых проектов. Участие в разработке программной архитектуры проектов. ", "salary": 180000}, {"name": "Middle Python-разработчик (Django)", "url": "https://hh.ru/vacancy/110428531", "requirement": "Опыт работы с Django и Django REST Framework. Знание языка программирования Python и понимание Pythonic way. Опыт работы с системами...", "responsibility": "Разработка новой системы мониторинга и управления серверами. Разработка и интеграция API для взаимодействия с другими системами и сервисами. ", "salary": 0}, {"name": "Senior/Lead Python - разработчик", "url": "https://hh.ru/vacancy/109822042", "requirement": "Опыт проектирования на уровне продукта/сервиса, опыт запуска проектов с нуля, ответственность за архитектуру и технические решения. Здорово, если у...", "responsibility": "Исследовать производительность, искать узкие места и помогать командам с настройкой запуска сервиса. Проводить ревью и работать с Open-Source-решениями. ", "salary": 0}, {"name": "Backend Python Developer (FastAPI, Highload)", "url": "https://hh.ru/vacancy/109760236", "requirement": "Какой опыт важен: Python. От 4-х лет. FastAPI. От 2-х лет. Микросервисы. Опыт проектирования или участие в этом. ", "responsibility": "Премии за привлечение новых сотрудников и новых клиентов. Проводим митапы по Python. Вы можете быть как и слушателем, так и...", "salary": 390000}, {"name": "Senior backend developer - Python", "url": "https://hh.ru/vacancy/109067043", "requirement": "5+ years of experience as <highlighttext>Python</highlighttext> <highlighttext>Developer</highlighttext>. Experience in designing and developing scalable backends and REST APIs. ", "responsibility": "Developed and deployed application on AWS. Participated in architecture discussions on your previous projects.", "salary": 4000}, {"name": "Продакт Разработчик Python AI", "url": "https://hh.ru/vacancy/110683187", "requirement": "2+ года опыта в Python с выдающимися достижениями. Увлечение передовыми технологиями, опыт применения GPT для анализа данных с подключением...", "responsibility": "Отвечаете за доставку проектов в продакшн каждую неделю и решаете кросс-командных проблемы для этого. Грумите и планируете беклог. ", "salary": 2700}, {"name": "Python разработчик (Middle+/Senior)", "url": "https://hh.ru/vacancy/108725060", "requirement": "Наши пожелания к знаниям и опыту: Уверенные знания Python. Уверенные знания как минимум одного из Web фреймворков - Django/FastAPI. ", "responsibility": "Возможность развивать личный бренд: выступление на митапах, конференциях, публикация статей. Бесплатные пользование услугами компании: домены, хостинг, SSL.", "salary": 0}, {"name": "Senior Python Developer (Команда Поиска)", "url": "https://hh.ru/vacancy/110232883", "requirement": "Имеешь опыт коммерческой разработки на Python от 3-х лет. Пишешь типизированный код. OOP и SOLID для тебя не пустой...", "responsibility": "Развивать и поддерживать API существующих сервисов (search API, vector store, assistant). Проектировать вместе с командой общую архитектуру под новые вызовы...", "salary": 0}, {"name": "Middle/Senior Python Developer", "url": "https://hh.ru/vacancy/110262084", "requirement": "Коммерческий опыт создания веб-приложений с использованием Python-фреймворков (Django, FastAPI, Flask) от 2 лет. Знание Python Core и стандартной...", "responsibility": null, "salary": 0}, {"name": "Senior Python-разработчик (команда разработки поиска)", "url": "https://hh.ru/vacancy/105681557", "requirement": "Опыт коммерческой разработки не менее трёх лет. Уверенное знание Python 3.9 и выше. Владение асинхронной разработкой на Python. ", "responsibility": "Выполнение технически сложных задач, проектирование архитектуры приложений. Применение знаний в области доставки приложений на контур (CI/CD). Не только самостоятельное...", "salary": 0}, {"name": "Senior Python developer / Инженер-программист (Release engineering)", "url": "https://hh.ru/vacancy/110769486", "requirement": "Отличное знание Python, 3-4 года активного девелопмента. Знание принципов разработки ООП. Опыт разработки приложений и библиотек. Привычка написания юнит...", "responsibility": "Главная цель нашего департамента – создание системы выпуска продуктов, повторного использования кода и компонент, всего процесса разработки и поставки ПО в...", "salary": 0}, {"name": "Fullstack (Python + React) Python разработчик", "url": "https://hh.ru/vacancy/109292305", "requirement": "Требуемый опыт: от 1 года. - Опыт работы с Postgresql.", "responsibility": "Проектирование архитектуры сервиса (без сложных схем). - Разработка фичей, фикс багов. - Внедрение решений в прод. - Написание автотестов для фичей. - ", "salary": 100000}, {"name": "Python Midle+/Senior Developer (Flask/Django)", "url": "https://hh.ru/vacancy/109685005", "requirement": "Опыт работы с фреймворками Flask или Django. Знание и опыт работы с реляционными базами данных, предпочтительно PostgreSQL. Опыт работы с...", "responsibility": "Присоединиться к разработке новых проектов (никакого легаси) - сервис для рассылки уведомлений игрокам, собственная система тех поддержки и внутрипортальная валюта. ", "salary": 0}, {"name": "Senior Python разработчик", "url": "https://hh.ru/vacancy/106528974", "requirement": "Опыт коммерческой разработки на Python и FastAPI. Опыт работы с микросервисной архитектурой и высокими нагрузками. Понимание принципов CI/CD, опыт...", "responsibility": "Продумывать архитектуру высоконагруженных сервисов на Python. Организовывать взаимодействие сервисов на Python с сервисами на других языках программирования. Помогать команде ML...", "salary": 0}, {"name": "Программист С++", "url": "https://hh.ru/vacancy/109473298", "requirement": "Не нужно знать идеально все наши технологии. Нужна светлая голова и страстное желание работать.", "responsibility": "Разработка решений по разбору и обработке файлов электронной отчетности. Интеграции Desktop-приложений и облачных сервисов в сфере ЭО и ЭДО. ", "salary": 200000}, {"name": "Python developer / Разработчик Python (KORNFELD)", "url": "https://hh.ru/vacancy/89889132", "requirement": "Уверенное владение Python3 в области сетевого программирования (sockets). Знание сетевых технологий, стека протоколов TCP/IP + представление о модели...", "responsibility": "Kornfeld - это семейство высокопроизводительных коммутаторов для центров обработки данных, поддерживающих на аппаратном уровне обработку трафика L2/L3 и...", "salary": 0}, {"name": "Python Developer (Senior/Middle)", "url": "https://hh.ru/vacancy/110200115", "requirement": "Опыт разработки на Python от 3 лет. Опыт работы с Django (Django Rest Framework, Django ORM). Опыт разработки VueJS. ", "responsibility": "Участие в интересном проекте телемедицины. Разработка Бэк и Фронт. - Проектирование решений. - Обучение и контроль работы джунов и фрилансеров. - ", "salary": 1200}, {"name": "Senior Python Developer", "url": "https://hh.ru/vacancy/98305160", "requirement": "Опыт написания работающего кода на Python. Опыт разработки на Python 3 и Django в боевых проектах. Тестирование системы и обеспечение...", "responsibility": "Внедрение нового функционала. Поддержка и расширение имеющихся разделов, API. Разработка unit-тестов.", "salary": 0}, {"name": "Team lead Developer AI", "url": "https://hh.ru/vacancy/110332973", "requirement": "Опыт управления командами разработки 3-5 человек. Знание основ Scrum. Умение общаться, находить нужных людей для решения вопросов команды. ", "responsibility": "Адаптивные пользовательские интерфейсы для разных нужд. Видеоаналитические модули. Интеграция с пользовательскими скриптами. Trassir Cloud - облачный сервис видеонаблюдения. Мобильный клиент к...", "salary": 0}, {"name": "Team Lead Python", "url": "https://hh.ru/vacancy/110216981", "requirement": "Fully remote work format. English B2+. Experience in <highlighttext>Python</highlighttext> <highlighttext>development</highlighttext> for at least 2-3 years. ", "responsibility": "Develop and maintain the backend of web applications using Python. Design and implement RESTful APIs. Work with databases (SQL and...", "salary": 0}, {"name": "Python разработчик/developer в IT-банк", "url": "https://hh.ru/vacancy/108915676", "requirement": "ПРЕИМУЩЕСТВА. ОТ ВАС. Опыт от 3 лет. Легко разбираетесь в Python 3. Многопоточно и асинхронно программируете. FastApi, Flask или др. ", "responsibility": "Продвинутый IT-банк в поисках <highlighttext>Python</highlighttext>-<highlighttext>разработчиков</highlighttext> уровня Middle. Кодить и тестировать.", "salary": 0}, {"name": "Senior/Lead Python - разработчик", "url": "https://hh.ru/vacancy/109822220", "requirement": "Опыт проектирования на уровне продукта/сервиса, опыт запуска проектов с нуля, ответственность за архитектуру и технические решения. Здорово, если у...", "responsibility": "Исследовать производительность, искать узкие места и помогать командам с настройкой запуска сервиса. Проводить ревью и работать с Open-Source-решениями. ", "salary": 0}, {"name": "Middle python developer", "url": "https://hh.ru/vacancy/107983055", "requirement": "Опыт работы с python (от 2-x лет), в том числе асинхронным. Знание базовых алгоритмов и структур данных. ", "responsibility": "Разработка новой функциональности. Исправление ошибок, рефакторинг в составе кросс-функциональной команды, которая занимается биллингами и аутентификацией.", "salary": 0}, {"name": "FullStack/Backend (Python+Angular/Python) разработчик", "url": "https://hh.ru/vacancy/109761870", "requirement": "Не менее одного года опыта в должности разработчика backend на языке Python. Умение разрабатывать и поддерживать микросервисную архитектуру на базе...", "responsibility": "Делать развертывание программного обеспечения. Осуществлять разработку и обеспечивать поддержку бэкенд-компонентов на языке Python. Создавать RESTful API, применяя фреймворки FastAPI. ", "salary": 0}, {"name": "Team lead Developer AI", "url": "https://hh.ru/vacancy/110332974", "requirement": "Опыт управления командами разработки 3-5 человек. Знание основ Scrum. Умение общаться, находить нужных людей для решения вопросов команды. ", "responsibility": "Адаптивные пользовательские интерфейсы для разных нужд. Видеоаналитические модули. Интеграция с пользовательскими скриптами. Trassir Cloud - облачный сервис видеонаблюдения. Мобильный клиент к...", "salary": 0}, {"name": "Python программист + фронт (react) + PG = fullstack", "url": "https://hh.ru/vacancy/109955859", "requirement": "Опыт на front'e - очень сильно желателен. Желательно react.js. Если опыта с react - нет, то все равно можем рассмотреть. ", "responsibility": "Проект - чтото вроде специализированной учетной системы. Включает в себя интеграцию с внешними подсистемами, создание (доработку, поддержку) веб-портала (вот самой...", "salary": 80000}, {"name": "Python Developer (Senior | Lead)", "url": "https://hh.ru/vacancy/106727470", "requirement": "ОБЯЗАТЕЛЬНО опыт глубокой кастомизации Apache SuperSet + AirFlow. ОБЯЗАТЕЛЬНО опыт реализации корпоративных BI решений и DWH на MS PBI и...", "responsibility": "Помогаем детским домам, школам, приютам для животных. Озеленяем город, бережем ресурсы. Поддерживаем социальные инициативы сотрудников.", "salary": 0}, {"name": "Senior/Lead Python - разработчик", "url": "https://hh.ru/vacancy/109822260", "requirement": "Опыт проектирования на уровне продукта/сервиса, опыт запуска проектов с нуля, ответственность за архитектуру и технические решения. Здорово, если у...", "responsibility": "Исследовать производительность, искать узкие места и помогать командам с настройкой запуска сервиса. Проводить ревью и работать с Open-Source-решениями. ", "salary": 0}, {"name": "Senior Python Developer в MLOps", "url": "https://hh.ru/vacancy/109213943", "requirement": "Опыт разработки на Python от 4 лет с упором на высоконагруженные и масштабируемые системы. Глубокое понимание асинхронного программирования (asyncio, aiohttp...", "responsibility": "Разработка асинхронных сервисов на Python, оборачивая их в gRPC для эффективного взаимодействия компонентов системы. Автоматизация и оркестрация задач в Apache...", "salary": 0}, {"name": "Senior/Lead Python - разработчик", "url": "https://hh.ru/vacancy/109822111", "requirement": "Опыт проектирования на уровне продукта/сервиса, опыт запуска проектов с нуля, ответственность за архитектуру и технические решения. Здорово, если у...", "responsibility": "Исследовать производительность, искать узкие места и помогать командам с настройкой запуска сервиса. Проводить ревью и работать с Open-Source-решениями. ", "salary": 0}, {"name": "Python developer/разработчик в Fintech", "url": "https://hh.ru/vacancy/109187215", "requirement": "ПРЕИМУЩЕСТВА. ОТ ВАС. Опыт от 3 лет. Легко разбираетесь в Python 3. Многопоточно и асинхронно программируете. FastApi, Flask или др. ", "responsibility": "Продвинутый IT-банк в поисках <highlighttext>Python</highlighttext>-<highlighttext>разработчиков</highlighttext> уровня Middle. Кодить и тестировать.", "salary": 0}, {"name": "Senior Python Developer", "url": "https://hh.ru/vacancy/109560350", "requirement": "Коммерческий опыт разработки на Python 3.0+ (Django или FastAPI) от 5 лет. - Опыт работы с asyncio. - ", "responsibility": "Проектирование и реализация ключевых компонентов системы. - Работа с бизнес-требованиями от отдела BA и их декомпозиция для команды. - ", "salary": 0}, {"name": "Senior Python Developer в MLOps", "url": "https://hh.ru/vacancy/109214577", "requirement": "Опыт разработки на Python от 4 лет с упором на высоконагруженные и масштабируемые системы. Глубокое понимание асинхронного программирования (asyncio, aiohttp...", "responsibility": "Разработка асинхронных сервисов на Python, оборачивая их в gRPC для эффективного взаимодействия компонентов системы. Автоматизация и оркестрация задач в Apache...", "salary": 0}, {"name": "Senior Python developer", "url": "https://hh.ru/vacancy/109951705", "requirement": "Хорошее знание Python (3.x). Опыт проектирования распределенных приложений. Опыт работы с многопоточными приложениями и системами очередей. Опыт разработки API...", "responsibility": "Разработка приложения для расчета данных буровых скважин, их последующего хранения и обработки сторонним ПО. Участие в обсуждении технических особенностей и...", "salary": 0}, {"name": "Middle +/ Senior Python developer (Django/FastAPI) AdTech (работа в офисе)", "url": "https://hh.ru/vacancy/106638022", "requirement": "Опыт коммерческой разработки от 4-х лет. Опыт работы с Rest API, Django/Fastapi (оба фреймворка важны). Понимание архитектуры бэкенда...", "responsibility": "Разработка и поддержка существующих интерфейсов инструментов аналитики и управления рекламными кампаниями. Разработка и поддержка back-end на Python. ", "salary": 350000}, {"name": "C++/Python Developer (Санкт-Петербург)", "url": "https://hh.ru/vacancy/103141913", "requirement": "Опыт программирования от 3 лет. Знание С++. Знание Python или готовность изучать. Знание основных алгоритмов и структур данных. ", "responsibility": "Задачами по техническому развитию проекта «Мир танков». Проектированием и разработкой архитектуры игры. Проведением технических задач по процессам разработки «Мира танков». ", "salary": 0}, {"name": "NLP разработчик", "url": "https://hh.ru/vacancy/105798905", "requirement": "Проработали от 2 лет в области создания программного обеспечения в роли <highlighttext>python</highlighttext>-<highlighttext>разработчика</highlighttext>, из них от 1 года в области...", "responsibility": "Разработкой, тестированием и улучшением алгоритмов и моделей NLP для задач поиска, суммаризации и классификации текстов при помощи LLM. ", "salary": 0}, {"name": "Python Developer (ML team)", "url": "https://hh.ru/vacancy/108106294", "requirement": "Успешно проработали 3+ лет в области создания программного обеспечения в роли senior инженера python, из них 1+ лет...", "responsibility": "Проектировать архитектуру, разрабатывать и запускать отказоустойчивые и быстрые сервисы c DS-решениями. Работать с данными и писать пайплайны для обработки...", "salary": 0}, {"name": "Senior backend developer - Python", "url": "https://hh.ru/vacancy/109067045", "requirement": "5+ years of experience as <highlighttext>Python</highlighttext> <highlighttext>Developer</highlighttext>. Experience in designing and developing scalable backends and REST APIs. ", "responsibility": "Developed and deployed application on AWS. Participated in architecture discussions on your previous projects.", "salary": 4000}, {"name": "Senior Python Developer в MLOps", "url": "https://hh.ru/vacancy/109214114", "requirement": "Опыт разработки на Python от 4 лет с упором на высоконагруженные и масштабируемые системы. Глубокое понимание асинхронного программирования (asyncio, aiohttp...", "responsibility": "Разработка асинхронных сервисов на Python, оборачивая их в gRPC для эффективного взаимодействия компонентов системы. Автоматизация и оркестрация задач в Apache...", "salary": 0}, {"name": "Senior Python Developer / Старший Python-разработчик", "url": "https://hh.ru/vacancy/109546391", "requirement": "Опыт работы с Python 3.7 и выше, желателен опыт с асинхронным и многопоточным кодом. Опыт работы с Django (предпочтительно...", "responsibility": "Участие в проектировании архитектуры систем. Поддержка и разработка сервисов и модулей на Python. При необходимости, написание сопутствующих shell-скриптов. ", "salary": 0}, {"name": "Автор курсов по Python разработке (техлид)", "url": "https://hh.ru/vacancy/109137505", "requirement": "Есть опыт работы <highlighttext>Python</highlighttext> <highlighttext>разработчиком</highlighttext> от 3х лет. Есть опыт работы с фреймворками Django и Flask. Есть опыт работы...", "responsibility": "Разработка и поддержка контента для профессии \"<highlighttext>Python</highlighttext>-<highlighttext>разработчик</highlighttext>\", включающая в себя создание и редактирование учебных материалов, механик курсов и отдельных...", "salary": 150000}, {"name": "Lead Python Developer (Офис)", "url": "https://hh.ru/vacancy/105710178", "requirement": "Знать ООП и структур данных Python, асинхронность, gil, мультипроцессинг / мультитрединг. Уверенно работать с Django, Django REST, FastApi. Знать что такое...", "responsibility": "Разрабатывать компоненты, модули, сайты, скрипты и api на Python. Помогать коллегам разбираться с проблемами в разработке. Участвовать в обсуждениях по...", "salary": 230000}, {"name": "Senior/Lead Python - разработчик", "url": "https://hh.ru/vacancy/109719772", "requirement": "Опыт проектирования на уровне продукта/сервиса, опыт запуска проектов с нуля, ответственность за архитектуру и технические решения. Здорово, если у...", "responsibility": "Исследовать производительность, искать узкие места и помогать командам с настройкой запуска сервиса. Проводить ревью и работать с Open-Source-решениями. ", "salary": 0}, {"name": "Архитектор продуктовой разработки", "url": "https://hh.ru/vacancy/105816313", "requirement": "БД и SQL (PostgreSQL). - знание основ БД: Сущности и Отношения, Ключи, Джойны; умение писать и читать/разбираться select'ы - must. - ", "responsibility": "Архитектор. - Разработка функционала процесса расследования подозрительных операций клиентов (отображение данных по операции, участникам, счетам). - Настройка ролевой модели (включая преднастроенные роли...", "salary": 0}, {"name": "Senior Python Developer в команду бэкенд-инфраструктуры", "url": "https://hh.ru/vacancy/99611844", "requirement": "Способны находить общий язык с продуктовыми менеджерами и техническими специалистами из других областей.", "responsibility": "Разрабатывать и оптимизировать фреймворк для высоконагруженных ML-сервисов — обучать ML-модели не нужно, мы разрабатываем только бэкенд. Создавать библиотеки для...", "salary": 0}, {"name": "Senior Python Developer", "url": "https://hh.ru/vacancy/98305572", "requirement": "Опыт написания работающего кода на Python. Опыт разработки на Python 3 и Django в боевых проектах. Тестирование системы и обеспечение...", "responsibility": "Внедрение нового функционала. Поддержка и расширение имеющихся разделов, API. Разработка unit-тестов.", "salary": 0}, {"name": "Middle python-разработчик (краудсорсинговая платформа TagMe)", "url": "https://hh.ru/vacancy/109147901", "requirement": "Имеете опыт промышленной командной разработки на Python от 3 лет. Имеете опыт работы с PostgreSQL. Знаете английский язык: сможете прочитать...", "responsibility": "Разрабатывать сервисы на Python, работать с PostgreSQL.", "salary": 0}, {"name": "Tech Lead Python Developer в проект Внешние интеграции", "url": "https://hh.ru/vacancy/108460582", "requirement": "Имеете опыт разработки на Python 3.X. Понимаете механику языка Python и сопутствующих инструментов (pytest, mypy, poetry, flake8). ", "responsibility": "Лидировать процесс разработки в команде. Реализовывать высоконагруженные и производительные сервисы на Python. Организовывать и принимать непосредственное участие в проектировании архитектуры...", "salary": 0}, {"name": "Python программист + фронт (возможно react) + PG = fullstack", "url": "https://hh.ru/vacancy/109305304", "requirement": "Опыт на front'e - очень сильно желателен. Желательно react.js. Если опыта с react - нет, то все равно можем рассмотреть. ", "responsibility": "Проект - чтото вроде специализированной учетной системы. Включает в себя интеграцию с внешними подсистемами, создание (доработку, поддержку) веб-портала (вот самой...", "salary": 80000}, {"name": "Senior Python Developer в MLOps", "url": "https://hh.ru/vacancy/109211791", "requirement": "Опыт разработки на Python от 4 лет с упором на высоконагруженные и масштабируемые системы. Глубокое понимание асинхронного программирования (asyncio, aiohttp...", "responsibility": "Разработка асинхронных сервисов на Python, оборачивая их в gRPC для эффективного взаимодействия компонентов системы. Автоматизация и оркестрация задач в Apache...", "salary": 0}, {"name": "Преподаватель курса Python Developer", "url": "https://hh.ru/vacancy/110242384", "requirement": "Наличие коммерческого опыта работы в качестве <highlighttext>Python</highlighttext> <highlighttext>разработчика</highlighttext> от 2 лет. Знание технологий: Python (стандартные библиотеки), Django, SQL, PostgreSQL, HTML...", "responsibility": "Проведение онлайн лекций для групп студентов (в каждой группе до 20-25 человек) в Zoom - у нас полностью готовая программа...", "salary": 1600}, {"name": "Python разработчик/developer в финтех-гигант", "url": "https://hh.ru/vacancy/109427970", "requirement": "Работаете на Python от 3 лет. Умеете многопоточно и асинхронно программировать. Свободно работаете с: FastApi, Flask или др. ", "responsibility": "Море спецпредложений на продукты IT-банка. Покрытие затрат на спорт. ЗАДАЧИ. Кодить и тестить код.", "salary": 0}, {"name": "Преподаватель курса Python Developer", "url": "https://hh.ru/vacancy/110242383", "requirement": "Наличие коммерческого опыта работы в качестве <highlighttext>Python</highlighttext> <highlighttext>разработчика</highlighttext> от 2 лет. Знание технологий: Python (стандартные библиотеки), Django, SQL, PostgreSQL, HTML...", "responsibility": "Проведение онлайн лекций для групп студентов (в каждой группе до 20-25 человек) в Zoom - у нас полностью готовая программа...", "salary": 1600}, {"name": "Инженер-программист (Middle Python Developer)", "url": "https://hh.ru/vacancy/109470037", "requirement": "Прототипировать крайне быстро сервисы, связанные с AI. Доводить успешные эксперименты до уровня готовности к эксплуатации в продакшене и масштабировать. ", "responsibility": "Работать с базами и хранилищами. Создавать API для общения с другими сервисами. Оптимизация и масштабирование работы с базами данных с...", "salary": 0}, {"name": "Senior Python Developer (Highload, Crypto)", "url": "https://hh.ru/vacancy/108806391", "requirement": "Python. От 5-ти лет. Redis, Pydantic, SQLAlchemy, Alembic. Опыт проектирования приложений/сервисов. Best practice. Архитектурные паттерны (Saga), алгоритмы, структуры...", "responsibility": "FastAPI. С / С++ / Rust. Блокчейн. Проектированием высоконагруженных и масштабируемых приложений (от 300 RPS). Шифрование. DevOps (мониторинг, стабилизация работы приложения).", "salary": 500000}, {"name": "Senior Python Developer", "url": "https://hh.ru/vacancy/110424832", "requirement": "Опыт работы разработчиком не менее 3 лет на стеке Python 3. Опыт разработки RESTful backend на Python 3 и asyncio...", "responsibility": "Выполнение проектов заказчика в срок и с хорошим качеством. Анализ бизнес-требований. Разработка бизнес-логики приложений в виде RESTful сервисов. ", "salary": 0}, {"name": "Senior Python-developer", "url": "https://hh.ru/vacancy/110608820", "requirement": "Опыт коммерческой разработки от 3-х лет. Уверенное программирование на Python или других скриптовых языках с последующей миграцией на Python. ", "responsibility": "Разработка — 70% времени. Ревью кода — 20% времени. Контроль сроков — 10% времени. Общение с крутыми людьми – 100% времени!", "salary": 270000}, {"name": "Python Developer (ML)", "url": "https://hh.ru/vacancy/107568122", "requirement": "Experience as an ML Engineer for 3+ years. Strong proficiency in Python and knowledge of common ML libraries (PyTorch...", "responsibility": "Writing services and APIs that allow access to the ML models. Reducing the run-time of processing millions of data...", "salary": 0}, {"name": "Python Developer (Fullstack)", "url": "https://hh.ru/vacancy/109120108", "requirement": "высшее техническое образование. - опыт работы с Python, Django не менее 1 года. - знание фреймворков Python, таких как Flask или FastAPI...", "responsibility": "командная работа, анализ и оценка сложности, стандарты кодирования, обзоры кода, лучшие практики, управление системой контроля версий и т.д. - ", "salary": 0}, {"name": "Python разработчик/developer в финтех-гигант", "url": "https://hh.ru/vacancy/110203540", "requirement": "Работаете на Python от 3 лет. Умеете многопоточно и асинхронно программировать. Свободно работаете с: FastApi, Flask или др. ", "responsibility": "Море спецпредложений на продукты IT-банка. Покрытие затрат на спорт. ЗАДАЧИ. Кодить и тестить код.", "salary": 0}, {"name": "Senior backend developer - Python", "url": "https://hh.ru/vacancy/109067044", "requirement": "5+ years of experience as <highlighttext>Python</highlighttext> <highlighttext>Developer</highlighttext>. Experience in designing and developing scalable backends and REST APIs. ", "responsibility": "Developed and deployed application on AWS. Participated in architecture discussions on your previous projects.", "salary": 4000}, {"name": "Qt Python Developer", "url": "https://hh.ru/vacancy/108425418", "requirement": "If you are an experienced <highlighttext>Python</highlighttext> <highlighttext>Developer</highlighttext>, we expect 3+ years of experience with Qt and readiness to master...", "responsibility": "Develop full-cycle developer user interfaces. Use Python and PySide6 (Qt) to develop interfaces. Be ready to use additional...", "salary": 0}, {"name": "Преподаватель курса «Python-разработчик»", "url": "https://hh.ru/vacancy/108812342", "requirement": "Чтение курсов по направлению Python. Высшее техническое образование. Опыт разработки на Python от 3 лет. Опыт преподавания. Знание фреймворков Django...", "responsibility": "Разработка материалов курсов по данному направлению. Тестирование приложений (doctest, unittest, pytest). Работа с высокоуровневым API Python asyncio. ООсновы построения web...", "salary": 0}, {"name": "Senior backend developer - Python", "url": "https://hh.ru/vacancy/109067046", "requirement": "5+ years of experience as <highlighttext>Python</highlighttext> <highlighttext>Developer</highlighttext>. Experience in designing and developing scalable backends and REST APIs. ", "responsibility": "Developed and deployed application on AWS. Participated in architecture discussions on your previous projects.", "salary": 4000}, {"name": "Инженер-программист (Senior Python Developer)", "url": "https://hh.ru/vacancy/110135721", "requirement": "Минимум 5 лет практического опыта разработки на Python. Глубокое владение веб-фреймворком Django. Обширный опыт работы с RabbitMQ, Kafka, Redis...", "responsibility": "Работать в команде R&D. Ставить в приоритет простоту и функциональность при разработке кода для обеспечения эффективных и масштабируемых решений. ", "salary": 0}, {"name": "Senior Python-developer (Django)", "url": "https://hh.ru/vacancy/110254336", "requirement": "Какой опыт важен: Python. От 5-и лет. Асинхронный Python. Важен коммерческий опыт работы с Asyncio. Будет плюсом опыт с...", "responsibility": "Этапы рекрутинга: HR -> Tech -> Offer. Высоконагруженными сервисами. Премии за привлечение новых сотрудников и новых клиентов. Проводим митапы по Python. ", "salary": 360000}, {"name": "Senior python developer", "url": "https://hh.ru/vacancy/93628316", "requirement": "Крепкое знание python3 (опыт от 4-5 лет). Умение проектировать и развивать архитектуру сервиса. Умение писать нормальный код, работа...", "responsibility": "Разрабатывать высокопроизводительные сервисы на Python. Заниматься переработкой существующих сервисов - рефакторинг, оптимизация, переработка архитектуры, отказоустойчивость. Развивать продукт - разрабатывать новые продуктовые фичи...", "salary": 0}, {"name": "Senior Python developer", "url": "https://hh.ru/vacancy/111250547", "requirement": "Опыт разработки Backend приложений (Python 3.>) от 5 лет. Уверенное владение базовыми архитектурными паттернами. Понимание асинхронной парадигмы программирования. ", "responsibility": "Участие в развитии десктопного приложения AMQPUtil. Проектирование и разработка платформы для оптимизации и ускорения написание интеграционных приложений на шине RHAMQ...", "salary": 0}, {"name": "Middle Python developer", "url": "https://hh.ru/vacancy/111250660", "requirement": "Писать интеграции для внешних сервисов: как правило это или публичное REST API, или фронтенд-API (нужно уметь разобраться в нем...", "responsibility": "Legal Resourсes» - аккредитованная ИТ компания, которая занимается созданием программных продуктов, микросервисов и информационных ресурсов для автоматизации юридических действий в рамках...", "salary": 120000}]